{
  "Definition": [
    {
      "ID": "oval:org.altlinux.errata:def:20222931",
      "Version": "oval:org.altlinux.errata:def:20222931",
      "Class": "patch",
      "Metadata": {
        "Title": "ALT-PU-2022-2931: package `thunderbird` update to version 102.2.1-alt1",
        "AffectedList": [
          {
            "Family": "unix",
            "Platforms": [
              "ALT Linux branch p10"
            ],
            "Products": [
              "ALT Server",
              "ALT Virtualization Server",
              "ALT Workstation",
              "ALT Workstation K",
              "ALT Education",
              "Simply Linux",
              "Starterkit"
            ]
          }
        ],
        "References": [
          {
            "RefID": "ALT-PU-2022-2931",
            "RefURL": "https://errata.altlinux.org/ALT-PU-2022-2931",
            "Source": "ALTPU"
          },
          {
            "RefID": "BDU:2022-04062",
            "RefURL": "https://bdu.fstec.ru/vul/2022-04062",
            "Source": "BDU"
          },
          {
            "RefID": "BDU:2022-04065",
            "RefURL": "https://bdu.fstec.ru/vul/2022-04065",
            "Source": "BDU"
          },
          {
            "RefID": "BDU:2022-04243",
            "RefURL": "https://bdu.fstec.ru/vul/2022-04243",
            "Source": "BDU"
          },
          {
            "RefID": "BDU:2022-04769",
            "RefURL": "https://bdu.fstec.ru/vul/2022-04769",
            "Source": "BDU"
          },
          {
            "RefID": "BDU:2022-05298",
            "RefURL": "https://bdu.fstec.ru/vul/2022-05298",
            "Source": "BDU"
          },
          {
            "RefID": "BDU:2022-05444",
            "RefURL": "https://bdu.fstec.ru/vul/2022-05444",
            "Source": "BDU"
          },
          {
            "RefID": "BDU:2022-05446",
            "RefURL": "https://bdu.fstec.ru/vul/2022-05446",
            "Source": "BDU"
          },
          {
            "RefID": "BDU:2022-05447",
            "RefURL": "https://bdu.fstec.ru/vul/2022-05447",
            "Source": "BDU"
          },
          {
            "RefID": "BDU:2022-05479",
            "RefURL": "https://bdu.fstec.ru/vul/2022-05479",
            "Source": "BDU"
          },
          {
            "RefID": "BDU:2022-05486",
            "RefURL": "https://bdu.fstec.ru/vul/2022-05486",
            "Source": "BDU"
          },
          {
            "RefID": "BDU:2022-05488",
            "RefURL": "https://bdu.fstec.ru/vul/2022-05488",
            "Source": "BDU"
          },
          {
            "RefID": "BDU:2022-05497",
            "RefURL": "https://bdu.fstec.ru/vul/2022-05497",
            "Source": "BDU"
          },
          {
            "RefID": "BDU:2022-05566",
            "RefURL": "https://bdu.fstec.ru/vul/2022-05566",
            "Source": "BDU"
          },
          {
            "RefID": "BDU:2022-05989",
            "RefURL": "https://bdu.fstec.ru/vul/2022-05989",
            "Source": "BDU"
          },
          {
            "RefID": "BDU:2022-06107",
            "RefURL": "https://bdu.fstec.ru/vul/2022-06107",
            "Source": "BDU"
          },
          {
            "RefID": "BDU:2022-06141",
            "RefURL": "https://bdu.fstec.ru/vul/2022-06141",
            "Source": "BDU"
          },
          {
            "RefID": "CVE-2021-40529",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2021-40529",
            "Source": "CVE"
          },
          {
            "RefID": "CVE-2022-2200",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2022-2200",
            "Source": "CVE"
          },
          {
            "RefID": "CVE-2022-2226",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2022-2226",
            "Source": "CVE"
          },
          {
            "RefID": "CVE-2022-2505",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2022-2505",
            "Source": "CVE"
          },
          {
            "RefID": "CVE-2022-3032",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2022-3032",
            "Source": "CVE"
          },
          {
            "RefID": "CVE-2022-3033",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2022-3033",
            "Source": "CVE"
          },
          {
            "RefID": "CVE-2022-3034",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2022-3034",
            "Source": "CVE"
          },
          {
            "RefID": "CVE-2022-31744",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2022-31744",
            "Source": "CVE"
          },
          {
            "RefID": "CVE-2022-34468",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2022-34468",
            "Source": "CVE"
          },
          {
            "RefID": "CVE-2022-34470",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2022-34470",
            "Source": "CVE"
          },
          {
            "RefID": "CVE-2022-34472",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2022-34472",
            "Source": "CVE"
          },
          {
            "RefID": "CVE-2022-34478",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2022-34478",
            "Source": "CVE"
          },
          {
            "RefID": "CVE-2022-34479",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2022-34479",
            "Source": "CVE"
          },
          {
            "RefID": "CVE-2022-34481",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2022-34481",
            "Source": "CVE"
          },
          {
            "RefID": "CVE-2022-34484",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2022-34484",
            "Source": "CVE"
          },
          {
            "RefID": "CVE-2022-36059",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2022-36059",
            "Source": "CVE"
          },
          {
            "RefID": "CVE-2022-36314",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2022-36314",
            "Source": "CVE"
          },
          {
            "RefID": "CVE-2022-36318",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2022-36318",
            "Source": "CVE"
          },
          {
            "RefID": "CVE-2022-36319",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2022-36319",
            "Source": "CVE"
          },
          {
            "RefID": "CVE-2022-38472",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2022-38472",
            "Source": "CVE"
          },
          {
            "RefID": "CVE-2022-38473",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2022-38473",
            "Source": "CVE"
          },
          {
            "RefID": "CVE-2022-38476",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2022-38476",
            "Source": "CVE"
          },
          {
            "RefID": "CVE-2022-38477",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2022-38477",
            "Source": "CVE"
          },
          {
            "RefID": "CVE-2022-38478",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2022-38478",
            "Source": "CVE"
          }
        ],
        "Description": "This update upgrades thunderbird to version 102.2.1-alt1. \nSecurity Fix(es):\n\n * BDU:2022-04062: Уязвимость функции nsTArray_Impl::ReplaceElementsAt() почтового клиента Thunderbird, браузеров Firefox и Firefox ESR, позволяющая нарушителю выполнить произвольный код\n\n * BDU:2022-04065: Уязвимость почтового клиента Thunderbird, браузеров Firefox и Firefox ESR, связанная с неправильной обработкой ошибок при обработке недоступного PAC-файла, позволяющая нарушителю задать URL-адрес PAC, и если сервер, на котором размещен PAC, недоступен, запросы OCSP блокируются, что приводит к отображению неверных страниц ошибок\n\n * BDU:2022-04243: Уязвимость почтового клиента Thunderbird, браузера Firefox ESR, связанная с ошибкой при обработке таблиц стилей CSS, доступных через внутренние URI, как «ресурс:», позволяющая нарушителю обойти реализованную политику безопасности содержимого\n\n * BDU:2022-04769: Уязвимость браузера Mozilla Firefox, вызванная выходом операции за границы буфера в памяти, позволяющая нарушителю выполнить произвольный код\n\n * BDU:2022-05298: Уязвимость функции PK11_ChangePW браузера Mozilla Firefox, почтового клиента Thunderbird, позволяющая нарушителю вызвать отказ в обслуживании\n\n * BDU:2022-05444: Уязвимость почтового клиента Thunderbird, связанная с ошибками при обработке входных данных, позволяющая нарушителю выполнить произвольный JavaScript-код\n\n * BDU:2022-05446: Уязвимость обработчика JavaScript-сценариев SpiderMonkey браузеров Firefox, Firefox ESR и почтового клиента Thunderbird, позволяющая нарушителю выполнить произвольный код\n\n * BDU:2022-05447: Уязвимость обработчика JavaScript-сценариев SpiderMonkey браузеров Firefox, Firefox ESR и почтового клиента Thunderbird, позволяющая нарушителю выполнить произвольный код\n\n * BDU:2022-05479: Уязвимость изолированной среды iframe почтового клиента Thunderbird, позволяющая нарушителю обойти существующие ограничения безопасности\n\n * BDU:2022-05486: Уязвимость реализации протокола matrix почтового клиента Thunderbird, позволяющая нарушителю выполнить атаку типа «отказ в обслуживании» (DoS)\n\n * BDU:2022-05488: Уязвимость почтового клиента Thunderbird, связанная с ошибками при обработке входных данных, позволяющая нарушителю обойти существующие ограничения безопасности\n\n * BDU:2022-05497: Уязвимость реализации технологии XSLT (eXtensible Stylesheet Language Transformations) почтового клиента Thunderbird, браузеров Firefox и Firefox ESR, позволяющая нарушителю повысить свои привилегии\n\n * BDU:2022-05566: Уязвимость реализации технологии XSLT (eXtensible Stylesheet Language Transformations) браузера Firefox и почтового клиента Thunderbirds, позволяющая нарушителю проводить спуфинг-атаки\n\n * BDU:2022-05989: Уязвимость веб-браузеров Firefox, Firefox ESR и почтового клиента Thunderbird, связанная с раскрытием информации в ошибочной области данных, позволяющая нарушителю инициировать сетевые запросы\n\n * BDU:2022-06107: Уязвимость веб-браузеров Firefox, Firefox ESR и почтового клиента Thunderbird, связанная с ошибками представления информации пользовательским интерфейсом, позволяющая нарушителю раскрыть защищаемую информацию\n\n * BDU:2022-06141: Уязвимость браузеров Firefox, Firefox ESR и почтового клиента Thunderbird, существующая из-за непринятия мер по защите структуры веб-страницы, позволяющая нарушителю раскрыть защищаемую информацию, изменить внешний вид веб-страницы, выполнить фишинговые атаки\n\n * CVE-2021-40529: The ElGamal implementation in Botan through 2.18.1, as used in Thunderbird and other products, allows plaintext recovery because, during interaction between two cryptographic libraries, a certain dangerous combination of the prime defined by the receiver's public key, the generator defined by the receiver's public key, and the sender's ephemeral exponents can lead to a cross-configuration attack against OpenPGP.\n\n * CVE-2022-2200: If an object prototype was corrupted by an attacker, they would have been able to set undesired attributes on a JavaScript object, leading to privileged code execution. This vulnerability affects Firefox \u003c 102, Firefox ESR \u003c 91.11, Thunderbird \u003c 102, and Thunderbird \u003c 91.11.\n\n * CVE-2022-2226: An OpenPGP digital signature includes information about the date when the signature was created. When displaying an email that contains a digital signature, the email's date will be shown. If the dates were different, then Thunderbird didn't report the email as having an invalid signature. If an attacker performed a replay attack, in which an old email with old contents are resent at a later time, it could lead the victim to believe that the statements in the email are current. Fixed versions of Thunderbird will require that the signature's date roughly matches the displayed date of the email. This vulnerability affects Thunderbird \u003c 102 and Thunderbird \u003c 91.11.\n\n * CVE-2022-2505: Mozilla developers and the Mozilla Fuzzing Team reported memory safety bugs present in Firefox 102. Some of these bugs showed evidence of memory corruption and we presume that with enough effort some of these could have been exploited to run arbitrary code. This vulnerability affects Firefox ESR \u003c 102.1, Firefox \u003c 103, and Thunderbird \u003c 102.1.\n\n * CVE-2022-3032: When receiving an HTML email that contained an \u003ccode\u003eiframe\u003c/code\u003e element, which used a \u003ccode\u003esrcdoc\u003c/code\u003e attribute to define the inner HTML document, remote objects specified in the nested document, for example images or videos, were not blocked. Rather, the network was accessed, the objects were loaded and displayed. This vulnerability affects Thunderbird \u003c 102.2.1 and Thunderbird \u003c 91.13.1.\n\n * CVE-2022-3033: If a Thunderbird user replied to a crafted HTML email containing a \u003ccode\u003emeta\u003c/code\u003e tag, with the \u003ccode\u003emeta\u003c/code\u003e tag having the \u003ccode\u003ehttp-equiv=\"refresh\"\u003c/code\u003e attribute, and the content attribute specifying an URL, then Thunderbird started a network request to that URL, regardless of the configuration to block remote content. In combination with certain other HTML elements and attributes in the email, it was possible to execute JavaScript code included in the message in the context of the message compose document. The JavaScript code was able to perform actions including, but probably not limited to, read and modify the contents of the message compose document, including the quoted original message, which could potentially contain the decrypted plaintext of encrypted data in the crafted email. The contents could then be transmitted to the network, either to the URL specified in the META refresh tag, or to a different URL, as the JavaScript code could modify the URL specified in the document. This bug doesn't affect users who have changed the default Message Body display setting to 'simple html' or 'plain text'. This vulnerability affects Thunderbird \u003c 102.2.1 and Thunderbird \u003c 91.13.1.\n\n * CVE-2022-3034: When receiving an HTML email that specified to load an \u003ccode\u003eiframe\u003c/code\u003e element from a remote location, a request to the remote document was sent. However, Thunderbird didn't display the document. This vulnerability affects Thunderbird \u003c 102.2.1 and Thunderbird \u003c 91.13.1.\n\n * CVE-2022-31744: An attacker could have injected CSS into stylesheets accessible via internal URIs, such as resource:, and in doing so bypass a page's Content Security Policy. This vulnerability affects Firefox ESR \u003c 91.11, Thunderbird \u003c 102, Thunderbird \u003c 91.11, and Firefox \u003c 101.\n\n * CVE-2022-34468: An iframe that was not permitted to run scripts could do so if the user clicked on a \u003ccode\u003ejavascript:\u003c/code\u003e link. This vulnerability affects Firefox \u003c 102, Firefox ESR \u003c 91.11, Thunderbird \u003c 102, and Thunderbird \u003c 91.11.\n\n * CVE-2022-34470: Session history navigations may have led to a use-after-free and potentially exploitable crash. This vulnerability affects Firefox \u003c 102, Firefox ESR \u003c 91.11, Thunderbird \u003c 102, and Thunderbird \u003c 91.11.\n\n * CVE-2022-34472: If there was a PAC URL set and the server that hosts the PAC was not reachable, OCSP requests would have been blocked, resulting in incorrect error pages being shown. This vulnerability affects Firefox \u003c 102, Firefox ESR \u003c 91.11, Thunderbird \u003c 102, and Thunderbird \u003c 91.11.\n\n * CVE-2022-34478: The \u003ccode\u003ems-msdt\u003c/code\u003e, \u003ccode\u003esearch\u003c/code\u003e, and \u003ccode\u003esearch-ms\u003c/code\u003e protocols deliver content to Microsoft applications, bypassing the browser, when a user accepts a prompt. These applications have had known vulnerabilities, exploited in the wild (although we know of none exploited through Thunderbird), so in this release Thunderbird has blocked these protocols from prompting the user to open them.\u003cbr\u003e*This bug only affects Thunderbird on Windows. Other operating systems are unaffected.*. This vulnerability affects Firefox \u003c 102, Firefox ESR \u003c 91.11, Thunderbird \u003c 102, and Thunderbird \u003c 91.11.\n\n * CVE-2022-34479: A malicious website that could create a popup could have resized the popup to overlay the address bar with its own content, resulting in potential user confusion or spoofing attacks. \u003cbr\u003e*This bug only affects Thunderbird for Linux. Other operating systems are unaffected.*. This vulnerability affects Firefox \u003c 102, Firefox ESR \u003c 91.11, Thunderbird \u003c 102, and Thunderbird \u003c 91.11.\n\n * CVE-2022-34481: In the \u003ccode\u003ensTArray_Impl::ReplaceElementsAt()\u003c/code\u003e function, an integer overflow could have occurred when the number of elements to replace was too large for the container. This vulnerability affects Firefox \u003c 102, Firefox ESR \u003c 91.11, Thunderbird \u003c 102, and Thunderbird \u003c 91.11.\n\n * CVE-2022-34484: The Mozilla Fuzzing Team reported potential vulnerabilities present in Thunderbird 91.10. Some of these bugs showed evidence of memory corruption and we presume that with enough effort some of these could have been exploited to run arbitrary code. This vulnerability affects Firefox \u003c 102, Firefox ESR \u003c 91.11, Thunderbird \u003c 102, and Thunderbird \u003c 91.11.\n\n * CVE-2022-36059: matrix-js-sdk is a Matrix messaging protocol Client-Server SDK for JavaScript. In versions prior to 19.4.0 events sent with special strings in key places can temporarily disrupt or impede the matrix-js-sdk from functioning properly, potentially impacting the consumer's ability to process data safely. Note that the matrix-js-sdk can appear to be operating normally but be excluding or corrupting runtime data presented to the consumer. This issue has been fixed in matrix-js-sdk 19.4.0 and users are advised to upgrade. Users unable to upgrade may mitigate this issue by redacting applicable events, waiting for the sync processor to store data, and restarting the client. Alternatively, redacting the applicable events and clearing all storage will often fix most perceived issues. In some cases, no workarounds are possible.\n\n * CVE-2022-36314: When opening a Windows shortcut from the local filesystem, an attacker could supply a remote path that would lead to unexpected network requests from the operating system.\u003cbr\u003eThis bug only affects Firefox for Windows. Other operating systems are unaffected.*. This vulnerability affects Firefox ESR \u003c 102.1, Firefox \u003c 103, and Thunderbird \u003c 102.1.\n\n * CVE-2022-36318: When visiting directory listings for `chrome://` URLs as source text, some parameters were reflected. This vulnerability affects Firefox ESR \u003c 102.1, Firefox ESR \u003c 91.12, Firefox \u003c 103, Thunderbird \u003c 102.1, and Thunderbird \u003c 91.12.\n\n * CVE-2022-36319: When combining CSS properties for overflow and transform, the mouse cursor could interact with different coordinates than displayed. This vulnerability affects Firefox ESR \u003c 102.1, Firefox ESR \u003c 91.12, Firefox \u003c 103, Thunderbird \u003c 102.1, and Thunderbird \u003c 91.12.\n\n * CVE-2022-38472: An attacker could have abused XSLT error handling to associate attacker-controlled content with another origin which was displayed in the address bar. This could have been used to fool the user into submitting data intended for the spoofed origin. This vulnerability affects Thunderbird \u003c 102.2, Thunderbird \u003c 91.13, Firefox ESR \u003c 91.13, Firefox ESR \u003c 102.2, and Firefox \u003c 104.\n\n * CVE-2022-38473: A cross-origin iframe referencing an XSLT document would inherit the parent domain's permissions (such as microphone or camera access). This vulnerability affects Thunderbird \u003c 102.2, Thunderbird \u003c 91.13, Firefox ESR \u003c 91.13, Firefox ESR \u003c 102.2, and Firefox \u003c 104.\n\n * CVE-2022-38476: A data race could occur in the \u003ccode\u003ePK11_ChangePW\u003c/code\u003e function, potentially leading to a use-after-free vulnerability. In Firefox, this lock protected the data when a user changed their master password. This vulnerability affects Firefox ESR \u003c 102.2 and Thunderbird \u003c 102.2.\n\n * CVE-2022-38477: Mozilla developer Nika Layzell and the Mozilla Fuzzing Team reported memory safety bugs present in Firefox 103 and Firefox ESR 102.1. Some of these bugs showed evidence of memory corruption and we presume that with enough effort some of these could have been exploited to run arbitrary code. This vulnerability affects Firefox ESR \u003c 102.2, Thunderbird \u003c 102.2, and Firefox \u003c 104.\n\n * CVE-2022-38478: Members the Mozilla Fuzzing Team reported memory safety bugs present in Firefox 103, Firefox ESR 102.1, and Firefox ESR 91.12. Some of these bugs showed evidence of memory corruption and we presume that with enough effort some of these could have been exploited to run arbitrary code. This vulnerability affects Thunderbird \u003c 102.2, Thunderbird \u003c 91.13, Firefox ESR \u003c 91.13, Firefox ESR \u003c 102.2, and Firefox \u003c 104.",
        "Advisory": {
          "From": "errata.altlinux.org",
          "Severity": "Critical",
          "Rights": "Copyright 2023 BaseALT Ltd.",
          "Issued": {
            "Date": "2022-10-26"
          },
          "Updated": {
            "Date": "2022-10-26"
          },
          "bdu": [
            {
              "Cvss": "AV:N/AC:L/Au:N/C:P/I:P/A:N",
              "Cvss3": "AV:N/AC:L/PR:N/UI:R/S:C/C:L/I:L/A:N",
              "Cwe": "CWE-190",
              "Href": "https://bdu.fstec.ru/vul/2022-04062",
              "Impact": "Low",
              "Public": "20220628",
              "CveID": "BDU:2022-04062"
            },
            {
              "Cvss": "AV:N/AC:L/Au:N/C:P/I:P/A:N",
              "Cvss3": "AV:N/AC:L/PR:N/UI:R/S:C/C:L/I:L/A:N",
              "Cwe": "CWE-393",
              "Href": "https://bdu.fstec.ru/vul/2022-04065",
              "Impact": "Low",
              "Public": "20220628",
              "CveID": "BDU:2022-04065"
            },
            {
              "Cvss": "AV:N/AC:L/Au:N/C:P/I:P/A:N",
              "Cvss3": "AV:N/AC:L/PR:N/UI:R/S:C/C:L/I:L/A:N",
              "Cwe": "CWE-74",
              "Href": "https://bdu.fstec.ru/vul/2022-04243",
              "Impact": "Low",
              "Public": "20220628",
              "CveID": "BDU:2022-04243"
            },
            {
              "Cvss": "AV:N/AC:L/Au:N/C:C/I:C/A:C",
              "Cvss3": "AV:N/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H",
              "Cwe": "CWE-119",
              "Href": "https://bdu.fstec.ru/vul/2022-04769",
              "Impact": "High",
              "Public": "20220726",
              "CveID": "BDU:2022-04769"
            },
            {
              "Cvss": "AV:N/AC:L/Au:N/C:N/I:N/A:P",
              "Cvss3": "AV:N/AC:L/PR:N/UI:R/S:U/C:N/I:N/A:L",
              "Cwe": "CWE-416",
              "Href": "https://bdu.fstec.ru/vul/2022-05298",
              "Impact": "Low",
              "Public": "20220823",
              "CveID": "BDU:2022-05298"
            },
            {
              "Cvss": "AV:N/AC:L/Au:N/C:C/I:C/A:C",
              "Cvss3": "AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H",
              "Cwe": "CWE-79",
              "Href": "https://bdu.fstec.ru/vul/2022-05444",
              "Impact": "Critical",
              "Public": "20220831",
              "CveID": "BDU:2022-05444"
            },
            {
              "Cvss": "AV:N/AC:H/Au:N/C:C/I:C/A:C",
              "Cvss3": "AV:N/AC:H/PR:N/UI:R/S:U/C:H/I:H/A:H",
              "Cwe": "CWE-120",
              "Href": "https://bdu.fstec.ru/vul/2022-05446",
              "Impact": "High",
              "Public": "20220823",
              "CveID": "BDU:2022-05446"
            },
            {
              "Cvss": "AV:N/AC:H/Au:N/C:C/I:C/A:C",
              "Cvss3": "AV:N/AC:H/PR:N/UI:R/S:U/C:H/I:H/A:H",
              "Cwe": "CWE-120",
              "Href": "https://bdu.fstec.ru/vul/2022-05447",
              "Impact": "High",
              "Public": "20220823",
              "CveID": "BDU:2022-05447"
            },
            {
              "Cvss": "AV:N/AC:L/Au:N/C:C/I:C/A:C",
              "Cvss3": "AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H",
              "Cwe": "CWE-79",
              "Href": "https://bdu.fstec.ru/vul/2022-05479",
              "Impact": "Critical",
              "Public": "20220831",
              "CveID": "BDU:2022-05479"
            },
            {
              "Cvss": "AV:N/AC:L/Au:N/C:N/I:N/A:C",
              "Cvss3": "AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H",
              "Cwe": "CWE-79",
              "Href": "https://bdu.fstec.ru/vul/2022-05486",
              "Impact": "High",
              "Public": "20220831",
              "CveID": "BDU:2022-05486"
            },
            {
              "Cvss": "AV:N/AC:L/Au:N/C:C/I:C/A:C",
              "Cvss3": "AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H",
              "Cwe": "CWE-79",
              "Href": "https://bdu.fstec.ru/vul/2022-05488",
              "Impact": "Critical",
              "Public": "20220831",
              "CveID": "BDU:2022-05488"
            },
            {
              "Cvss": "AV:N/AC:H/Au:N/C:C/I:C/A:C",
              "Cvss3": "AV:N/AC:H/PR:N/UI:R/S:U/C:H/I:H/A:H",
              "Cwe": "CWE-1021",
              "Href": "https://bdu.fstec.ru/vul/2022-05497",
              "Impact": "High",
              "Public": "20220823",
              "CveID": "BDU:2022-05497"
            },
            {
              "Cvss": "AV:N/AC:H/Au:N/C:C/I:C/A:C",
              "Cvss3": "AV:N/AC:H/PR:N/UI:R/S:U/C:H/I:H/A:H",
              "Cwe": "CWE-356",
              "Href": "https://bdu.fstec.ru/vul/2022-05566",
              "Impact": "High",
              "Public": "20220823",
              "CveID": "BDU:2022-05566"
            },
            {
              "Cvss": "AV:N/AC:L/Au:N/C:P/I:P/A:N",
              "Cvss3": "AV:N/AC:L/PR:N/UI:R/S:C/C:L/I:L/A:N",
              "Cwe": "CWE-668",
              "Href": "https://bdu.fstec.ru/vul/2022-05989",
              "Impact": "Low",
              "Public": "20220726",
              "CveID": "BDU:2022-05989"
            },
            {
              "Cvss": "AV:N/AC:L/Au:N/C:P/I:P/A:N",
              "Cvss3": "AV:N/AC:L/PR:N/UI:R/S:C/C:L/I:L/A:N",
              "Cwe": "CWE-451",
              "Href": "https://bdu.fstec.ru/vul/2022-06107",
              "Impact": "Low",
              "Public": "20220726",
              "CveID": "BDU:2022-06107"
            },
            {
              "Cvss": "AV:N/AC:L/Au:N/C:P/I:P/A:N",
              "Cvss3": "AV:N/AC:L/PR:N/UI:R/S:C/C:L/I:L/A:N",
              "Cwe": "CWE-79",
              "Href": "https://bdu.fstec.ru/vul/2022-06141",
              "Impact": "Low",
              "Public": "20220726",
              "CveID": "BDU:2022-06141"
            }
          ],
          "Cves": [
            {
              "Cvss": "AV:N/AC:H/Au:N/C:P/I:N/A:N",
              "Cvss3": "CVSS:3.1/AV:N/AC:H/PR:N/UI:N/S:U/C:H/I:N/A:N",
              "Cwe": "CWE-327",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2021-40529",
              "Impact": "Low",
              "Public": "20210906",
              "CveID": "CVE-2021-40529"
            },
            {
              "Cvss3": "CVSS:3.1/AV:N/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H",
              "Cwe": "CWE-1321",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2022-2200",
              "Impact": "High",
              "Public": "20221222",
              "CveID": "CVE-2022-2200"
            },
            {
              "Cvss3": "CVSS:3.1/AV:N/AC:L/PR:N/UI:R/S:U/C:N/I:H/A:N",
              "Cwe": "CWE-294",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2022-2226",
              "Impact": "Low",
              "Public": "20221222",
              "CveID": "CVE-2022-2226"
            },
            {
              "Cvss3": "CVSS:3.1/AV:N/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H",
              "Cwe": "CWE-787",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2022-2505",
              "Impact": "High",
              "Public": "20221222",
              "CveID": "CVE-2022-2505"
            },
            {
              "Cvss3": "CVSS:3.1/AV:N/AC:L/PR:N/UI:R/S:U/C:H/I:N/A:N",
              "Cwe": "CWE-610",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2022-3032",
              "Impact": "Low",
              "Public": "20221222",
              "CveID": "CVE-2022-3032"
            },
            {
              "Cvss3": "CVSS:3.1/AV:N/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:N",
              "Cwe": "CWE-79",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2022-3033",
              "Impact": "High",
              "Public": "20221222",
              "CveID": "CVE-2022-3033"
            },
            {
              "Cvss3": "CVSS:3.1/AV:N/AC:L/PR:N/UI:R/S:U/C:N/I:L/A:N",
              "Cwe": "CWE-1021",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2022-3034",
              "Impact": "Low",
              "Public": "20221222",
              "CveID": "CVE-2022-3034"
            },
            {
              "Cvss3": "CVSS:3.1/AV:N/AC:L/PR:N/UI:R/S:U/C:N/I:H/A:N",
              "Cwe": "CWE-79",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2022-31744",
              "Impact": "Low",
              "Public": "20221222",
              "CveID": "CVE-2022-31744"
            },
            {
              "Cvss3": "CVSS:3.1/AV:N/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H",
              "Cwe": "NVD-CWE-noinfo",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2022-34468",
              "Impact": "High",
              "Public": "20221222",
              "CveID": "CVE-2022-34468"
            },
            {
              "Cvss3": "CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H",
              "Cwe": "CWE-416",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2022-34470",
              "Impact": "Critical",
              "Public": "20221222",
              "CveID": "CVE-2022-34470"
            },
            {
              "Cvss3": "CVSS:3.1/AV:N/AC:L/PR:N/UI:R/S:U/C:N/I:L/A:N",
              "Cwe": "NVD-CWE-noinfo",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2022-34472",
              "Impact": "Low",
              "Public": "20221222",
              "CveID": "CVE-2022-34472"
            },
            {
              "Cvss3": "CVSS:3.1/AV:N/AC:L/PR:N/UI:R/S:U/C:N/I:H/A:N",
              "Cwe": "NVD-CWE-noinfo",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2022-34478",
              "Impact": "Low",
              "Public": "20221222",
              "CveID": "CVE-2022-34478"
            },
            {
              "Cvss3": "CVSS:3.1/AV:N/AC:L/PR:N/UI:R/S:U/C:N/I:H/A:N",
              "Cwe": "NVD-CWE-noinfo",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2022-34479",
              "Impact": "Low",
              "Public": "20221222",
              "CveID": "CVE-2022-34479"
            },
            {
              "Cvss3": "CVSS:3.1/AV:N/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H",
              "Cwe": "CWE-190",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2022-34481",
              "Impact": "High",
              "Public": "20221222",
              "CveID": "CVE-2022-34481"
            },
            {
              "Cvss3": "CVSS:3.1/AV:N/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H",
              "Cwe": "CWE-416",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2022-34484",
              "Impact": "High",
              "Public": "20221222",
              "CveID": "CVE-2022-34484"
            },
            {
              "Cvss3": "CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:L/A:N",
              "Cwe": "CWE-1321",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2022-36059",
              "Impact": "Low",
              "Public": "20230328",
              "CveID": "CVE-2022-36059"
            },
            {
              "Cvss3": "CVSS:3.1/AV:L/AC:L/PR:N/UI:R/S:U/C:N/I:H/A:N",
              "Cwe": "CWE-427",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2022-36314",
              "Impact": "Low",
              "Public": "20221222",
              "CveID": "CVE-2022-36314"
            },
            {
              "Cvss3": "CVSS:3.1/AV:N/AC:H/PR:N/UI:R/S:U/C:H/I:N/A:N",
              "Cwe": "CWE-362",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2022-36318",
              "Impact": "Low",
              "Public": "20221222",
              "CveID": "CVE-2022-36318"
            },
            {
              "Cvss3": "CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:H/A:N",
              "Cwe": "NVD-CWE-noinfo",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2022-36319",
              "Impact": "High",
              "Public": "20221222",
              "CveID": "CVE-2022-36319"
            },
            {
              "Cvss3": "CVSS:3.1/AV:N/AC:L/PR:N/UI:R/S:U/C:N/I:H/A:N",
              "Cwe": "CWE-346",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2022-38472",
              "Impact": "Low",
              "Public": "20221222",
              "CveID": "CVE-2022-38472"
            },
            {
              "Cvss3": "CVSS:3.1/AV:N/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H",
              "Cwe": "CWE-281",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2022-38473",
              "Impact": "High",
              "Public": "20221222",
              "CveID": "CVE-2022-38473"
            },
            {
              "Cvss3": "CVSS:3.1/AV:N/AC:H/PR:N/UI:R/S:U/C:H/I:H/A:H",
              "Cwe": "CWE-416",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2022-38476",
              "Impact": "High",
              "Public": "20221222",
              "CveID": "CVE-2022-38476"
            },
            {
              "Cvss3": "CVSS:3.1/AV:N/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H",
              "Cwe": "CWE-787",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2022-38477",
              "Impact": "High",
              "Public": "20221222",
              "CveID": "CVE-2022-38477"
            },
            {
              "Cvss3": "CVSS:3.1/AV:N/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H",
              "Cwe": "CWE-787",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2022-38478",
              "Impact": "High",
              "Public": "20221222",
              "CveID": "CVE-2022-38478"
            }
          ],
          "AffectedCpeList": {
            "Cpe": [
              "cpe:/o:alt:kworkstation:10",
              "cpe:/o:alt:workstation:10",
              "cpe:/o:alt:server:10",
              "cpe:/o:alt:server-v:10",
              "cpe:/o:alt:education:10",
              "cpe:/o:alt:slinux:10",
              "cpe:/o:alt:starterkit:p10",
              "cpe:/o:alt:kworkstation:10.1",
              "cpe:/o:alt:workstation:10.1",
              "cpe:/o:alt:server:10.1",
              "cpe:/o:alt:server-v:10.1",
              "cpe:/o:alt:education:10.1",
              "cpe:/o:alt:slinux:10.1",
              "cpe:/o:alt:starterkit:10.1",
              "cpe:/o:alt:kworkstation:10.2",
              "cpe:/o:alt:workstation:10.2",
              "cpe:/o:alt:server:10.2",
              "cpe:/o:alt:server-v:10.2",
              "cpe:/o:alt:education:10.2",
              "cpe:/o:alt:slinux:10.2",
              "cpe:/o:alt:starterkit:10.2"
            ]
          }
        }
      },
      "Criteria": {
        "Operator": "AND",
        "Criterions": [
          {
            "TestRef": "oval:org.altlinux.errata:tst:2001",
            "Comment": "ALT Linux must be installed"
          }
        ],
        "Criterias": [
          {
            "Operator": "OR",
            "Criterions": [
              {
                "TestRef": "oval:org.altlinux.errata:tst:20222931001",
                "Comment": "rpm-build-thunderbird is earlier than 0:102.2.1-alt1"
              },
              {
                "TestRef": "oval:org.altlinux.errata:tst:20222931002",
                "Comment": "thunderbird is earlier than 0:102.2.1-alt1"
              },
              {
                "TestRef": "oval:org.altlinux.errata:tst:20222931003",
                "Comment": "thunderbird-wayland is earlier than 0:102.2.1-alt1"
              }
            ]
          }
        ]
      }
    }
  ]
}