{
  "Definition": [
    {
      "ID": "oval:org.altlinux.errata:def:20212751",
      "Version": "oval:org.altlinux.errata:def:20212751",
      "Class": "patch",
      "Metadata": {
        "Title": "ALT-PU-2021-2751: package `kernel-image-std-pae` update to version 5.4.144-alt1",
        "AffectedList": [
          {
            "Family": "unix",
            "Platforms": [
              "ALT Linux branch p9"
            ],
            "Products": [
              "ALT Server",
              "ALT Virtualization Server",
              "ALT Workstation",
              "ALT Workstation K",
              "ALT Education",
              "Simply Linux",
              "Starterkit"
            ]
          }
        ],
        "References": [
          {
            "RefID": "ALT-PU-2021-2751",
            "RefURL": "https://errata.altlinux.org/ALT-PU-2021-2751",
            "Source": "ALTPU"
          },
          {
            "RefID": "BDU:2021-00284",
            "RefURL": "https://bdu.fstec.ru/vul/2021-00284",
            "Source": "BDU"
          },
          {
            "RefID": "BDU:2021-01956",
            "RefURL": "https://bdu.fstec.ru/vul/2021-01956",
            "Source": "BDU"
          },
          {
            "RefID": "BDU:2021-02663",
            "RefURL": "https://bdu.fstec.ru/vul/2021-02663",
            "Source": "BDU"
          },
          {
            "RefID": "BDU:2021-02665",
            "RefURL": "https://bdu.fstec.ru/vul/2021-02665",
            "Source": "BDU"
          },
          {
            "RefID": "BDU:2021-03088",
            "RefURL": "https://bdu.fstec.ru/vul/2021-03088",
            "Source": "BDU"
          },
          {
            "RefID": "BDU:2021-03095",
            "RefURL": "https://bdu.fstec.ru/vul/2021-03095",
            "Source": "BDU"
          },
          {
            "RefID": "BDU:2021-03175",
            "RefURL": "https://bdu.fstec.ru/vul/2021-03175",
            "Source": "BDU"
          },
          {
            "RefID": "BDU:2021-03177",
            "RefURL": "https://bdu.fstec.ru/vul/2021-03177",
            "Source": "BDU"
          },
          {
            "RefID": "BDU:2021-04846",
            "RefURL": "https://bdu.fstec.ru/vul/2021-04846",
            "Source": "BDU"
          },
          {
            "RefID": "BDU:2021-04854",
            "RefURL": "https://bdu.fstec.ru/vul/2021-04854",
            "Source": "BDU"
          },
          {
            "RefID": "BDU:2021-04855",
            "RefURL": "https://bdu.fstec.ru/vul/2021-04855",
            "Source": "BDU"
          },
          {
            "RefID": "BDU:2021-04856",
            "RefURL": "https://bdu.fstec.ru/vul/2021-04856",
            "Source": "BDU"
          },
          {
            "RefID": "BDU:2021-04862",
            "RefURL": "https://bdu.fstec.ru/vul/2021-04862",
            "Source": "BDU"
          },
          {
            "RefID": "BDU:2022-00682",
            "RefURL": "https://bdu.fstec.ru/vul/2022-00682",
            "Source": "BDU"
          },
          {
            "RefID": "BDU:2022-03028",
            "RefURL": "https://bdu.fstec.ru/vul/2022-03028",
            "Source": "BDU"
          },
          {
            "RefID": "BDU:2022-03139",
            "RefURL": "https://bdu.fstec.ru/vul/2022-03139",
            "Source": "BDU"
          },
          {
            "RefID": "BDU:2022-03141",
            "RefURL": "https://bdu.fstec.ru/vul/2022-03141",
            "Source": "BDU"
          },
          {
            "RefID": "CVE-2020-24586",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2020-24586",
            "Source": "CVE"
          },
          {
            "RefID": "CVE-2020-24587",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2020-24587",
            "Source": "CVE"
          },
          {
            "RefID": "CVE-2020-24588",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2020-24588",
            "Source": "CVE"
          },
          {
            "RefID": "CVE-2020-25670",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2020-25670",
            "Source": "CVE"
          },
          {
            "RefID": "CVE-2020-25671",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2020-25671",
            "Source": "CVE"
          },
          {
            "RefID": "CVE-2020-25672",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2020-25672",
            "Source": "CVE"
          },
          {
            "RefID": "CVE-2020-26141",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2020-26141",
            "Source": "CVE"
          },
          {
            "RefID": "CVE-2020-26145",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2020-26145",
            "Source": "CVE"
          },
          {
            "RefID": "CVE-2020-26147",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2020-26147",
            "Source": "CVE"
          },
          {
            "RefID": "CVE-2020-26541",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2020-26541",
            "Source": "CVE"
          },
          {
            "RefID": "CVE-2020-36311",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2020-36311",
            "Source": "CVE"
          },
          {
            "RefID": "CVE-2021-22543",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2021-22543",
            "Source": "CVE"
          },
          {
            "RefID": "CVE-2021-23133",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2021-23133",
            "Source": "CVE"
          },
          {
            "RefID": "CVE-2021-23134",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2021-23134",
            "Source": "CVE"
          },
          {
            "RefID": "CVE-2021-3564",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2021-3564",
            "Source": "CVE"
          },
          {
            "RefID": "CVE-2021-3573",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2021-3573",
            "Source": "CVE"
          },
          {
            "RefID": "CVE-2021-3653",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2021-3653",
            "Source": "CVE"
          },
          {
            "RefID": "CVE-2021-3656",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2021-3656",
            "Source": "CVE"
          }
        ],
        "Description": "This update upgrades kernel-image-std-pae to version 5.4.144-alt1. \nSecurity Fix(es):\n\n * BDU:2021-00284: Уязвимость ядра операционной системы Linux, связанная с некорректной проверкой криптографической подписи, позволяющая нарушителю оказать воздействие на конфиденциальность, целостность и доступность защищаемой информации\n\n * BDU:2021-01956: Уязвимость компонентов arch/x86/kvm/svm/sev.c подсистемы виртуализации Kernel-based Virtual Machine (KVM) ядра операционных систем Linux, позволяющая нарушителю вызвать отказ в обслуживании\n\n * BDU:2021-02663: Уязвимость набора стандартов связи для коммуникации IEEE 802.11 операционной системы Windows, позволяющая нарушителю внедрить произвольные сетевые пакеты\n\n * BDU:2021-02665: Уязвимость реализации алгоритмов WPA и WPA2 драйвера 6.1316.1209 Wi-Fi адаптера ALFA, позволяющая нарушителю внедрить и расшифровать пакеты в сетях WPA или WPA2\n\n * BDU:2021-03088: Уязвимость реализации алгоритмов WPA, WPA2 и WPA3 набора стандартов связи для коммуникации IEEE 802.11, позволяющая нарушителю оказать воздействие на целостность защищаемой информации\n\n * BDU:2021-03095: Уязвимость реализации алгоритмов WEP, WPA, WPA2 и WPA3 набора стандартов связи для коммуникации IEEE 802.11, позволяющая нарушителю внедрить произвольные сетевые пакеты и/или оказать воздействие на целостность защищаемой информации\n\n * BDU:2021-03175: Уязвимость реализации алгоритмов WEP, WPA, WPA2 и WPA3 ядра операционной системы Linux, позволяющая нарушителю внедрить произвольные сетевые пакеты независимо от конфигурации сети\n\n * BDU:2021-03177: Уязвимость реализации алгоритмов WEP, WPA, WPA2 и WPA3 ядра операционной системы Linux, позволяющая нарушителю оказать воздействие на целостность защищаемой информации\n\n * BDU:2021-04846: Уязвимость функции hci_sock_bound_ioctl () подсистемы HCI ядра операционной системы Linux, позволяющая нарушителю выполнить произвольный код в контексте ядра\n\n * BDU:2021-04854: Уязвимость операционной системы Linux вызвана переполнением буфера, позволяющая нарушителю выполнить произвольную команду управления\n\n * BDU:2021-04855: Уязвимость компонента net/sctp/socket.c ядра операционной системы Linux, позволяющая нарушителю повысить свои привилегии\n\n * BDU:2021-04856: Уязвимость сокетов nfc операционной системы Linux , связанная с использованием памяти после её освобождения, позволяющая нарушителю повысить свои привилегии\n\n * BDU:2021-04862: Уязвимость функции hci_dev_do_open() подсистемы инициализации устройства HCI ядра операционной системы Linux, связанная с повторным освобождением памяти, позволяющая нарушителю вызвать отказ в обслуживании\n\n * BDU:2022-00682: Уязвимость подсистемы виртуализации KVM ядра операционной системы Linux, связанная с недостатками разграничения доступа, позволяющая нарушителю повысить свои привилегии\n\n * BDU:2022-03028: Уязвимость функции llcp_sock_connect() операционной системы Linux, позволяющая нарушителю повысить свои привилегии\n\n * BDU:2022-03139: Уязвимость функции llcp_sock_bind() протокола nfc ядра операционной системы Linux, позволяющая нарушителю получить доступ к конфиденциальным данным, нарушить их целостность, а также вызвать отказ в обслуживании\n\n * BDU:2022-03141: Уязвимость функции llcp_sock_connect() протокола nfc ядра операционной системы Linux, позволяющая нарушителю вызвать отказ в обслуживании\n\n * CVE-2020-24586: The 802.11 standard that underpins Wi-Fi Protected Access (WPA, WPA2, and WPA3) and Wired Equivalent Privacy (WEP) doesn't require that received fragments be cleared from memory after (re)connecting to a network. Under the right circumstances, when another device sends fragmented frames encrypted using WEP, CCMP, or GCMP, this can be abused to inject arbitrary network packets and/or exfiltrate user data.\n\n * CVE-2020-24587: The 802.11 standard that underpins Wi-Fi Protected Access (WPA, WPA2, and WPA3) and Wired Equivalent Privacy (WEP) doesn't require that all fragments of a frame are encrypted under the same key. An adversary can abuse this to decrypt selected fragments when another device sends fragmented frames and the WEP, CCMP, or GCMP encryption key is periodically renewed.\n\n * CVE-2020-24588: The 802.11 standard that underpins Wi-Fi Protected Access (WPA, WPA2, and WPA3) and Wired Equivalent Privacy (WEP) doesn't require that the A-MSDU flag in the plaintext QoS header field is authenticated. Against devices that support receiving non-SSP A-MSDU frames (which is mandatory as part of 802.11n), an adversary can abuse this to inject arbitrary network packets.\n\n * CVE-2020-25670: A vulnerability was found in Linux Kernel where refcount leak in llcp_sock_bind() causing use-after-free which might lead to privilege escalations.\n\n * CVE-2020-25671: A vulnerability was found in Linux Kernel, where a refcount leak in llcp_sock_connect() causing use-after-free which might lead to privilege escalations.\n\n * CVE-2020-25672: A memory leak vulnerability was found in Linux kernel in llcp_sock_connect\n\n * CVE-2020-26141: An issue was discovered in the ALFA Windows 10 driver 6.1316.1209 for AWUS036H. The Wi-Fi implementation does not verify the Message Integrity Check (authenticity) of fragmented TKIP frames. An adversary can abuse this to inject and possibly decrypt packets in WPA or WPA2 networks that support the TKIP data-confidentiality protocol.\n\n * CVE-2020-26145: An issue was discovered on Samsung Galaxy S3 i9305 4.4.4 devices. The WEP, WPA, WPA2, and WPA3 implementations accept second (or subsequent) broadcast fragments even when sent in plaintext and process them as full unfragmented frames. An adversary can abuse this to inject arbitrary network packets independent of the network configuration.\n\n * CVE-2020-26147: An issue was discovered in the Linux kernel 5.8.9. The WEP, WPA, WPA2, and WPA3 implementations reassemble fragments even though some of them were sent in plaintext. This vulnerability can be abused to inject packets and/or exfiltrate selected fragments when another device sends fragmented frames and the WEP, CCMP, or GCMP data-confidentiality protocol is used.\n\n * CVE-2020-26541: The Linux kernel through 5.8.13 does not properly enforce the Secure Boot Forbidden Signature Database (aka dbx) protection mechanism. This affects certs/blacklist.c and certs/system_keyring.c.\n\n * CVE-2020-36311: An issue was discovered in the Linux kernel before 5.9. arch/x86/kvm/svm/sev.c allows attackers to cause a denial of service (soft lockup) by triggering destruction of a large SEV VM (which requires unregistering many encrypted regions), aka CID-7be74942f184.\n\n * CVE-2021-22543: An issue was discovered in Linux: KVM through Improper handling of VM_IO|VM_PFNMAP vmas in KVM can bypass RO checks and can lead to pages being freed while still accessible by the VMM and guest. This allows users with the ability to start and control a VM to read/write random pages of memory and can result in local privilege escalation.\n\n * CVE-2021-23133: A race condition in Linux kernel SCTP sockets (net/sctp/socket.c) before 5.12-rc8 can lead to kernel privilege escalation from the context of a network service or an unprivileged process. If sctp_destroy_sock is called without sock_net(sk)-\u003esctp.addr_wq_lock then an element is removed from the auto_asconf_splist list without any proper locking. This can be exploited by an attacker with network service privileges to escalate to root or from the context of an unprivileged user directly if a BPF_CGROUP_INET_SOCK_CREATE is attached which denies creation of some SCTP socket.\n\n * CVE-2021-23134: Use After Free vulnerability in nfc sockets in the Linux Kernel before 5.12.4 allows local attackers to elevate their privileges. In typical configurations, the issue can only be triggered by a privileged local user with the CAP_NET_RAW capability.\n\n * CVE-2021-3564: A flaw double-free memory corruption in the Linux kernel HCI device initialization subsystem was found in the way user attach malicious HCI TTY Bluetooth device. A local user could use this flaw to crash the system. This flaw affects all the Linux kernel versions starting from 3.13.\n\n * CVE-2021-3573: A use-after-free in function hci_sock_bound_ioctl() of the Linux kernel HCI subsystem was found in the way user calls ioct HCIUNBLOCKADDR or other way triggers race condition of the call hci_unregister_dev() together with one of the calls hci_sock_blacklist_add(), hci_sock_blacklist_del(), hci_get_conn_info(), hci_get_auth_info(). A privileged local user could use this flaw to crash the system or escalate their privileges on the system. This flaw affects the Linux kernel versions prior to 5.13-rc5.\n\n * CVE-2021-3653: A flaw was found in the KVM's AMD code for supporting SVM nested virtualization. The flaw occurs when processing the VMCB (virtual machine control block) provided by the L1 guest to spawn/handle a nested guest (L2). Due to improper validation of the \"int_ctl\" field, this issue could allow a malicious L1 to enable AVIC support (Advanced Virtual Interrupt Controller) for the L2 guest. As a result, the L2 guest would be allowed to read/write physical pages of the host, resulting in a crash of the entire system, leak of sensitive data or potential guest-to-host escape. This flaw affects Linux kernel versions prior to 5.14-rc7.\n\n * CVE-2021-3656: A flaw was found in the KVM's AMD code for supporting SVM nested virtualization. The flaw occurs when processing the VMCB (virtual machine control block) provided by the L1 guest to spawn/handle a nested guest (L2). Due to improper validation of the \"virt_ext\" field, this issue could allow a malicious L1 to disable both VMLOAD/VMSAVE intercepts and VLS (Virtual VMLOAD/VMSAVE) for the L2 guest. As a result, the L2 guest would be allowed to read/write physical pages of the host, resulting in a crash of the entire system, leak of sensitive data or potential guest-to-host escape.",
        "Advisory": {
          "From": "errata.altlinux.org",
          "Severity": "High",
          "Rights": "Copyright 2023 BaseALT Ltd.",
          "Issued": {
            "Date": "2021-09-08"
          },
          "Updated": {
            "Date": "2021-09-08"
          },
          "bdu": [
            {
              "Cvss": "AV:L/AC:M/Au:N/C:C/I:C/A:C",
              "Cvss3": "AV:L/AC:L/PR:H/UI:R/S:U/C:H/I:H/A:H",
              "Cwe": "CWE-200, CWE-347",
              "Href": "https://bdu.fstec.ru/vul/2021-00284",
              "Impact": "Low",
              "Public": "20201002",
              "CveID": "BDU:2021-00284"
            },
            {
              "Cvss": "AV:L/AC:L/Au:S/C:N/I:N/A:C",
              "Cvss3": "AV:L/AC:L/PR:L/UI:N/S:U/C:N/I:N/A:H",
              "Cwe": "CWE-400",
              "Href": "https://bdu.fstec.ru/vul/2021-01956",
              "Impact": "Low",
              "Public": "20210406",
              "CveID": "BDU:2021-01956"
            },
            {
              "Cvss": "AV:A/AC:M/Au:N/C:N/I:P/A:N",
              "Cvss3": "AV:A/AC:L/PR:N/UI:R/S:U/C:N/I:L/A:N",
              "Cwe": "CWE-306",
              "Href": "https://bdu.fstec.ru/vul/2021-02663",
              "Impact": "Low",
              "Public": "20210511",
              "CveID": "BDU:2021-02663"
            },
            {
              "Cvss": "AV:A/AC:L/Au:N/C:N/I:C/A:N",
              "Cvss3": "AV:A/AC:L/PR:N/UI:N/S:U/C:N/I:H/A:N",
              "Cwe": "CWE-354",
              "Href": "https://bdu.fstec.ru/vul/2021-02665",
              "Impact": "Low",
              "Public": "20210511",
              "CveID": "BDU:2021-02665"
            },
            {
              "Cvss": "AV:A/AC:L/Au:N/C:N/I:P/A:N",
              "Cvss3": "AV:A/AC:L/PR:N/UI:N/S:U/C:N/I:H/A:N",
              "Cwe": "CWE-326",
              "Href": "https://bdu.fstec.ru/vul/2021-03088",
              "Impact": "Low",
              "Public": "20210511",
              "CveID": "BDU:2021-03088"
            },
            {
              "Cvss": "AV:A/AC:M/Au:N/C:P/I:P/A:N",
              "Cvss3": "AV:A/AC:L/PR:N/UI:R/S:U/C:L/I:L/A:N",
              "Cwe": "CWE-20",
              "Href": "https://bdu.fstec.ru/vul/2021-03095",
              "Impact": "Low",
              "Public": "20210511",
              "CveID": "BDU:2021-03095"
            },
            {
              "Cvss": "AV:A/AC:M/Au:N/C:N/I:C/A:N",
              "Cvss3": "AV:A/AC:H/PR:N/UI:N/S:U/C:N/I:H/A:N",
              "Cwe": "CWE-20",
              "Href": "https://bdu.fstec.ru/vul/2021-03175",
              "Impact": "Low",
              "Public": "20210511",
              "CveID": "BDU:2021-03175"
            },
            {
              "Cvss": "AV:A/AC:M/Au:N/C:N/I:C/A:N",
              "Cvss3": "AV:A/AC:H/PR:N/UI:N/S:U/C:N/I:H/A:N",
              "Cwe": "CWE-20",
              "Href": "https://bdu.fstec.ru/vul/2021-03177",
              "Impact": "Low",
              "Public": "20210511",
              "CveID": "BDU:2021-03177"
            },
            {
              "Cvss": "AV:L/AC:M/Au:N/C:C/I:C/A:C",
              "Cvss3": "AV:L/AC:H/PR:H/UI:N/S:U/C:H/I:H/A:H",
              "Cwe": "CWE-362",
              "Href": "https://bdu.fstec.ru/vul/2021-04846",
              "Impact": "Low",
              "Public": "20210813",
              "CveID": "BDU:2021-04846"
            },
            {
              "Cvss": "AV:L/AC:L/Au:S/C:C/I:C/A:C",
              "Cvss3": "AV:L/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H",
              "Cwe": "CWE-119",
              "Href": "https://bdu.fstec.ru/vul/2021-04854",
              "Impact": "High",
              "Public": "20210526",
              "CveID": "BDU:2021-04854"
            },
            {
              "Cvss": "AV:L/AC:M/Au:N/C:C/I:C/A:C",
              "Cvss3": "AV:L/AC:H/PR:L/UI:N/S:U/C:H/I:H/A:H",
              "Cwe": "CWE-362",
              "Href": "https://bdu.fstec.ru/vul/2021-04855",
              "Impact": "High",
              "Public": "20210422",
              "CveID": "BDU:2021-04855"
            },
            {
              "Cvss": "AV:L/AC:L/Au:N/C:P/I:P/A:P",
              "Cvss3": "AV:L/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H",
              "Cwe": "CWE-416",
              "Href": "https://bdu.fstec.ru/vul/2021-04856",
              "Impact": "High",
              "Public": "20210512",
              "CveID": "BDU:2021-04856"
            },
            {
              "Cvss": "AV:L/AC:L/Au:N/C:N/I:N/A:P",
              "Cvss3": "AV:L/AC:L/PR:L/UI:N/S:U/C:N/I:N/A:H",
              "Cwe": "CWE-415",
              "Href": "https://bdu.fstec.ru/vul/2021-04862",
              "Impact": "Low",
              "Public": "20210517",
              "CveID": "BDU:2021-04862"
            },
            {
              "Cvss": "AV:N/AC:H/Au:N/C:C/I:C/A:C",
              "Cvss3": "AV:N/AC:H/PR:L/UI:N/S:U/C:H/I:H/A:H",
              "Cwe": "CWE-264",
              "Href": "https://bdu.fstec.ru/vul/2022-00682",
              "Impact": "High",
              "Public": "20210928",
              "CveID": "BDU:2022-00682"
            },
            {
              "Cvss": "AV:L/AC:L/Au:S/C:C/I:C/A:C",
              "Cvss3": "AV:L/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H",
              "Cwe": "CWE-416",
              "Href": "https://bdu.fstec.ru/vul/2022-03028",
              "Impact": "High",
              "Public": "20210526",
              "CveID": "BDU:2022-03028"
            },
            {
              "Cvss": "AV:L/AC:L/Au:N/C:C/I:C/A:C",
              "Cvss3": "AV:L/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H",
              "Cwe": "CWE-416",
              "Href": "https://bdu.fstec.ru/vul/2022-03139",
              "Impact": "High",
              "Public": "20210526",
              "CveID": "BDU:2022-03139"
            },
            {
              "Cvss": "AV:N/AC:L/Au:N/C:N/I:N/A:C",
              "Cvss3": "AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H",
              "Cwe": "CWE-401",
              "Href": "https://bdu.fstec.ru/vul/2022-03141",
              "Impact": "High",
              "Public": "20210526",
              "CveID": "BDU:2022-03141"
            }
          ],
          "Cves": [
            {
              "Cvss": "AV:A/AC:M/Au:N/C:P/I:N/A:N",
              "Cvss3": "CVSS:3.1/AV:A/AC:L/PR:N/UI:R/S:U/C:L/I:N/A:N",
              "Cwe": "NVD-CWE-Other",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2020-24586",
              "Impact": "Low",
              "Public": "20210511",
              "CveID": "CVE-2020-24586"
            },
            {
              "Cvss": "AV:A/AC:H/Au:N/C:P/I:N/A:N",
              "Cvss3": "CVSS:3.1/AV:A/AC:H/PR:N/UI:R/S:U/C:L/I:N/A:N",
              "Cwe": "CWE-327",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2020-24587",
              "Impact": "Low",
              "Public": "20210511",
              "CveID": "CVE-2020-24587"
            },
            {
              "Cvss": "AV:A/AC:M/Au:N/C:N/I:P/A:N",
              "Cvss3": "CVSS:3.1/AV:A/AC:L/PR:N/UI:R/S:U/C:N/I:L/A:N",
              "Cwe": "CWE-327",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2020-24588",
              "Impact": "Low",
              "Public": "20210511",
              "CveID": "CVE-2020-24588"
            },
            {
              "Cvss": "AV:L/AC:L/Au:N/C:C/I:C/A:C",
              "Cvss3": "CVSS:3.1/AV:L/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H",
              "Cwe": "CWE-416",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2020-25670",
              "Impact": "High",
              "Public": "20210526",
              "CveID": "CVE-2020-25670"
            },
            {
              "Cvss": "AV:L/AC:L/Au:N/C:C/I:C/A:C",
              "Cvss3": "CVSS:3.1/AV:L/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H",
              "Cwe": "CWE-416",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2020-25671",
              "Impact": "High",
              "Public": "20210526",
              "CveID": "CVE-2020-25671"
            },
            {
              "Cvss": "AV:N/AC:L/Au:N/C:N/I:N/A:P",
              "Cvss3": "CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H",
              "Cwe": "CWE-401",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2020-25672",
              "Impact": "High",
              "Public": "20210525",
              "CveID": "CVE-2020-25672"
            },
            {
              "Cvss": "AV:A/AC:L/Au:N/C:N/I:P/A:N",
              "Cvss3": "CVSS:3.1/AV:A/AC:L/PR:N/UI:N/S:U/C:N/I:H/A:N",
              "Cwe": "CWE-354",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2020-26141",
              "Impact": "Low",
              "Public": "20210511",
              "CveID": "CVE-2020-26141"
            },
            {
              "Cvss": "AV:A/AC:L/Au:N/C:N/I:P/A:N",
              "Cvss3": "CVSS:3.1/AV:A/AC:L/PR:N/UI:N/S:U/C:N/I:H/A:N",
              "Cwe": "CWE-20",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2020-26145",
              "Impact": "Low",
              "Public": "20210511",
              "CveID": "CVE-2020-26145"
            },
            {
              "Cvss": "AV:A/AC:H/Au:N/C:P/I:P/A:N",
              "Cvss3": "CVSS:3.1/AV:A/AC:H/PR:N/UI:R/S:U/C:L/I:H/A:N",
              "Cwe": "NVD-CWE-Other",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2020-26147",
              "Impact": "Low",
              "Public": "20210511",
              "CveID": "CVE-2020-26147"
            },
            {
              "Cvss": "AV:L/AC:M/Au:N/C:C/I:C/A:C",
              "Cvss3": "CVSS:3.1/AV:L/AC:L/PR:H/UI:R/S:U/C:H/I:H/A:H",
              "Cwe": "NVD-CWE-Other",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2020-26541",
              "Impact": "Low",
              "Public": "20201002",
              "CveID": "CVE-2020-26541"
            },
            {
              "Cvss": "AV:L/AC:L/Au:N/C:N/I:N/A:P",
              "Cvss3": "CVSS:3.1/AV:L/AC:L/PR:L/UI:N/S:U/C:N/I:N/A:H",
              "Cwe": "NVD-CWE-noinfo",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2020-36311",
              "Impact": "Low",
              "Public": "20210407",
              "CveID": "CVE-2020-36311"
            },
            {
              "Cvss": "AV:L/AC:L/Au:N/C:P/I:P/A:P",
              "Cvss3": "CVSS:3.1/AV:L/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H",
              "Cwe": "CWE-119",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2021-22543",
              "Impact": "High",
              "Public": "20210526",
              "CveID": "CVE-2021-22543"
            },
            {
              "Cvss": "AV:L/AC:M/Au:N/C:C/I:C/A:C",
              "Cvss3": "CVSS:3.1/AV:L/AC:H/PR:L/UI:N/S:U/C:H/I:H/A:H",
              "Cwe": "CWE-362",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2021-23133",
              "Impact": "High",
              "Public": "20210422",
              "CveID": "CVE-2021-23133"
            },
            {
              "Cvss": "AV:L/AC:L/Au:N/C:P/I:P/A:P",
              "Cvss3": "CVSS:3.1/AV:L/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H",
              "Cwe": "CWE-416",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2021-23134",
              "Impact": "High",
              "Public": "20210512",
              "CveID": "CVE-2021-23134"
            },
            {
              "Cvss": "AV:L/AC:L/Au:N/C:N/I:N/A:P",
              "Cvss3": "CVSS:3.1/AV:L/AC:L/PR:L/UI:N/S:U/C:N/I:N/A:H",
              "Cwe": "CWE-415",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2021-3564",
              "Impact": "Low",
              "Public": "20210608",
              "CveID": "CVE-2021-3564"
            },
            {
              "Cvss": "AV:L/AC:M/Au:N/C:C/I:C/A:C",
              "Cvss3": "CVSS:3.1/AV:L/AC:H/PR:H/UI:N/S:U/C:H/I:H/A:H",
              "Cwe": "CWE-362",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2021-3573",
              "Impact": "Low",
              "Public": "20210813",
              "CveID": "CVE-2021-3573"
            },
            {
              "Cvss": "AV:L/AC:L/Au:N/C:P/I:P/A:C",
              "Cvss3": "CVSS:3.1/AV:L/AC:L/PR:L/UI:N/S:C/C:H/I:H/A:H",
              "Cwe": "CWE-862",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2021-3653",
              "Impact": "High",
              "Public": "20210929",
              "CveID": "CVE-2021-3653"
            },
            {
              "Cvss": "AV:L/AC:L/Au:N/C:C/I:C/A:C",
              "Cvss3": "CVSS:3.1/AV:L/AC:L/PR:L/UI:N/S:C/C:H/I:H/A:H",
              "Cwe": "CWE-862",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2021-3656",
              "Impact": "High",
              "Public": "20220304",
              "CveID": "CVE-2021-3656"
            }
          ],
          "AffectedCpeList": {
            "Cpe": [
              "cpe:/o:alt:kworkstation:9",
              "cpe:/o:alt:workstation:9",
              "cpe:/o:alt:server:9",
              "cpe:/o:alt:server-v:9",
              "cpe:/o:alt:education:9",
              "cpe:/o:alt:slinux:9",
              "cpe:/o:alt:starterkit:p9",
              "cpe:/o:alt:kworkstation:9.1",
              "cpe:/o:alt:workstation:9.1",
              "cpe:/o:alt:server:9.1",
              "cpe:/o:alt:server-v:9.1",
              "cpe:/o:alt:education:9.1",
              "cpe:/o:alt:slinux:9.1",
              "cpe:/o:alt:starterkit:9.1",
              "cpe:/o:alt:kworkstation:9.2",
              "cpe:/o:alt:workstation:9.2",
              "cpe:/o:alt:server:9.2",
              "cpe:/o:alt:server-v:9.2",
              "cpe:/o:alt:education:9.2",
              "cpe:/o:alt:slinux:9.2",
              "cpe:/o:alt:starterkit:9.2"
            ]
          }
        }
      },
      "Criteria": {
        "Operator": "AND",
        "Criterions": [
          {
            "TestRef": "oval:org.altlinux.errata:tst:1001",
            "Comment": "ALT Linux must be installed"
          }
        ],
        "Criterias": [
          {
            "Operator": "OR",
            "Criterions": [
              {
                "TestRef": "oval:org.altlinux.errata:tst:20212751001",
                "Comment": "kernel-headers-modules-std-pae is earlier than 2:5.4.144-alt1"
              },
              {
                "TestRef": "oval:org.altlinux.errata:tst:20212751002",
                "Comment": "kernel-headers-std-pae is earlier than 2:5.4.144-alt1"
              },
              {
                "TestRef": "oval:org.altlinux.errata:tst:20212751003",
                "Comment": "kernel-image-domU-std-pae is earlier than 2:5.4.144-alt1"
              },
              {
                "TestRef": "oval:org.altlinux.errata:tst:20212751004",
                "Comment": "kernel-image-std-pae is earlier than 2:5.4.144-alt1"
              },
              {
                "TestRef": "oval:org.altlinux.errata:tst:20212751005",
                "Comment": "kernel-modules-drm-ancient-std-pae is earlier than 2:5.4.144-alt1"
              },
              {
                "TestRef": "oval:org.altlinux.errata:tst:20212751006",
                "Comment": "kernel-modules-drm-nouveau-std-pae is earlier than 2:5.4.144-alt1"
              },
              {
                "TestRef": "oval:org.altlinux.errata:tst:20212751007",
                "Comment": "kernel-modules-drm-radeon-std-pae is earlier than 2:5.4.144-alt1"
              },
              {
                "TestRef": "oval:org.altlinux.errata:tst:20212751008",
                "Comment": "kernel-modules-drm-std-pae is earlier than 2:5.4.144-alt1"
              },
              {
                "TestRef": "oval:org.altlinux.errata:tst:20212751009",
                "Comment": "kernel-modules-ide-std-pae is earlier than 2:5.4.144-alt1"
              },
              {
                "TestRef": "oval:org.altlinux.errata:tst:20212751010",
                "Comment": "kernel-modules-staging-std-pae is earlier than 2:5.4.144-alt1"
              },
              {
                "TestRef": "oval:org.altlinux.errata:tst:20212751011",
                "Comment": "kernel-modules-v4l-std-pae is earlier than 2:5.4.144-alt1"
              }
            ]
          }
        ]
      }
    }
  ]
}