{
  "Definition": [
    {
      "ID": "oval:org.altlinux.errata:def:20222429",
      "Version": "oval:org.altlinux.errata:def:20222429",
      "Class": "patch",
      "Metadata": {
        "Title": "ALT-PU-2022-2429: package `redis` update to version 6.2.6-alt1",
        "AffectedList": [
          {
            "Family": "unix",
            "Platforms": [
              "ALT Linux branch p10"
            ],
            "Products": [
              "ALT Server",
              "ALT Virtualization Server",
              "ALT Workstation",
              "ALT Workstation K",
              "ALT Education",
              "Simply Linux",
              "Starterkit"
            ]
          }
        ],
        "References": [
          {
            "RefID": "ALT-PU-2022-2429",
            "RefURL": "https://errata.altlinux.org/ALT-PU-2022-2429",
            "Source": "ALTPU"
          },
          {
            "RefID": "BDU:2021-04030",
            "RefURL": "https://bdu.fstec.ru/vul/2021-04030",
            "Source": "BDU"
          },
          {
            "RefID": "BDU:2021-04962",
            "RefURL": "https://bdu.fstec.ru/vul/2021-04962",
            "Source": "BDU"
          },
          {
            "RefID": "BDU:2021-04966",
            "RefURL": "https://bdu.fstec.ru/vul/2021-04966",
            "Source": "BDU"
          },
          {
            "RefID": "BDU:2021-04969",
            "RefURL": "https://bdu.fstec.ru/vul/2021-04969",
            "Source": "BDU"
          },
          {
            "RefID": "BDU:2021-05031",
            "RefURL": "https://bdu.fstec.ru/vul/2021-05031",
            "Source": "BDU"
          },
          {
            "RefID": "BDU:2021-05037",
            "RefURL": "https://bdu.fstec.ru/vul/2021-05037",
            "Source": "BDU"
          },
          {
            "RefID": "BDU:2023-02305",
            "RefURL": "https://bdu.fstec.ru/vul/2023-02305",
            "Source": "BDU"
          },
          {
            "RefID": "BDU:2023-02353",
            "RefURL": "https://bdu.fstec.ru/vul/2023-02353",
            "Source": "BDU"
          },
          {
            "RefID": "BDU:2023-02451",
            "RefURL": "https://bdu.fstec.ru/vul/2023-02451",
            "Source": "BDU"
          },
          {
            "RefID": "CVE-2021-32626",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2021-32626",
            "Source": "CVE"
          },
          {
            "RefID": "CVE-2021-32627",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2021-32627",
            "Source": "CVE"
          },
          {
            "RefID": "CVE-2021-32628",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2021-32628",
            "Source": "CVE"
          },
          {
            "RefID": "CVE-2021-32672",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2021-32672",
            "Source": "CVE"
          },
          {
            "RefID": "CVE-2021-32675",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2021-32675",
            "Source": "CVE"
          },
          {
            "RefID": "CVE-2021-32687",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2021-32687",
            "Source": "CVE"
          },
          {
            "RefID": "CVE-2021-32761",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2021-32761",
            "Source": "CVE"
          },
          {
            "RefID": "CVE-2021-32762",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2021-32762",
            "Source": "CVE"
          },
          {
            "RefID": "CVE-2021-41099",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2021-41099",
            "Source": "CVE"
          }
        ],
        "Description": "This update upgrades redis to version 6.2.6-alt1. \nSecurity Fix(es):\n\n * BDU:2021-04030: Уязвимость параметра конфигурации proto-max-bulk-len системы управления базами данных (СУБД) Redis, позволяющая нарушителю выполнить произвольный код\n\n * BDU:2021-04962: Уязвимость сервера системы управления базами данных (СУБД) Redis, позволяющая нарушителю вызвать отказ в обслуживании\n\n * BDU:2021-04966: Уязвимость параметров конфигурации  proto-max-bulk-len и client-query-buffer-limit системы управления базами данных (СУБД) Redis, позволяющая нарушителю выполнить произвольный код\n\n * BDU:2021-04969: Уязвимость структуры данных ziplist системы управления базами данных (СУБД) Redis, позволяющая нарушителю выполнить произвольный код\n\n * BDU:2021-05031: Уязвимость интерпретатора скриптов Lua системы управления базами данных Redis. позволяющая нарушителю выполнить произвольный код\n\n * BDU:2021-05037: Уязвимость параметра конфигурации set-max-intset-entries системы управления базами данных (СУБД) Redis, позволяющая нарушителю выполнить произвольный код\n\n * BDU:2023-02305: Уязвимость библиотеки hiredis системы управления базами данных NoSQL Redis, связанная с целочисленным переполнением, позволяющая нарушителю получить доступ к конфиденциальным данным, нарушить их целостность, а также вызвать отказ в обслуживании\n\n * BDU:2023-02353: Уязвимость системы управления базами данных NoSQL Redis, связанная с целочисленным переполнением, позволяющая нарушителю получить доступ к конфиденциальным данным, нарушить их целостность, а также вызвать отказ в обслуживании\n\n * BDU:2023-02451: Уязвимость системы управления базами данных NoSQL Redis, связанная с чтением за границами буфера, позволяющая нарушителю получить доступ к конфиденциальным данным\n\n * CVE-2021-32626: Redis is an open source, in-memory database that persists on disk. In affected versions specially crafted Lua scripts executing in Redis can cause the heap-based Lua stack to be overflowed, due to incomplete checks for this condition. This can result with heap corruption and potentially remote code execution. This problem exists in all versions of Redis with Lua scripting support, starting from 2.6. The problem is fixed in versions 6.2.6, 6.0.16 and 5.0.14. For users unable to update an additional workaround to mitigate the problem without patching the redis-server executable is to prevent users from executing Lua scripts. This can be done using ACL to restrict EVAL and EVALSHA commands.\n\n * CVE-2021-32627: Redis is an open source, in-memory database that persists on disk. In affected versions an integer overflow bug in Redis can be exploited to corrupt the heap and potentially result with remote code execution. The vulnerability involves changing the default proto-max-bulk-len and client-query-buffer-limit configuration parameters to very large values and constructing specially crafted very large stream elements. The problem is fixed in Redis 6.2.6, 6.0.16 and 5.0.14. For users unable to upgrade an additional workaround to mitigate the problem without patching the redis-server executable is to prevent users from modifying the proto-max-bulk-len configuration parameter. This can be done using ACL to restrict unprivileged users from using the CONFIG SET command.\n\n * CVE-2021-32628: Redis is an open source, in-memory database that persists on disk. An integer overflow bug in the ziplist data structure used by all versions of Redis can be exploited to corrupt the heap and potentially result with remote code execution. The vulnerability involves modifying the default ziplist configuration parameters (hash-max-ziplist-entries, hash-max-ziplist-value, zset-max-ziplist-entries or zset-max-ziplist-value) to a very large value, and then constructing specially crafted commands to create very large ziplists. The problem is fixed in Redis versions 6.2.6, 6.0.16, 5.0.14. An additional workaround to mitigate the problem without patching the redis-server executable is to prevent users from modifying the above configuration parameters. This can be done using ACL to restrict unprivileged users from using the CONFIG SET command.\n\n * CVE-2021-32672: Redis is an open source, in-memory database that persists on disk. When using the Redis Lua Debugger, users can send malformed requests that cause the debugger’s protocol parser to read data beyond the actual buffer. This issue affects all versions of Redis with Lua debugging support (3.2 or newer). The problem is fixed in versions 6.2.6, 6.0.16 and 5.0.14.\n\n * CVE-2021-32675: Redis is an open source, in-memory database that persists on disk. When parsing an incoming Redis Standard Protocol (RESP) request, Redis allocates memory according to user-specified values which determine the number of elements (in the multi-bulk header) and size of each element (in the bulk header). An attacker delivering specially crafted requests over multiple connections can cause the server to allocate significant amount of memory. Because the same parsing mechanism is used to handle authentication requests, this vulnerability can also be exploited by unauthenticated users. The problem is fixed in Redis versions 6.2.6, 6.0.16 and 5.0.14. An additional workaround to mitigate this problem without patching the redis-server executable is to block access to prevent unauthenticated users from connecting to Redis. This can be done in different ways: Using network access control tools like firewalls, iptables, security groups, etc. or Enabling TLS and requiring users to authenticate using client side certificates.\n\n * CVE-2021-32687: Redis is an open source, in-memory database that persists on disk. An integer overflow bug affecting all versions of Redis can be exploited to corrupt the heap and potentially be used to leak arbitrary contents of the heap or trigger remote code execution. The vulnerability involves changing the default set-max-intset-entries configuration parameter to a very large value and constructing specially crafted commands to manipulate sets. The problem is fixed in Redis versions 6.2.6, 6.0.16 and 5.0.14. An additional workaround to mitigate the problem without patching the redis-server executable is to prevent users from modifying the set-max-intset-entries configuration parameter. This can be done using ACL to restrict unprivileged users from using the CONFIG SET command.\n\n * CVE-2021-32761: Redis is an in-memory database that persists on disk. A vulnerability involving out-of-bounds read and integer overflow to buffer overflow exists starting with version 2.2 and prior to versions 5.0.13, 6.0.15, and 6.2.5. On 32-bit systems, Redis `*BIT*` command are vulnerable to integer overflow that can potentially be exploited to corrupt the heap, leak arbitrary heap contents or trigger remote code execution. The vulnerability involves changing the default `proto-max-bulk-len` configuration parameter to a very large value and constructing specially crafted commands bit commands. This problem only affects Redis on 32-bit platforms, or compiled as a 32-bit binary. Redis versions 5.0.`3m 6.0.15, and 6.2.5 contain patches for this issue. An additional workaround to mitigate the problem without patching the `redis-server` executable is to prevent users from modifying the `proto-max-bulk-len` configuration parameter. This can be done using ACL to restrict unprivileged users from using the CONFIG SET command.\n\n * CVE-2021-32762: Redis is an open source, in-memory database that persists on disk. The redis-cli command line tool and redis-sentinel service may be vulnerable to integer overflow when parsing specially crafted large multi-bulk network replies. This is a result of a vulnerability in the underlying hiredis library which does not perform an overflow check before calling the calloc() heap allocation function. This issue only impacts systems with heap allocators that do not perform their own overflow checks. Most modern systems do and are therefore not likely to be affected. Furthermore, by default redis-sentinel uses the jemalloc allocator which is also not vulnerable. The problem is fixed in Redis versions 6.2.6, 6.0.16 and 5.0.14.\n\n * CVE-2021-41099: Redis is an open source, in-memory database that persists on disk. An integer overflow bug in the underlying string library can be used to corrupt the heap and potentially result with denial of service or remote code execution. The vulnerability involves changing the default proto-max-bulk-len configuration parameter to a very large value and constructing specially crafted network payloads or commands. The problem is fixed in Redis versions 6.2.6, 6.0.16 and 5.0.14. An additional workaround to mitigate the problem without patching the redis-server executable is to prevent users from modifying the proto-max-bulk-len configuration parameter. This can be done using ACL to restrict unprivileged users from using the CONFIG SET command.",
        "Advisory": {
          "From": "errata.altlinux.org",
          "Severity": "High",
          "Rights": "Copyright 2023 BaseALT Ltd.",
          "Issued": {
            "Date": "2022-08-12"
          },
          "Updated": {
            "Date": "2022-08-12"
          },
          "bdu": [
            {
              "Cvss": "AV:N/AC:M/Au:S/C:C/I:C/A:C",
              "Cvss3": "AV:N/AC:H/PR:L/UI:N/S:U/C:H/I:H/A:H",
              "Cwe": "CWE-125, CWE-190, CWE-680",
              "Href": "https://bdu.fstec.ru/vul/2021-04030",
              "Impact": "High",
              "Public": "20210721",
              "CveID": "BDU:2021-04030"
            },
            {
              "Cvss": "AV:N/AC:L/Au:N/C:N/I:N/A:C",
              "Cvss3": "AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H",
              "Cwe": "CWE-770",
              "Href": "https://bdu.fstec.ru/vul/2021-04962",
              "Impact": "High",
              "Public": "20211004",
              "CveID": "BDU:2021-04962"
            },
            {
              "Cvss": "AV:N/AC:H/Au:S/C:C/I:C/A:C",
              "Cvss3": "AV:N/AC:H/PR:L/UI:N/S:U/C:H/I:H/A:H",
              "Cwe": "CWE-190, CWE-680",
              "Href": "https://bdu.fstec.ru/vul/2021-04966",
              "Impact": "High",
              "Public": "20211004",
              "CveID": "BDU:2021-04966"
            },
            {
              "Cvss": "AV:N/AC:H/Au:S/C:C/I:C/A:C",
              "Cvss3": "AV:N/AC:H/PR:L/UI:N/S:U/C:H/I:H/A:H",
              "Cwe": "CWE-190, CWE-680",
              "Href": "https://bdu.fstec.ru/vul/2021-04969",
              "Impact": "High",
              "Public": "20211004",
              "CveID": "BDU:2021-04969"
            },
            {
              "Cvss": "AV:N/AC:H/Au:N/C:C/I:C/A:C",
              "Cvss3": "AV:N/AC:H/PR:L/UI:N/S:U/C:H/I:H/A:H",
              "Cwe": "CWE-122, CWE-787",
              "Href": "https://bdu.fstec.ru/vul/2021-05031",
              "Impact": "High",
              "Public": "20211004",
              "CveID": "BDU:2021-05031"
            },
            {
              "Cvss": "AV:N/AC:H/Au:S/C:C/I:C/A:C",
              "Cvss3": "AV:N/AC:H/PR:L/UI:N/S:U/C:H/I:H/A:H",
              "Cwe": "CWE-190, CWE-680",
              "Href": "https://bdu.fstec.ru/vul/2021-05037",
              "Impact": "High",
              "Public": "20211004",
              "CveID": "BDU:2021-05037"
            },
            {
              "Cvss": "AV:N/AC:L/Au:S/C:C/I:C/A:C",
              "Cvss3": "AV:N/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H",
              "Cwe": "CWE-190",
              "Href": "https://bdu.fstec.ru/vul/2023-02305",
              "Impact": "High",
              "Public": "20211004",
              "CveID": "BDU:2023-02305"
            },
            {
              "Cvss": "AV:N/AC:M/Au:S/C:C/I:C/A:C",
              "Cvss3": "AV:N/AC:H/PR:L/UI:N/S:U/C:H/I:H/A:H",
              "Cwe": "CWE-190",
              "Href": "https://bdu.fstec.ru/vul/2023-02353",
              "Impact": "High",
              "Public": "20211004",
              "CveID": "BDU:2023-02353"
            },
            {
              "Cvss": "AV:N/AC:L/Au:S/C:P/I:N/A:N",
              "Cvss3": "AV:N/AC:L/PR:L/UI:N/S:U/C:L/I:N/A:N",
              "Cwe": "CWE-125",
              "Href": "https://bdu.fstec.ru/vul/2023-02451",
              "Impact": "Low",
              "Public": "20211004",
              "CveID": "BDU:2023-02451"
            }
          ],
          "Cves": [
            {
              "Cvss": "AV:N/AC:L/Au:S/C:P/I:P/A:P",
              "Cvss3": "CVSS:3.1/AV:N/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H",
              "Cwe": "CWE-787",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2021-32626",
              "Impact": "High",
              "Public": "20211004",
              "CveID": "CVE-2021-32626"
            },
            {
              "Cvss": "AV:N/AC:M/Au:S/C:P/I:P/A:P",
              "Cvss3": "CVSS:3.1/AV:N/AC:H/PR:L/UI:N/S:U/C:H/I:H/A:H",
              "Cwe": "CWE-190",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2021-32627",
              "Impact": "High",
              "Public": "20211004",
              "CveID": "CVE-2021-32627"
            },
            {
              "Cvss": "AV:N/AC:M/Au:S/C:P/I:P/A:P",
              "Cvss3": "CVSS:3.1/AV:N/AC:H/PR:L/UI:N/S:U/C:H/I:H/A:H",
              "Cwe": "CWE-190",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2021-32628",
              "Impact": "High",
              "Public": "20211004",
              "CveID": "CVE-2021-32628"
            },
            {
              "Cvss": "AV:N/AC:L/Au:S/C:P/I:N/A:N",
              "Cvss3": "CVSS:3.1/AV:N/AC:L/PR:L/UI:N/S:U/C:L/I:N/A:N",
              "Cwe": "CWE-125",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2021-32672",
              "Impact": "Low",
              "Public": "20211004",
              "CveID": "CVE-2021-32672"
            },
            {
              "Cvss": "AV:N/AC:L/Au:N/C:N/I:N/A:P",
              "Cvss3": "CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H",
              "Cwe": "CWE-770",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2021-32675",
              "Impact": "High",
              "Public": "20211004",
              "CveID": "CVE-2021-32675"
            },
            {
              "Cvss": "AV:N/AC:M/Au:S/C:P/I:P/A:P",
              "Cvss3": "CVSS:3.1/AV:N/AC:H/PR:L/UI:N/S:U/C:H/I:H/A:H",
              "Cwe": "CWE-190",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2021-32687",
              "Impact": "High",
              "Public": "20211004",
              "CveID": "CVE-2021-32687"
            },
            {
              "Cvss": "AV:N/AC:M/Au:S/C:P/I:P/A:P",
              "Cvss3": "CVSS:3.1/AV:N/AC:H/PR:L/UI:N/S:U/C:H/I:H/A:H",
              "Cwe": "CWE-125",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2021-32761",
              "Impact": "High",
              "Public": "20210721",
              "CveID": "CVE-2021-32761"
            },
            {
              "Cvss": "AV:N/AC:L/Au:S/C:C/I:C/A:C",
              "Cvss3": "CVSS:3.1/AV:N/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H",
              "Cwe": "CWE-190",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2021-32762",
              "Impact": "High",
              "Public": "20211004",
              "CveID": "CVE-2021-32762"
            },
            {
              "Cvss": "AV:N/AC:M/Au:S/C:P/I:P/A:P",
              "Cvss3": "CVSS:3.1/AV:N/AC:H/PR:L/UI:N/S:U/C:H/I:H/A:H",
              "Cwe": "CWE-190",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2021-41099",
              "Impact": "High",
              "Public": "20211004",
              "CveID": "CVE-2021-41099"
            }
          ],
          "AffectedCpeList": {
            "Cpe": [
              "cpe:/o:alt:kworkstation:10",
              "cpe:/o:alt:workstation:10",
              "cpe:/o:alt:server:10",
              "cpe:/o:alt:server-v:10",
              "cpe:/o:alt:education:10",
              "cpe:/o:alt:slinux:10",
              "cpe:/o:alt:starterkit:p10",
              "cpe:/o:alt:kworkstation:10.1",
              "cpe:/o:alt:workstation:10.1",
              "cpe:/o:alt:server:10.1",
              "cpe:/o:alt:server-v:10.1",
              "cpe:/o:alt:education:10.1",
              "cpe:/o:alt:slinux:10.1",
              "cpe:/o:alt:starterkit:10.1",
              "cpe:/o:alt:kworkstation:10.2",
              "cpe:/o:alt:workstation:10.2",
              "cpe:/o:alt:server:10.2",
              "cpe:/o:alt:server-v:10.2",
              "cpe:/o:alt:education:10.2",
              "cpe:/o:alt:slinux:10.2",
              "cpe:/o:alt:starterkit:10.2"
            ]
          }
        }
      },
      "Criteria": {
        "Operator": "AND",
        "Criterions": [
          {
            "TestRef": "oval:org.altlinux.errata:tst:2001",
            "Comment": "ALT Linux must be installed"
          }
        ],
        "Criterias": [
          {
            "Operator": "OR",
            "Criterions": [
              {
                "TestRef": "oval:org.altlinux.errata:tst:20222429001",
                "Comment": "redis is earlier than 0:6.2.6-alt1"
              }
            ]
          }
        ]
      }
    }
  ]
}