{
  "Definition": [
    {
      "ID": "oval:org.altlinux.errata:def:20234135",
      "Version": "oval:org.altlinux.errata:def:20234135",
      "Class": "patch",
      "Metadata": {
        "Title": "ALT-PU-2023-4135: package `git` update to version 2.33.8-alt1",
        "AffectedList": [
          {
            "Family": "unix",
            "Platforms": [
              "ALT Linux branch c9f2"
            ],
            "Products": [
              "ALT SPWorkstation",
              "ALT SPServer"
            ]
          }
        ],
        "References": [
          {
            "RefID": "ALT-PU-2023-4135",
            "RefURL": "https://errata.altlinux.org/ALT-PU-2023-4135",
            "Source": "ALTPU"
          },
          {
            "RefID": "BDU:2021-01629",
            "RefURL": "https://bdu.fstec.ru/vul/2021-01629",
            "Source": "BDU"
          },
          {
            "RefID": "BDU:2022-02723",
            "RefURL": "https://bdu.fstec.ru/vul/2022-02723",
            "Source": "BDU"
          },
          {
            "RefID": "BDU:2022-04385",
            "RefURL": "https://bdu.fstec.ru/vul/2022-04385",
            "Source": "BDU"
          },
          {
            "RefID": "BDU:2023-00499",
            "RefURL": "https://bdu.fstec.ru/vul/2023-00499",
            "Source": "BDU"
          },
          {
            "RefID": "BDU:2023-00609",
            "RefURL": "https://bdu.fstec.ru/vul/2023-00609",
            "Source": "BDU"
          },
          {
            "RefID": "BDU:2023-01602",
            "RefURL": "https://bdu.fstec.ru/vul/2023-01602",
            "Source": "BDU"
          },
          {
            "RefID": "BDU:2023-01603",
            "RefURL": "https://bdu.fstec.ru/vul/2023-01603",
            "Source": "BDU"
          },
          {
            "RefID": "BDU:2023-02908",
            "RefURL": "https://bdu.fstec.ru/vul/2023-02908",
            "Source": "BDU"
          },
          {
            "RefID": "CVE-2021-21300",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2021-21300",
            "Source": "CVE"
          },
          {
            "RefID": "CVE-2021-40330",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2021-40330",
            "Source": "CVE"
          },
          {
            "RefID": "CVE-2022-23521",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2022-23521",
            "Source": "CVE"
          },
          {
            "RefID": "CVE-2022-24765",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2022-24765",
            "Source": "CVE"
          },
          {
            "RefID": "CVE-2022-29187",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2022-29187",
            "Source": "CVE"
          },
          {
            "RefID": "CVE-2022-39253",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2022-39253",
            "Source": "CVE"
          },
          {
            "RefID": "CVE-2022-39260",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2022-39260",
            "Source": "CVE"
          },
          {
            "RefID": "CVE-2022-41903",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2022-41903",
            "Source": "CVE"
          },
          {
            "RefID": "CVE-2023-22490",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2023-22490",
            "Source": "CVE"
          },
          {
            "RefID": "CVE-2023-23946",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2023-23946",
            "Source": "CVE"
          },
          {
            "RefID": "CVE-2023-25652",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2023-25652",
            "Source": "CVE"
          },
          {
            "RefID": "CVE-2023-25815",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2023-25815",
            "Source": "CVE"
          },
          {
            "RefID": "CVE-2023-29007",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2023-29007",
            "Source": "CVE"
          }
        ],
        "Description": "This update upgrades git to version 2.33.8-alt1. \nSecurity Fix(es):\n\n * BDU:2021-01629: Уязвимость компонента Git средства разработки программного обеспечения Microsoft Visual Studio, позволяющая нарушителю выполнить произвольный код\n\n * BDU:2022-02723: Уязвимость распределенной системы управления версиями Git, связанная с недостатками разграничения доступа, позволяющая нарушителю повысить свои привилегии или выполнить произвольные команды\n\n * BDU:2022-04385: Уязвимость распределенной системы управления версиями Git, связанная с недостатками разграничения доступа, позволяющая нарушителю повысить свои привилегии или выполнить произвольные команды\n\n * BDU:2023-00499: Уязвимость механизма определения атрибутов для путей gitattributes распределенной системы контроля версий Git, позволяющая нарушителю выполнить произвольный код\n\n * BDU:2023-00609: Уязвимость функции pretty.c::format_and_pad_commit() механизма форматирования коммитов распределенной системы контроля версий Git, позволяющая нарушителю выполнить произвольный код\n\n * BDU:2023-01602: Уязвимость распределенной системы управления версиями Git, связанная с передачей частных ресурсов в новую сферу, позволяющая нарушителю получить доступ к конфиденциальной информации\n\n * BDU:2023-01603: Уязвимость распределенной системы управления версиями Git, связанная с неправильным ограничением имени пути к каталогу с ограниченным доступом, позволяющая нарушителю перезаписать произвольные файлы в системе\n\n * BDU:2023-02908: Уязвимость функции git_config_copy_or_rename_section_in_file файла config.c распределенной системы управления версиями Git, позволяющая нарушителю выполнить произвольный код\n\n * CVE-2021-21300: Git is an open-source distributed revision control system. In affected versions of Git a specially crafted repository that contains symbolic links as well as files using a clean/smudge filter such as Git LFS, may cause just-checked out script to be executed while cloning onto a case-insensitive file system such as NTFS, HFS+ or APFS (i.e. the default file systems on Windows and macOS). Note that clean/smudge filters have to be configured for that. Git for Windows configures Git LFS by default, and is therefore vulnerable. The problem has been patched in the versions published on Tuesday, March 9th, 2021. As a workaound, if symbolic link support is disabled in Git (e.g. via `git config --global core.symlinks false`), the described attack won't work. Likewise, if no clean/smudge filters such as Git LFS are configured globally (i.e. _before_ cloning), the attack is foiled. As always, it is best to avoid cloning repositories from untrusted sources. The earliest impacted version is 2.14.2. The fix versions are: 2.30.1, 2.29.3, 2.28.1, 2.27.1, 2.26.3, 2.25.5, 2.24.4, 2.23.4, 2.22.5, 2.21.4, 2.20.5, 2.19.6, 2.18.5, 2.17.62.17.6.\n\n * CVE-2021-40330: git_connect_git in connect.c in Git before 2.30.1 allows a repository path to contain a newline character, which may result in unexpected cross-protocol requests, as demonstrated by the git://localhost:1234/%0d%0a%0d%0aGET%20/%20HTTP/1.1 substring.\n\n * CVE-2022-23521: Git is distributed revision control system. gitattributes are a mechanism to allow defining attributes for paths. These attributes can be defined by adding a `.gitattributes` file to the repository, which contains a set of file patterns and the attributes that should be set for paths matching this pattern. When parsing gitattributes, multiple integer overflows can occur when there is a huge number of path patterns, a huge number of attributes for a single pattern, or when the declared attribute names are huge. These overflows can be triggered via a crafted `.gitattributes` file that may be part of the commit history. Git silently splits lines longer than 2KB when parsing gitattributes from a file, but not when parsing them from the index. Consequentially, the failure mode depends on whether the file exists in the working tree, the index or both. This integer overflow can result in arbitrary heap reads and writes, which may result in remote code execution. The problem has been patched in the versions published on 2023-01-17, going back to v2.30.7. Users are advised to upgrade. There are no known workarounds for this issue.\n\n * CVE-2022-24765: Git for Windows is a fork of Git containing Windows-specific patches. This vulnerability affects users working on multi-user machines, where untrusted parties have write access to the same hard disk. Those untrusted parties could create the folder `C:\\.git`, which would be picked up by Git operations run supposedly outside a repository while searching for a Git directory. Git would then respect any config in said Git directory. Git Bash users who set `GIT_PS1_SHOWDIRTYSTATE` are vulnerable as well. Users who installed posh-gitare vulnerable simply by starting a PowerShell. Users of IDEs such as Visual Studio are vulnerable: simply creating a new project would already read and respect the config specified in `C:\\.git\\config`. Users of the Microsoft fork of Git are vulnerable simply by starting a Git Bash. The problem has been patched in Git for Windows v2.35.2. Users unable to upgrade may create the folder `.git` on all drives where Git commands are run, and remove read/write access from those folders as a workaround. Alternatively, define or extend `GIT_CEILING_DIRECTORIES` to cover the _parent_ directory of the user profile, e.g. `C:\\Users` if the user profile is located in `C:\\Users\\my-user-name`.\n\n * CVE-2022-29187: Git is a distributed revision control system. Git prior to versions 2.37.1, 2.36.2, 2.35.4, 2.34.4, 2.33.4, 2.32.3, 2.31.4, and 2.30.5, is vulnerable to privilege escalation in all platforms. An unsuspecting user could still be affected by the issue reported in CVE-2022-24765, for example when navigating as root into a shared tmp directory that is owned by them, but where an attacker could create a git repository. Versions 2.37.1, 2.36.2, 2.35.4, 2.34.4, 2.33.4, 2.32.3, 2.31.4, and 2.30.5 contain a patch for this issue. The simplest way to avoid being affected by the exploit described in the example is to avoid running git as root (or an Administrator in Windows), and if needed to reduce its use to a minimum. While a generic workaround is not possible, a system could be hardened from the exploit described in the example by removing any such repository if it exists already and creating one as root to block any future attacks.\n\n * CVE-2022-39253: Git is an open source, scalable, distributed revision control system. Versions prior to 2.30.6, 2.31.5, 2.32.4, 2.33.5, 2.34.5, 2.35.5, 2.36.3, and 2.37.4 are subject to exposure of sensitive information to a malicious actor. When performing a local clone (where the source and target of the clone are on the same volume), Git copies the contents of the source's `$GIT_DIR/objects` directory into the destination by either creating hardlinks to the source contents, or copying them (if hardlinks are disabled via `--no-hardlinks`). A malicious actor could convince a victim to clone a repository with a symbolic link pointing at sensitive information on the victim's machine. This can be done either by having the victim clone a malicious repository on the same machine, or having them clone a malicious repository embedded as a bare repository via a submodule from any source, provided they clone with the `--recurse-submodules` option. Git does not create symbolic links in the `$GIT_DIR/objects` directory. The problem has been patched in the versions published on 2022-10-18, and backported to v2.30.x. Potential workarounds: Avoid cloning untrusted repositories using the `--local` optimization when on a shared machine, either by passing the `--no-local` option to `git clone` or cloning from a URL that uses the `file://` scheme. Alternatively, avoid cloning repositories from untrusted sources with `--recurse-submodules` or run `git config --global protocol.file.allow user`.\n\n * CVE-2022-39260: Git is an open source, scalable, distributed revision control system. `git shell` is a restricted login shell that can be used to implement Git's push/pull functionality via SSH. In versions prior to 2.30.6, 2.31.5, 2.32.4, 2.33.5, 2.34.5, 2.35.5, 2.36.3, and 2.37.4, the function that splits the command arguments into an array improperly uses an `int` to represent the number of entries in the array, allowing a malicious actor to intentionally overflow the return value, leading to arbitrary heap writes. Because the resulting array is then passed to `execv()`, it is possible to leverage this attack to gain remote code execution on a victim machine. Note that a victim must first allow access to `git shell` as a login shell in order to be vulnerable to this attack. This problem is patched in versions 2.30.6, 2.31.5, 2.32.4, 2.33.5, 2.34.5, 2.35.5, 2.36.3, and 2.37.4 and users are advised to upgrade to the latest version. Disabling `git shell` access via remote logins is a viable short-term workaround.\n\n * CVE-2022-41903: Git is distributed revision control system. `git log` can display commits in an arbitrary format using its `--format` specifiers. This functionality is also exposed to `git archive` via the `export-subst` gitattribute. When processing the padding operators, there is a integer overflow in `pretty.c::format_and_pad_commit()` where a `size_t` is stored improperly as an `int`, and then added as an offset to a `memcpy()`. This overflow can be triggered directly by a user running a command which invokes the commit formatting machinery (e.g., `git log --format=...`). It may also be triggered indirectly through git archive via the export-subst mechanism, which expands format specifiers inside of files within the repository during a git archive. This integer overflow can result in arbitrary heap writes, which may result in arbitrary code execution. The problem has been patched in the versions published on 2023-01-17, going back to v2.30.7. Users are advised to upgrade. Users who are unable to upgrade should disable `git archive` in untrusted repositories. If you expose git archive via `git daemon`, disable it by running `git config --global daemon.uploadArch false`.\n\n * CVE-2023-22490: Git is a revision control system. Using a specially-crafted repository, Git prior to versions 2.39.2, 2.38.4, 2.37.6, 2.36.5, 2.35.7, 2.34.7, 2.33.7, 2.32.6, 2.31.7, and 2.30.8 can be tricked into using its local clone optimization even when using a non-local transport. Though Git will abort local clones whose source `$GIT_DIR/objects` directory contains symbolic links, the `objects` directory itself may still be a symbolic link. These two may be combined to include arbitrary files based on known paths on the victim's filesystem within the malicious repository's working copy, allowing for data exfiltration in a similar manner as CVE-2022-39253. A fix has been prepared and will appear in v2.39.2 v2.38.4 v2.37.6 v2.36.5 v2.35.7 v2.34.7 v2.33.7 v2.32.6, v2.31.7 and v2.30.8. If upgrading is impractical, two short-term workarounds are available. Avoid cloning repositories from untrusted sources with `--recurse-submodules`. Instead, consider cloning repositories without recursively cloning their submodules, and instead run `git submodule update` at each layer. Before doing so, inspect each new `.gitmodules` file to ensure that it does not contain suspicious module URLs.\n\n * CVE-2023-23946: Git, a revision control system, is vulnerable to path traversal prior to versions 2.39.2, 2.38.4, 2.37.6, 2.36.5, 2.35.7, 2.34.7, 2.33.7, 2.32.6, 2.31.7, and 2.30.8. By feeding a crafted input to `git apply`, a path outside the working tree can be overwritten as the user who is running `git apply`. A fix has been prepared and will appear in v2.39.2, v2.38.4, v2.37.6, v2.36.5, v2.35.7, v2.34.7, v2.33.7, v2.32.6, v2.31.7, and v2.30.8. As a workaround, use `git apply --stat` to inspect a patch before applying; avoid applying one that creates a symbolic link and then creates a file beyond the symbolic link.\n\n * CVE-2023-25652: Git is a revision control system. Prior to versions 2.30.9, 2.31.8, 2.32.7, 2.33.8, 2.34.8, 2.35.8, 2.36.6, 2.37.7, 2.38.5, 2.39.3, and 2.40.1, by feeding specially crafted input to `git apply --reject`, a path outside the working tree can be overwritten with partially controlled contents (corresponding to the rejected hunk(s) from the given patch). A fix is available in versions 2.30.9, 2.31.8, 2.32.7, 2.33.8, 2.34.8, 2.35.8, 2.36.6, 2.37.7, 2.38.5, 2.39.3, and 2.40.1. As a workaround, avoid using `git apply` with `--reject` when applying patches from an untrusted source. Use `git apply --stat` to inspect a patch before applying; avoid applying one that create a conflict where a link corresponding to the `*.rej` file exists.\n\n * CVE-2023-25815: In Git for Windows, the Windows port of Git, no localized messages are shipped with the installer. As a consequence, Git is expected not to localize messages at all, and skips the gettext initialization. However, due to a change in MINGW-packages, the `gettext()` function's implicit initialization no longer uses the runtime prefix but uses the hard-coded path `C:\\mingw64\\share\\locale` to look for localized messages. And since any authenticated user has the permission to create folders in `C:\\` (and since `C:\\mingw64` does not typically exist), it is possible for low-privilege users to place fake messages in that location where `git.exe` will pick them up in version 2.40.1.\n\nThis vulnerability is relatively hard to exploit and requires social engineering. For example, a legitimate message at the end of a clone could be maliciously modified to ask the user to direct their web browser to a malicious website, and the user might think that the message comes from Git and is legitimate. It does require local write access by the attacker, though, which makes this attack vector less likely. Version 2.40.1 contains a patch for this issue. Some workarounds are available. Do not work on a Windows machine with shared accounts, or alternatively create a `C:\\mingw64` folder and leave it empty. Users who have administrative rights may remove the permission to create folders in `C:\\`.\n\n * CVE-2023-29007: Git is a revision control system. Prior to versions 2.30.9, 2.31.8, 2.32.7, 2.33.8, 2.34.8, 2.35.8, 2.36.6, 2.37.7, 2.38.5, 2.39.3, and 2.40.1, a specially crafted `.gitmodules` file with submodule URLs that are longer than 1024 characters can used to exploit a bug in `config.c::git_config_copy_or_rename_section_in_file()`. This bug can be used to inject arbitrary configuration into a user's `$GIT_DIR/config` when attempting to remove the configuration section associated with that submodule. When the attacker injects configuration values which specify executables to run (such as `core.pager`, `core.editor`, `core.sshCommand`, etc.) this can lead to a remote code execution. A fix A fix is available in versions 2.30.9, 2.31.8, 2.32.7, 2.33.8, 2.34.8, 2.35.8, 2.36.6, 2.37.7, 2.38.5, 2.39.3, and 2.40.1. As a workaround, avoid running `git submodule deinit` on untrusted repositories or without prior inspection of any submodule sections in `$GIT_DIR/config`.",
        "Advisory": {
          "From": "errata.altlinux.org",
          "Severity": "Critical",
          "Rights": "Copyright 2023 BaseALT Ltd.",
          "Issued": {
            "Date": "2023-07-05"
          },
          "Updated": {
            "Date": "2023-07-05"
          },
          "bdu": [
            {
              "Cvss": "AV:N/AC:L/Au:S/C:C/I:C/A:C",
              "Cvss3": "AV:N/AC:L/PR:L/UI:R/S:U/C:H/I:H/A:H",
              "Cwe": "CWE-94",
              "Href": "https://bdu.fstec.ru/vul/2021-01629",
              "Impact": "High",
              "Public": "20210309",
              "CveID": "BDU:2021-01629"
            },
            {
              "Cvss": "AV:L/AC:M/Au:N/C:C/I:C/A:C",
              "Cvss3": "AV:L/AC:H/PR:L/UI:R/S:U/C:H/I:H/A:N",
              "Cwe": "CWE-284, CWE-427",
              "Href": "https://bdu.fstec.ru/vul/2022-02723",
              "Impact": "Low",
              "Public": "20220412",
              "CveID": "BDU:2022-02723"
            },
            {
              "Cvss": "AV:L/AC:L/Au:S/C:C/I:C/A:P",
              "Cvss3": "AV:L/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H",
              "Cwe": "CWE-282, CWE-427",
              "Href": "https://bdu.fstec.ru/vul/2022-04385",
              "Impact": "High",
              "Public": "20220712",
              "CveID": "BDU:2022-04385"
            },
            {
              "Cvss": "AV:N/AC:L/Au:N/C:C/I:C/A:C",
              "Cvss3": "AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H",
              "Cwe": "CWE-20, CWE-190",
              "Href": "https://bdu.fstec.ru/vul/2023-00499",
              "Impact": "Critical",
              "Public": "20230117",
              "CveID": "BDU:2023-00499"
            },
            {
              "Cvss": "AV:N/AC:L/Au:N/C:C/I:C/A:C",
              "Cvss3": "AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H",
              "Cwe": "CWE-122, CWE-190",
              "Href": "https://bdu.fstec.ru/vul/2023-00609",
              "Impact": "Critical",
              "Public": "20230117",
              "CveID": "BDU:2023-00609"
            },
            {
              "Cvss": "AV:L/AC:L/Au:N/C:C/I:N/A:N",
              "Cvss3": "AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:N/A:N",
              "Cwe": "CWE-59",
              "Href": "https://bdu.fstec.ru/vul/2023-01602",
              "Impact": "Low",
              "Public": "20230214",
              "CveID": "BDU:2023-01602"
            },
            {
              "Cvss": "AV:N/AC:L/Au:N/C:N/I:C/A:N",
              "Cvss3": "AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:H/A:N",
              "Cwe": "CWE-22",
              "Href": "https://bdu.fstec.ru/vul/2023-01603",
              "Impact": "High",
              "Public": "20230214",
              "CveID": "BDU:2023-01603"
            },
            {
              "Cvss": "AV:L/AC:L/Au:N/C:C/I:C/A:C",
              "Cvss3": "AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H",
              "Cwe": "CWE-74",
              "Href": "https://bdu.fstec.ru/vul/2023-02908",
              "Impact": "High",
              "Public": "20230425",
              "CveID": "BDU:2023-02908"
            }
          ],
          "Cves": [
            {
              "Cvss": "AV:N/AC:H/Au:N/C:P/I:P/A:P",
              "Cvss3": "CVSS:3.1/AV:N/AC:H/PR:N/UI:R/S:U/C:H/I:H/A:H",
              "Cwe": "CWE-59",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2021-21300",
              "Impact": "High",
              "Public": "20210309",
              "CveID": "CVE-2021-21300"
            },
            {
              "Cvss": "AV:N/AC:L/Au:N/C:P/I:N/A:N",
              "Cvss3": "CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:N/A:N",
              "Cwe": "NVD-CWE-noinfo",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2021-40330",
              "Impact": "High",
              "Public": "20210831",
              "CveID": "CVE-2021-40330"
            },
            {
              "Cvss3": "CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H",
              "Cwe": "CWE-190",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2022-23521",
              "Impact": "Critical",
              "Public": "20230117",
              "CveID": "CVE-2022-23521"
            },
            {
              "Cvss": "AV:L/AC:M/Au:N/C:C/I:C/A:C",
              "Cvss3": "CVSS:3.1/AV:L/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H",
              "Cwe": "CWE-427",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2022-24765",
              "Impact": "High",
              "Public": "20220412",
              "CveID": "CVE-2022-24765"
            },
            {
              "Cvss": "AV:L/AC:M/Au:N/C:C/I:C/A:C",
              "Cvss3": "CVSS:3.1/AV:L/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H",
              "Cwe": "CWE-427",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2022-29187",
              "Impact": "High",
              "Public": "20220712",
              "CveID": "CVE-2022-29187"
            },
            {
              "Cvss3": "CVSS:3.1/AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:N/A:N",
              "Cwe": "CWE-59",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2022-39253",
              "Impact": "Low",
              "Public": "20221019",
              "CveID": "CVE-2022-39253"
            },
            {
              "Cvss3": "CVSS:3.1/AV:N/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H",
              "Cwe": "CWE-787",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2022-39260",
              "Impact": "High",
              "Public": "20221019",
              "CveID": "CVE-2022-39260"
            },
            {
              "Cvss3": "CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H",
              "Cwe": "CWE-190",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2022-41903",
              "Impact": "Critical",
              "Public": "20230117",
              "CveID": "CVE-2022-41903"
            },
            {
              "Cvss3": "CVSS:3.1/AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:N/A:N",
              "Cwe": "CWE-59",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2023-22490",
              "Impact": "Low",
              "Public": "20230214",
              "CveID": "CVE-2023-22490"
            },
            {
              "Cvss3": "CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:H/A:N",
              "Cwe": "CWE-22",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2023-23946",
              "Impact": "High",
              "Public": "20230214",
              "CveID": "CVE-2023-23946"
            },
            {
              "Cvss3": "CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:H/A:N",
              "Cwe": "CWE-22",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2023-25652",
              "Impact": "High",
              "Public": "20230425",
              "CveID": "CVE-2023-25652"
            },
            {
              "Cvss3": "CVSS:3.1/AV:L/AC:H/PR:L/UI:R/S:U/C:N/I:L/A:N",
              "Cwe": "CWE-22",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2023-25815",
              "Impact": "Low",
              "Public": "20230425",
              "CveID": "CVE-2023-25815"
            },
            {
              "Cvss3": "CVSS:3.1/AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H",
              "Cwe": "CWE-74",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2023-29007",
              "Impact": "High",
              "Public": "20230425",
              "CveID": "CVE-2023-29007"
            }
          ],
          "AffectedCpeList": {
            "Cpe": [
              "cpe:/o:alt:spworkstation:8.4",
              "cpe:/o:alt:spserver:8.4"
            ]
          }
        }
      },
      "Criteria": {
        "Operator": "AND",
        "Criterions": [
          {
            "TestRef": "oval:org.altlinux.errata:tst:3001",
            "Comment": "ALT Linux must be installed"
          }
        ],
        "Criterias": [
          {
            "Operator": "OR",
            "Criterions": [
              {
                "TestRef": "oval:org.altlinux.errata:tst:20234135001",
                "Comment": "git is earlier than 0:2.33.8-alt1"
              },
              {
                "TestRef": "oval:org.altlinux.errata:tst:20234135002",
                "Comment": "git-arch is earlier than 0:2.33.8-alt1"
              },
              {
                "TestRef": "oval:org.altlinux.errata:tst:20234135003",
                "Comment": "git-contrib is earlier than 0:2.33.8-alt1"
              },
              {
                "TestRef": "oval:org.altlinux.errata:tst:20234135004",
                "Comment": "git-core is earlier than 0:2.33.8-alt1"
              },
              {
                "TestRef": "oval:org.altlinux.errata:tst:20234135005",
                "Comment": "git-cvs is earlier than 0:2.33.8-alt1"
              },
              {
                "TestRef": "oval:org.altlinux.errata:tst:20234135006",
                "Comment": "git-diff-highlight is earlier than 0:2.33.8-alt1"
              },
              {
                "TestRef": "oval:org.altlinux.errata:tst:20234135007",
                "Comment": "git-doc is earlier than 0:2.33.8-alt1"
              },
              {
                "TestRef": "oval:org.altlinux.errata:tst:20234135008",
                "Comment": "git-email is earlier than 0:2.33.8-alt1"
              },
              {
                "TestRef": "oval:org.altlinux.errata:tst:20234135009",
                "Comment": "git-full is earlier than 0:2.33.8-alt1"
              },
              {
                "TestRef": "oval:org.altlinux.errata:tst:20234135010",
                "Comment": "git-gui is earlier than 0:2.33.8-alt1"
              },
              {
                "TestRef": "oval:org.altlinux.errata:tst:20234135011",
                "Comment": "git-server is earlier than 0:2.33.8-alt1"
              },
              {
                "TestRef": "oval:org.altlinux.errata:tst:20234135012",
                "Comment": "git-subtree is earlier than 0:2.33.8-alt1"
              },
              {
                "TestRef": "oval:org.altlinux.errata:tst:20234135013",
                "Comment": "git-svn is earlier than 0:2.33.8-alt1"
              },
              {
                "TestRef": "oval:org.altlinux.errata:tst:20234135014",
                "Comment": "gitk is earlier than 0:2.33.8-alt1"
              },
              {
                "TestRef": "oval:org.altlinux.errata:tst:20234135015",
                "Comment": "gitweb is earlier than 0:2.33.8-alt1"
              },
              {
                "TestRef": "oval:org.altlinux.errata:tst:20234135016",
                "Comment": "perl-Git is earlier than 0:2.33.8-alt1"
              }
            ]
          }
        ]
      }
    }
  ]
}