{
  "Definition": [
    {
      "ID": "oval:org.altlinux.errata:def:20234785",
      "Version": "oval:org.altlinux.errata:def:20234785",
      "Class": "patch",
      "Metadata": {
        "Title": "ALT-PU-2023-4785: package `golang` update to version 1.19.12-alt1",
        "AffectedList": [
          {
            "Family": "unix",
            "Platforms": [
              "ALT Linux branch c9f2"
            ],
            "Products": [
              "ALT SPWorkstation",
              "ALT SPServer"
            ]
          }
        ],
        "References": [
          {
            "RefID": "ALT-PU-2023-4785",
            "RefURL": "https://errata.altlinux.org/ALT-PU-2023-4785",
            "Source": "ALTPU"
          },
          {
            "RefID": "BDU:2023-00266",
            "RefURL": "https://bdu.fstec.ru/vul/2023-00266",
            "Source": "BDU"
          },
          {
            "RefID": "BDU:2023-01943",
            "RefURL": "https://bdu.fstec.ru/vul/2023-01943",
            "Source": "BDU"
          },
          {
            "RefID": "BDU:2023-02657",
            "RefURL": "https://bdu.fstec.ru/vul/2023-02657",
            "Source": "BDU"
          },
          {
            "RefID": "BDU:2023-03200",
            "RefURL": "https://bdu.fstec.ru/vul/2023-03200",
            "Source": "BDU"
          },
          {
            "RefID": "BDU:2023-03201",
            "RefURL": "https://bdu.fstec.ru/vul/2023-03201",
            "Source": "BDU"
          },
          {
            "RefID": "BDU:2023-03470",
            "RefURL": "https://bdu.fstec.ru/vul/2023-03470",
            "Source": "BDU"
          },
          {
            "RefID": "BDU:2023-03471",
            "RefURL": "https://bdu.fstec.ru/vul/2023-03471",
            "Source": "BDU"
          },
          {
            "RefID": "BDU:2023-03472",
            "RefURL": "https://bdu.fstec.ru/vul/2023-03472",
            "Source": "BDU"
          },
          {
            "RefID": "BDU:2023-04160",
            "RefURL": "https://bdu.fstec.ru/vul/2023-04160",
            "Source": "BDU"
          },
          {
            "RefID": "BDU:2023-04161",
            "RefURL": "https://bdu.fstec.ru/vul/2023-04161",
            "Source": "BDU"
          },
          {
            "RefID": "CVE-2022-41716",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2022-41716",
            "Source": "CVE"
          },
          {
            "RefID": "CVE-2022-41717",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2022-41717",
            "Source": "CVE"
          },
          {
            "RefID": "CVE-2022-41720",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2022-41720",
            "Source": "CVE"
          },
          {
            "RefID": "CVE-2022-41722",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2022-41722",
            "Source": "CVE"
          },
          {
            "RefID": "CVE-2022-41723",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2022-41723",
            "Source": "CVE"
          },
          {
            "RefID": "CVE-2022-41724",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2022-41724",
            "Source": "CVE"
          },
          {
            "RefID": "CVE-2022-41725",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2022-41725",
            "Source": "CVE"
          },
          {
            "RefID": "CVE-2023-24532",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2023-24532",
            "Source": "CVE"
          },
          {
            "RefID": "CVE-2023-24534",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2023-24534",
            "Source": "CVE"
          },
          {
            "RefID": "CVE-2023-24536",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2023-24536",
            "Source": "CVE"
          },
          {
            "RefID": "CVE-2023-24537",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2023-24537",
            "Source": "CVE"
          },
          {
            "RefID": "CVE-2023-24538",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2023-24538",
            "Source": "CVE"
          },
          {
            "RefID": "CVE-2023-24539",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2023-24539",
            "Source": "CVE"
          },
          {
            "RefID": "CVE-2023-24540",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2023-24540",
            "Source": "CVE"
          },
          {
            "RefID": "CVE-2023-29400",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2023-29400",
            "Source": "CVE"
          },
          {
            "RefID": "CVE-2023-29402",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2023-29402",
            "Source": "CVE"
          },
          {
            "RefID": "CVE-2023-29403",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2023-29403",
            "Source": "CVE"
          },
          {
            "RefID": "CVE-2023-29404",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2023-29404",
            "Source": "CVE"
          },
          {
            "RefID": "CVE-2023-29405",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2023-29405",
            "Source": "CVE"
          },
          {
            "RefID": "CVE-2023-29406",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2023-29406",
            "Source": "CVE"
          },
          {
            "RefID": "CVE-2023-29409",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2023-29409",
            "Source": "CVE"
          }
        ],
        "Description": "This update upgrades golang to version 1.19.12-alt1. \nSecurity Fix(es):\n\n * BDU:2023-00266: Уязвимость языка программирования Go, связанная с неверной нейтрализация особых элементов в выходных данных, позволяющая нарушителю установить произвольные переменные среды в Windows\n\n * BDU:2023-01943: Уязвимость библиотек net/http и mime/multipart средства разработки GoLang, используемых в прикладном программном обеспечении ППО \u0026quot;Аврора Центр\u0026quot;, позволяющая нарушителю выполнить атаку типа \u0026quot;отказ в обслуживании\n\n * BDU:2023-02657: Уязвимость методов ScalarMult и ScalarBaseMult языка программирования Go, позволяющая нарушителю оказать воздействие на целостность защищаемой информации\n\n * BDU:2023-03200: Уязвимость языка программирования Go, связанная с небезопасным внешним контролем за критическими данными состояния, позволяющая нарушителю повысить свои привилегии и получить доступ на чтение, изменение или удаление данных\n\n * BDU:2023-03201: Уязвимость модуля Cgo языка программирования Go, позволяющая нарушителю выполнить произвольный код\n\n * BDU:2023-03470: Уязвимость языка программирования Go, связанная с ошибками при обработке специальных символов \u0026quot;\u0026lt;\u0026gt;\u0026quot; в контексте CSS, позволяющая нарушителю выполнить произвольный код\n\n * BDU:2023-03471: Уязвимость языка программирования Go, связанная с ошибками при обработке пробельных символов в контексте JavaScript, позволяющая нарушителю оказать воздействие на конфиденциальность, целостность и доступность защищаемой информации\n\n * BDU:2023-03472: Уязвимость языка программирования Go, существующая из-за непринятия мер по нейтрализации специальных элементов, позволяющая нарушителю внедрить произвольные атрибуты в теги HTML\n\n * BDU:2023-04160: Уязвимость расширения Cgo языка программирования Go, позволяющая нарушителю выполнить произвольный код\n\n * BDU:2023-04161: Уязвимость расширения Cgo языка программирования Go, позволяющая нарушителю выполнить произвольный код\n\n * CVE-2022-41716: Due to unsanitized NUL values, attackers may be able to maliciously set environment variables on Windows. In syscall.StartProcess and os/exec.Cmd, invalid environment variable values containing NUL values are not properly checked for. A malicious environment variable value can exploit this behavior to set a value for a different environment variable. For example, the environment variable string \"A=B\\x00C=D\" sets the variables \"A=B\" and \"C=D\".\n\n * CVE-2022-41717: An attacker can cause excessive memory growth in a Go server accepting HTTP/2 requests. HTTP/2 server connections contain a cache of HTTP header keys sent by the client. While the total number of entries in this cache is capped, an attacker sending very large keys can cause the server to allocate approximately 64 MiB per open connection.\n\n * CVE-2022-41720: On Windows, restricted files can be accessed via os.DirFS and http.Dir. The os.DirFS function and http.Dir type provide access to a tree of files rooted at a given directory. These functions permit access to Windows device files under that root. For example, os.DirFS(\"C:/tmp\").Open(\"COM1\") opens the COM1 device. Both os.DirFS and http.Dir only provide read-only filesystem access. In addition, on Windows, an os.DirFS for the directory (the root of the current drive) can permit a maliciously crafted path to escape from the drive and access any path on the system. With fix applied, the behavior of os.DirFS(\"\") has changed. Previously, an empty root was treated equivalently to \"/\", so os.DirFS(\"\").Open(\"tmp\") would open the path \"/tmp\". This now returns an error.\n\n * CVE-2022-41722: A path traversal vulnerability exists in filepath.Clean on Windows. On Windows, the filepath.Clean function could transform an invalid path such as \"a/../c:/b\" into the valid path \"c:\\b\". This transformation of a relative (if invalid) path into an absolute path could enable a directory traversal attack. After fix, the filepath.Clean function transforms this path into the relative (but still invalid) path \".\\c:\\b\".\n\n * CVE-2022-41723: A maliciously crafted HTTP/2 stream could cause excessive CPU consumption in the HPACK decoder, sufficient to cause a denial of service from a small number of small requests.\n\n * CVE-2022-41724: Large handshake records may cause panics in crypto/tls. Both clients and servers may send large TLS handshake records which cause servers and clients, respectively, to panic when attempting to construct responses. This affects all TLS 1.3 clients, TLS 1.2 clients which explicitly enable session resumption (by setting Config.ClientSessionCache to a non-nil value), and TLS 1.3 servers which request client certificates (by setting Config.ClientAuth \u003e= RequestClientCert).\n\n * CVE-2022-41725: A denial of service is possible from excessive resource consumption in net/http and mime/multipart. Multipart form parsing with mime/multipart.Reader.ReadForm can consume largely unlimited amounts of memory and disk files. This also affects form parsing in the net/http package with the Request methods FormFile, FormValue, ParseMultipartForm, and PostFormValue. ReadForm takes a maxMemory parameter, and is documented as storing \"up to maxMemory bytes +10MB (reserved for non-file parts) in memory\". File parts which cannot be stored in memory are stored on disk in temporary files. The unconfigurable 10MB reserved for non-file parts is excessively large and can potentially open a denial of service vector on its own. However, ReadForm did not properly account for all memory consumed by a parsed form, such as map entry overhead, part names, and MIME headers, permitting a maliciously crafted form to consume well over 10MB. In addition, ReadForm contained no limit on the number of disk files created, permitting a relatively small request body to create a large number of disk temporary files. With fix, ReadForm now properly accounts for various forms of memory overhead, and should now stay within its documented limit of 10MB + maxMemory bytes of memory consumption. Users should still be aware that this limit is high and may still be hazardous. In addition, ReadForm now creates at most one on-disk temporary file, combining multiple form parts into a single temporary file. The mime/multipart.File interface type's documentation states, \"If stored on disk, the File's underlying concrete type will be an *os.File.\". This is no longer the case when a form contains more than one file part, due to this coalescing of parts into a single file. The previous behavior of using distinct files for each form part may be reenabled with the environment variable GODEBUG=multipartfiles=distinct. Users should be aware that multipart.ReadForm and the http.Request methods that call it do not limit the amount of disk consumed by temporary files. Callers can limit the size of form data with http.MaxBytesReader.\n\n * CVE-2023-24532: The ScalarMult and ScalarBaseMult methods of the P256 Curve may return an incorrect result if called with some specific unreduced scalars (a scalar larger than the order of the curve). This does not impact usages of crypto/ecdsa or crypto/ecdh.\n\n * CVE-2023-24534: HTTP and MIME header parsing can allocate large amounts of memory, even when parsing small inputs, potentially leading to a denial of service. Certain unusual patterns of input data can cause the common function used to parse HTTP and MIME headers to allocate substantially more memory than required to hold the parsed headers. An attacker can exploit this behavior to cause an HTTP server to allocate large amounts of memory from a small request, potentially leading to memory exhaustion and a denial of service. With fix, header parsing now correctly allocates only the memory required to hold parsed headers.\n\n * CVE-2023-24536: Multipart form parsing can consume large amounts of CPU and memory when processing form inputs containing very large numbers of parts. This stems from several causes: 1. mime/multipart.Reader.ReadForm limits the total memory a parsed multipart form can consume. ReadForm can undercount the amount of memory consumed, leading it to accept larger inputs than intended. 2. Limiting total memory does not account for increased pressure on the garbage collector from large numbers of small allocations in forms with many parts. 3. ReadForm can allocate a large number of short-lived buffers, further increasing pressure on the garbage collector. The combination of these factors can permit an attacker to cause an program that parses multipart forms to consume large amounts of CPU and memory, potentially resulting in a denial of service. This affects programs that use mime/multipart.Reader.ReadForm, as well as form parsing in the net/http package with the Request methods FormFile, FormValue, ParseMultipartForm, and PostFormValue. With fix, ReadForm now does a better job of estimating the memory consumption of parsed forms, and performs many fewer short-lived allocations. In addition, the fixed mime/multipart.Reader imposes the following limits on the size of parsed forms: 1. Forms parsed with ReadForm may contain no more than 1000 parts. This limit may be adjusted with the environment variable GODEBUG=multipartmaxparts=. 2. Form parts parsed with NextPart and NextRawPart may contain no more than 10,000 header fields. In addition, forms parsed with ReadForm may contain no more than 10,000 header fields across all parts. This limit may be adjusted with the environment variable GODEBUG=multipartmaxheaders=.\n\n * CVE-2023-24537: Calling any of the Parse functions on Go source code which contains //line directives with very large line numbers can cause an infinite loop due to integer overflow.\n\n * CVE-2023-24538: Templates do not properly consider backticks (`) as Javascript string delimiters, and do not escape them as expected. Backticks are used, since ES6, for JS template literals. If a template contains a Go template action within a Javascript template literal, the contents of the action can be used to terminate the literal, injecting arbitrary Javascript code into the Go template. As ES6 template literals are rather complex, and themselves can do string interpolation, the decision was made to simply disallow Go template actions from being used inside of them (e.g. \"var a = {{.}}\"), since there is no obviously safe way to allow this behavior. This takes the same approach as github.com/google/safehtml. With fix, Template.Parse returns an Error when it encounters templates like this, with an ErrorCode of value 12. This ErrorCode is currently unexported, but will be exported in the release of Go 1.21. Users who rely on the previous behavior can re-enable it using the GODEBUG flag jstmpllitinterp=1, with the caveat that backticks will now be escaped. This should be used with caution.\n\n * CVE-2023-24539: Angle brackets (\u003c\u003e) are not considered dangerous characters when inserted into CSS contexts. Templates containing multiple actions separated by a '/' character can result in unexpectedly closing the CSS context and allowing for injection of unexpected HTML, if executed with untrusted input.\n\n * CVE-2023-24540: Not all valid JavaScript whitespace characters are considered to be whitespace. Templates containing whitespace characters outside of the character set \"\\t\\n\\f\\r\\u0020\\u2028\\u2029\" in JavaScript contexts that also contain actions may not be properly sanitized during execution.\n\n * CVE-2023-29400: Templates containing actions in unquoted HTML attributes (e.g. \"attr={{.}}\") executed with empty input can result in output with unexpected results when parsed due to HTML normalization rules. This may allow injection of arbitrary attributes into tags.\n\n * CVE-2023-29402: The go command may generate unexpected code at build time when using cgo. This may result in unexpected behavior when running a go program which uses cgo. This may occur when running an untrusted module which contains directories with newline characters in their names. Modules which are retrieved using the go command, i.e. via \"go get\", are not affected (modules retrieved using GOPATH-mode, i.e. GO111MODULE=off, may be affected).\n\n * CVE-2023-29403: On Unix platforms, the Go runtime does not behave differently when a binary is run with the setuid/setgid bits. This can be dangerous in certain cases, such as when dumping memory state, or assuming the status of standard i/o file descriptors. If a setuid/setgid binary is executed with standard I/O file descriptors closed, opening any files can result in unexpected content being read or written with elevated privileges. Similarly, if a setuid/setgid program is terminated, either via panic or signal, it may leak the contents of its registers.\n\n * CVE-2023-29404: The go command may execute arbitrary code at build time when using cgo. This may occur when running \"go get\" on a malicious module, or when running any other command which builds untrusted code. This is can by triggered by linker flags, specified via a \"#cgo LDFLAGS\" directive. The arguments for a number of flags which are non-optional are incorrectly considered optional, allowing disallowed flags to be smuggled through the LDFLAGS sanitization. This affects usage of both the gc and gccgo compilers.\n\n * CVE-2023-29405: The go command may execute arbitrary code at build time when using cgo. This may occur when running \"go get\" on a malicious module, or when running any other command which builds untrusted code. This is can by triggered by linker flags, specified via a \"#cgo LDFLAGS\" directive. Flags containing embedded spaces are mishandled, allowing disallowed flags to be smuggled through the LDFLAGS sanitization by including them in the argument of another flag. This only affects usage of the gccgo compiler.\n\n * CVE-2023-29406: The HTTP/1 client does not fully validate the contents of the Host header. A maliciously crafted Host header can inject additional headers or entire requests. With fix, the HTTP/1 client now refuses to send requests containing an invalid Request.Host or Request.URL.Host value.\n\n * CVE-2023-29409: Extremely large RSA keys in certificate chains can cause a client/server to expend significant CPU time verifying signatures. With fix, the size of RSA keys transmitted during handshakes is restricted to \u003c= 8192 bits. Based on a survey of publicly trusted RSA keys, there are currently only three certificates in circulation with keys larger than this, and all three appear to be test certificates that are not actively deployed. It is possible there are larger keys in use in private PKIs, but we target the web PKI, so causing breakage here in the interests of increasing the default safety of users of crypto/tls seems reasonable.",
        "Advisory": {
          "From": "errata.altlinux.org",
          "Severity": "Critical",
          "Rights": "Copyright 2023 BaseALT Ltd.",
          "Issued": {
            "Date": "2023-08-14"
          },
          "Updated": {
            "Date": "2023-08-14"
          },
          "bdu": [
            {
              "Cvss": "AV:N/AC:L/Au:N/C:N/I:C/A:N",
              "Cvss3": "AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:H/A:N",
              "Cwe": "CWE-74, CWE-158",
              "Href": "https://bdu.fstec.ru/vul/2023-00266",
              "Impact": "High",
              "Public": "20221018",
              "CveID": "BDU:2023-00266"
            },
            {
              "Cvss": "AV:N/AC:L/Au:N/C:P/I:P/A:P",
              "Cvss3": "AV:N/AC:L/PR:N/UI:N/S:U/C:L/I:L/A:L",
              "Cwe": "CWE-400",
              "Href": "https://bdu.fstec.ru/vul/2023-01943",
              "Impact": "High",
              "Public": "20230410",
              "CveID": "BDU:2023-01943"
            },
            {
              "Cvss": "AV:N/AC:L/Au:N/C:N/I:P/A:N",
              "Cvss3": "AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:L/A:N",
              "Cwe": "CWE-682",
              "Href": "https://bdu.fstec.ru/vul/2023-02657",
              "Impact": "Low",
              "Public": "20230307",
              "CveID": "BDU:2023-02657"
            },
            {
              "Cvss": "AV:N/AC:H/Au:N/C:P/I:P/A:P",
              "Cvss3": "AV:N/AC:H/PR:N/UI:R/S:C/C:L/I:L/A:L",
              "Cwe": "CWE-642",
              "Href": "https://bdu.fstec.ru/vul/2023-03200",
              "Impact": "Low",
              "Public": "20230405",
              "CveID": "BDU:2023-03200"
            },
            {
              "Cvss": "AV:N/AC:H/Au:N/C:C/I:C/A:C",
              "Cvss3": "AV:N/AC:H/PR:N/UI:R/S:C/C:H/I:H/A:H",
              "Cwe": "CWE-94",
              "Href": "https://bdu.fstec.ru/vul/2023-03201",
              "Impact": "High",
              "Public": "20230405",
              "CveID": "BDU:2023-03201"
            },
            {
              "Cvss": "AV:N/AC:M/Au:N/C:P/I:P/A:P",
              "Cvss3": "AV:N/AC:L/PR:N/UI:N/S:U/C:L/I:L/A:L",
              "Cwe": "CWE-74",
              "Href": "https://bdu.fstec.ru/vul/2023-03470",
              "Impact": "High",
              "Public": "20230511",
              "CveID": "BDU:2023-03470"
            },
            {
              "Cvss": "AV:N/AC:M/Au:N/C:C/I:C/A:C",
              "Cvss3": "AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H",
              "Cwe": "CWE-74",
              "Href": "https://bdu.fstec.ru/vul/2023-03471",
              "Impact": "Critical",
              "Public": "20230511",
              "CveID": "BDU:2023-03471"
            },
            {
              "Cvss": "AV:N/AC:L/Au:N/C:P/I:P/A:P",
              "Cvss3": "AV:N/AC:L/PR:N/UI:N/S:U/C:L/I:L/A:L",
              "Cwe": "CWE-74",
              "Href": "https://bdu.fstec.ru/vul/2023-03472",
              "Impact": "High",
              "Public": "20230511",
              "CveID": "BDU:2023-03472"
            },
            {
              "Cvss": "AV:N/AC:L/Au:N/C:C/I:C/A:C",
              "Cvss3": "AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H",
              "Cwe": "CWE-74, CWE-88",
              "Href": "https://bdu.fstec.ru/vul/2023-04160",
              "Impact": "Critical",
              "Public": "20230519",
              "CveID": "BDU:2023-04160"
            },
            {
              "Cvss": "AV:N/AC:L/Au:N/C:C/I:C/A:C",
              "Cvss3": "AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H",
              "Cwe": "CWE-94",
              "Href": "https://bdu.fstec.ru/vul/2023-04161",
              "Impact": "Critical",
              "Public": "20230519",
              "CveID": "BDU:2023-04161"
            }
          ],
          "Cves": [
            {
              "Cvss3": "CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:H/A:N",
              "Cwe": "NVD-CWE-Other",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2022-41716",
              "Impact": "High",
              "Public": "20221102",
              "CveID": "CVE-2022-41716"
            },
            {
              "Cvss3": "CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:L",
              "Cwe": "CWE-770",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2022-41717",
              "Impact": "Low",
              "Public": "20221208",
              "CveID": "CVE-2022-41717"
            },
            {
              "Cvss3": "CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:N/A:N",
              "Cwe": "CWE-22",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2022-41720",
              "Impact": "High",
              "Public": "20221207",
              "CveID": "CVE-2022-41720"
            },
            {
              "Cvss3": "CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:N/A:N",
              "Cwe": "CWE-22",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2022-41722",
              "Impact": "High",
              "Public": "20230228",
              "CveID": "CVE-2022-41722"
            },
            {
              "Cvss3": "CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H",
              "Cwe": "NVD-CWE-Other",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2022-41723",
              "Impact": "High",
              "Public": "20230228",
              "CveID": "CVE-2022-41723"
            },
            {
              "Cvss3": "CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H",
              "Cwe": "CWE-400",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2022-41724",
              "Impact": "High",
              "Public": "20230228",
              "CveID": "CVE-2022-41724"
            },
            {
              "Cvss3": "CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H",
              "Cwe": "CWE-770",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2022-41725",
              "Impact": "High",
              "Public": "20230228",
              "CveID": "CVE-2022-41725"
            },
            {
              "Cvss3": "CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:L/A:N",
              "Cwe": "CWE-682",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2023-24532",
              "Impact": "Low",
              "Public": "20230308",
              "CveID": "CVE-2023-24532"
            },
            {
              "Cvss3": "CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H",
              "Cwe": "CWE-400",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2023-24534",
              "Impact": "High",
              "Public": "20230406",
              "CveID": "CVE-2023-24534"
            },
            {
              "Cvss3": "CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H",
              "Cwe": "CWE-770",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2023-24536",
              "Impact": "High",
              "Public": "20230406",
              "CveID": "CVE-2023-24536"
            },
            {
              "Cvss3": "CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H",
              "Cwe": "CWE-190",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2023-24537",
              "Impact": "High",
              "Public": "20230406",
              "CveID": "CVE-2023-24537"
            },
            {
              "Cvss3": "CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H",
              "Cwe": "CWE-94",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2023-24538",
              "Impact": "Critical",
              "Public": "20230406",
              "CveID": "CVE-2023-24538"
            },
            {
              "Cvss3": "CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:L/I:L/A:L",
              "Cwe": "CWE-74",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2023-24539",
              "Impact": "High",
              "Public": "20230511",
              "CveID": "CVE-2023-24539"
            },
            {
              "Cvss3": "CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H",
              "Cwe": "NVD-CWE-noinfo",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2023-24540",
              "Impact": "Critical",
              "Public": "20230511",
              "CveID": "CVE-2023-24540"
            },
            {
              "Cvss3": "CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:L/I:L/A:L",
              "Cwe": "CWE-74",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2023-29400",
              "Impact": "High",
              "Public": "20230511",
              "CveID": "CVE-2023-29400"
            },
            {
              "Cvss3": "CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H",
              "Cwe": "CWE-94",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2023-29402",
              "Impact": "Critical",
              "Public": "20230608",
              "CveID": "CVE-2023-29402"
            },
            {
              "Cvss3": "CVSS:3.1/AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H",
              "Cwe": "CWE-668",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2023-29403",
              "Impact": "High",
              "Public": "20230608",
              "CveID": "CVE-2023-29403"
            },
            {
              "Cvss3": "CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H",
              "Cwe": "CWE-94",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2023-29404",
              "Impact": "Critical",
              "Public": "20230608",
              "CveID": "CVE-2023-29404"
            },
            {
              "Cvss3": "CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H",
              "Cwe": "CWE-74",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2023-29405",
              "Impact": "Critical",
              "Public": "20230608",
              "CveID": "CVE-2023-29405"
            },
            {
              "Cvss3": "CVSS:3.1/AV:N/AC:L/PR:N/UI:R/S:U/C:N/I:H/A:N",
              "Cwe": "CWE-436",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2023-29406",
              "Impact": "Low",
              "Public": "20230711",
              "CveID": "CVE-2023-29406"
            },
            {
              "Cvss3": "CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:L",
              "Cwe": "CWE-400",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2023-29409",
              "Impact": "Low",
              "Public": "20230802",
              "CveID": "CVE-2023-29409"
            }
          ],
          "AffectedCpeList": {
            "Cpe": [
              "cpe:/o:alt:spworkstation:8.4",
              "cpe:/o:alt:spserver:8.4"
            ]
          }
        }
      },
      "Criteria": {
        "Operator": "AND",
        "Criterions": [
          {
            "TestRef": "oval:org.altlinux.errata:tst:3001",
            "Comment": "ALT Linux must be installed"
          }
        ],
        "Criterias": [
          {
            "Operator": "OR",
            "Criterions": [
              {
                "TestRef": "oval:org.altlinux.errata:tst:20234785001",
                "Comment": "golang is earlier than 0:1.19.12-alt1"
              },
              {
                "TestRef": "oval:org.altlinux.errata:tst:20234785002",
                "Comment": "golang-docs is earlier than 0:1.19.12-alt1"
              },
              {
                "TestRef": "oval:org.altlinux.errata:tst:20234785003",
                "Comment": "golang-gdb is earlier than 0:1.19.12-alt1"
              },
              {
                "TestRef": "oval:org.altlinux.errata:tst:20234785004",
                "Comment": "golang-misc is earlier than 0:1.19.12-alt1"
              },
              {
                "TestRef": "oval:org.altlinux.errata:tst:20234785005",
                "Comment": "golang-shared is earlier than 0:1.19.12-alt1"
              },
              {
                "TestRef": "oval:org.altlinux.errata:tst:20234785006",
                "Comment": "golang-src is earlier than 0:1.19.12-alt1"
              },
              {
                "TestRef": "oval:org.altlinux.errata:tst:20234785007",
                "Comment": "golang-tests is earlier than 0:1.19.12-alt1"
              }
            ]
          }
        ]
      }
    }
  ]
}