{
  "Definition": [
    {
      "ID": "oval:org.altlinux.errata:def:20234133",
      "Version": "oval:org.altlinux.errata:def:20234133",
      "Class": "patch",
      "Metadata": {
        "Title": "ALT-PU-2023-4133: package `grafana` update to version 9.5.5-alt1",
        "AffectedList": [
          {
            "Family": "unix",
            "Platforms": [
              "ALT Linux branch p10"
            ],
            "Products": [
              "ALT Server",
              "ALT Virtualization Server",
              "ALT Workstation",
              "ALT Workstation K",
              "ALT Education",
              "Simply Linux",
              "Starterkit"
            ]
          }
        ],
        "References": [
          {
            "RefID": "ALT-PU-2023-4133",
            "RefURL": "https://errata.altlinux.org/ALT-PU-2023-4133",
            "Source": "ALTPU"
          },
          {
            "RefID": "BDU:2022-05544",
            "RefURL": "https://bdu.fstec.ru/vul/2022-05544",
            "Source": "BDU"
          },
          {
            "RefID": "BDU:2022-07077",
            "RefURL": "https://bdu.fstec.ru/vul/2022-07077",
            "Source": "BDU"
          },
          {
            "RefID": "BDU:2023-01071",
            "RefURL": "https://bdu.fstec.ru/vul/2023-01071",
            "Source": "BDU"
          },
          {
            "RefID": "BDU:2023-01605",
            "RefURL": "https://bdu.fstec.ru/vul/2023-01605",
            "Source": "BDU"
          },
          {
            "RefID": "BDU:2023-01731",
            "RefURL": "https://bdu.fstec.ru/vul/2023-01731",
            "Source": "BDU"
          },
          {
            "RefID": "BDU:2023-01776",
            "RefURL": "https://bdu.fstec.ru/vul/2023-01776",
            "Source": "BDU"
          },
          {
            "RefID": "BDU:2023-03204",
            "RefURL": "https://bdu.fstec.ru/vul/2023-03204",
            "Source": "BDU"
          },
          {
            "RefID": "BDU:2023-03205",
            "RefURL": "https://bdu.fstec.ru/vul/2023-03205",
            "Source": "BDU"
          },
          {
            "RefID": "BDU:2023-03343",
            "RefURL": "https://bdu.fstec.ru/vul/2023-03343",
            "Source": "BDU"
          },
          {
            "RefID": "CVE-2022-23498",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2022-23498",
            "Source": "CVE"
          },
          {
            "RefID": "CVE-2022-27664",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2022-27664",
            "Source": "CVE"
          },
          {
            "RefID": "CVE-2022-29170",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2022-29170",
            "Source": "CVE"
          },
          {
            "RefID": "CVE-2022-31097",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2022-31097",
            "Source": "CVE"
          },
          {
            "RefID": "CVE-2022-31107",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2022-31107",
            "Source": "CVE"
          },
          {
            "RefID": "CVE-2022-32149",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2022-32149",
            "Source": "CVE"
          },
          {
            "RefID": "CVE-2022-35957",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2022-35957",
            "Source": "CVE"
          },
          {
            "RefID": "CVE-2022-36062",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2022-36062",
            "Source": "CVE"
          },
          {
            "RefID": "CVE-2023-0507",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2023-0507",
            "Source": "CVE"
          },
          {
            "RefID": "CVE-2023-0594",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2023-0594",
            "Source": "CVE"
          },
          {
            "RefID": "CVE-2023-1387",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2023-1387",
            "Source": "CVE"
          },
          {
            "RefID": "CVE-2023-1410",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2023-1410",
            "Source": "CVE"
          },
          {
            "RefID": "CVE-2023-2183",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2023-2183",
            "Source": "CVE"
          },
          {
            "RefID": "CVE-2023-22462",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2023-22462",
            "Source": "CVE"
          },
          {
            "RefID": "CVE-2023-2801",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2023-2801",
            "Source": "CVE"
          },
          {
            "RefID": "CVE-2023-28119",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2023-28119",
            "Source": "CVE"
          },
          {
            "RefID": "CVE-2023-3128",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2023-3128",
            "Source": "CVE"
          }
        ],
        "Description": "This update upgrades grafana to version 9.5.5-alt1. \nSecurity Fix(es):\n\n * BDU:2022-05544: Уязвимость пакета net/http языка программирования Go, позволяющая нарушителю оказать воздействие на конфиденциальность, целостность и доступность защищаемой информации\n\n * BDU:2022-07077: Уязвимость компонентов column.title и cellLinkTooltip веб-инструмента представления данных Grafana, позволяющая нарушителю повысить свои привилегии\n\n * BDU:2023-01071: Уязвимость веб-инструмента представления данных Grafana, связанная с отсутствием защиты служебных данных, позволяющая нарушителю получить доступ к сеансу текущего пользователя\n\n * BDU:2023-01605: Уязвимость плагина GeoMap веб-инструмента представления данных Grafana, связанная с недостаточной защитой структуры веб-страницы, позволяющая нарушителю повысить свои привилегии\n\n * BDU:2023-01731: Уязвимость веб-инструмента представления данных Grafana, связанная с недостаточной очисткой пользовательских данныхt, позволяющая нарушителю осуществлять межсайтовые сценарные атаки (XSS)\n\n * BDU:2023-01776: Уязвимость панели Trace View веб-инструмента представления данных Grafana, позволяющая нарушителю повысить свои привилегии и осуществить межсайтовые сценарные атаки\n\n * BDU:2023-03204: Уязвимость веб-инструмента представления данных Grafana, связанная с ошибками синхронизации, позволяющая нарушителю вызвать отказ в обслуживании\n\n * BDU:2023-03205: Уязвимость программного интерфейса веб-инструмента представления данных Grafana, позволяющая нарушителю повысить свои привилегии и проводить фишинг-атаки\n\n * BDU:2023-03343: Уязвимость веб-инструмента представления данных Grafana, связанная с обходом аутентификации посредством спуфинга, позволяющая нарушителю получить полный доступ к учетной записи пользователя\n\n * CVE-2022-23498: Grafana is an open-source platform for monitoring and observability. When datasource query caching is enabled, Grafana caches all headers, including `grafana_session`. As a result, any user that queries a datasource where the caching is enabled can acquire another user’s session. To mitigate the vulnerability you can disable datasource query caching for all datasources. This issue has been patched in versions 9.2.10 and 9.3.4.\n\n * CVE-2022-27664: In net/http in Go before 1.18.6 and 1.19.x before 1.19.1, attackers can cause a denial of service because an HTTP/2 connection can hang during closing if shutdown were preempted by a fatal error.\n\n * CVE-2022-29170: Grafana is an open-source platform for monitoring and observability. In Grafana Enterprise, the Request security feature allows list allows to configure Grafana in a way so that the instance doesn’t call or only calls specific hosts. The vulnerability present starting with version 7.4.0-beta1 and prior to versions 7.5.16 and 8.5.3 allows someone to bypass these security configurations if a malicious datasource (running on an allowed host) returns an HTTP redirect to a forbidden host. The vulnerability only impacts Grafana Enterprise when the Request security allow list is used and there is a possibility to add a custom datasource to Grafana which returns HTTP redirects. In this scenario, Grafana would blindly follow the redirects and potentially give secure information to the clients. Grafana Cloud is not impacted by this vulnerability. Versions 7.5.16 and 8.5.3 contain a patch for this issue. There are currently no known workarounds.\n\n * CVE-2022-31097: Grafana is an open-source platform for monitoring and observability. Versions on the 8.x and 9.x branch prior to 9.0.3, 8.5.9, 8.4.10, and 8.3.10 are vulnerable to stored cross-site scripting via the Unified Alerting feature of Grafana. An attacker can exploit this vulnerability to escalate privilege from editor to admin by tricking an authenticated admin to click on a link. Versions 9.0.3, 8.5.9, 8.4.10, and 8.3.10 contain a patch. As a workaround, it is possible to disable alerting or use legacy alerting.\n\n * CVE-2022-31107: Grafana is an open-source platform for monitoring and observability. In versions 5.3 until 9.0.3, 8.5.9, 8.4.10, and 8.3.10, it is possible for a malicious user who has authorization to log into a Grafana instance via a configured OAuth IdP which provides a login name to take over the account of another user in that Grafana instance. This can occur when the malicious user is authorized to log in to Grafana via OAuth, the malicious user's external user id is not already associated with an account in Grafana, the malicious user's email address is not already associated with an account in Grafana, and the malicious user knows the Grafana username of the target user. If these conditions are met, the malicious user can set their username in the OAuth provider to that of the target user, then go through the OAuth flow to log in to Grafana. Due to the way that external and internal user accounts are linked together during login, if the conditions above are all met then the malicious user will be able to log in to the target user's Grafana account. Versions 9.0.3, 8.5.9, 8.4.10, and 8.3.10 contain a patch for this issue. As a workaround, concerned users can disable OAuth login to their Grafana instance, or ensure that all users authorized to log in via OAuth have a corresponding user account in Grafana linked to their email address.\n\n * CVE-2022-32149: An attacker may cause a denial of service by crafting an Accept-Language header which ParseAcceptLanguage will take significant time to parse.\n\n * CVE-2022-35957: Grafana is an open-source platform for monitoring and observability. Versions prior to 9.1.6 and 8.5.13 are vulnerable to an escalation from admin to server admin when auth proxy is used, allowing an admin to take over the server admin account and gain full control of the grafana instance. All installations should be upgraded as soon as possible. As a workaround deactivate auth proxy following the instructions at: https://grafana.com/docs/grafana/latest/setup-grafana/configure-security/configure-authentication/auth-proxy/\n\n * CVE-2022-36062: Grafana is an open-source platform for monitoring and observability. In versions prior to 8.5.13, 9.0.9, and 9.1.6, Grafana is subject to Improper Preservation of Permissions resulting in privilege escalation on some folders where Admin is the only used permission. The vulnerability impacts Grafana instances where RBAC was disabled and enabled afterwards, as the migrations which are translating legacy folder permissions to RBAC permissions do not account for the scenario where the only user permission in the folder is Admin, as a result RBAC adds permissions for Editors and Viewers which allow them to edit and view folders accordingly. This issue has been patched in versions 8.5.13, 9.0.9, and 9.1.6. A workaround when the impacted folder/dashboard is known is to remove the additional permissions manually.\n\n * CVE-2023-0507: Grafana is an open-source platform for monitoring and observability. \n\nStarting with the 8.1 branch, Grafana had a stored XSS vulnerability affecting the core plugin GeoMap. \n\nThe stored XSS vulnerability was possible due to map attributions weren't properly sanitized and allowed arbitrary JavaScript to be executed in the context of the currently authorized user of the Grafana instance. \n\nAn attacker needs to have the Editor role in order to change a panel to include a map attribution containing JavaScript. \n\nThis means that vertical privilege escalation is possible, where a user with Editor role can change to a known password for a user having Admin role if the user with Admin role executes malicious JavaScript viewing a dashboard. \n\nUsers may upgrade to version 8.5.21, 9.2.13 and 9.3.8 to receive a fix. \n\n\n\n * CVE-2023-0594: Grafana is an open-source platform for monitoring and observability. Starting with the 7.0 branch, Grafana had a stored XSS vulnerability in the trace view visualization. The stored XSS vulnerability was possible due the value of a span's attributes/resources were not properly sanitized and this will be rendered when the span's attributes/resources are expanded. An attacker needs to have the Editor role in order to change the value of a trace view visualization to contain JavaScript. This means that vertical privilege escalation is possible, where a user with Editor role can change to a known password for a user having Admin role if the user with Admin role executes malicious JavaScript viewing a dashboard. Users may upgrade to version 8.5.21, 9.2.13 and 9.3.8 to receive a fix.\n\n * CVE-2023-1387: Grafana is an open-source platform for monitoring and observability. \n\nStarting with the 9.1 branch, Grafana introduced the ability to search for a JWT in the URL query parameter auth_token and use it as the authentication token. \n\nBy enabling the \"url_login\" configuration option (disabled by default), a JWT might be sent to data sources. If an attacker has access to the data source, the leaked token could be used to authenticate to Grafana.\n\n\n\n * CVE-2023-1410: Grafana is an open-source platform for monitoring and observability. \n\nGrafana had a stored XSS vulnerability in the Graphite FunctionDescription tooltip. \n\nThe stored XSS vulnerability was possible due the value of the Function Description was not properly sanitized.\n\nAn attacker needs to have control over the Graphite data source in order to manipulate a function description and a Grafana admin needs to configure the data source, later a Grafana user needs to select a tampered function and hover over the description. \n\n  Users may upgrade to version 8.5.22, 9.2.15 and 9.3.11 to receive a fix. \n\n\n\n\n\n\n\n\n\n\n\n\n * CVE-2023-2183: Grafana is an open-source platform for monitoring and observability. \n\nThe option to send a test alert is not available from the user panel UI for users having the Viewer role. It is still possible for a user with the Viewer role to send a test alert using the API as the API does not check access to this function.\n\nThis might enable malicious users to abuse the functionality by sending multiple alert messages to e-mail and Slack, spamming users, prepare Phishing attack or block SMTP server.\n\nUsers may upgrade to version 9.5.3, 9.4.12, 9.3.15, 9.2.19 and 8.5.26 to receive a fix.\n\n\n\n * CVE-2023-22462: Grafana is an open-source platform for monitoring and observability. On 2023-01-01 during an internal audit of Grafana, a member of the security team found a stored XSS vulnerability affecting the core plugin \"Text\". The stored XSS vulnerability requires several user interactions in order to be fully exploited. The vulnerability was possible due to React's render cycle that will pass though the unsanitized HTML code, but in the next cycle the HTML is cleaned up and saved in Grafana's database. An attacker needs to have the Editor role in order to change a Text panel to include JavaScript. Another user needs to edit the same Text panel, and click on \"Markdown\" or \"HTML\" for the code to be executed. This means that vertical privilege escalation is possible, where a user with Editor role can change to a known password for a user having Admin role if the user with Admin role executes malicious JavaScript viewing a dashboard. This issue has been patched in versions 9.2.10 and 9.3.4.\n\n * CVE-2023-2801: Grafana is an open-source platform for monitoring and observability. \n\nUsing public dashboards users can query multiple distinct data sources using mixed queries. However such query has a possibility of crashing a Grafana instance.\n\nThe only feature that uses mixed queries at the moment is public dashboards, but it's also possible to cause this by calling the query API directly.\n\nThis might enable malicious users to crash Grafana instances through that endpoint.\n\nUsers may upgrade to version 9.4.12 and 9.5.3 to receive a fix.\n\n\n\n * CVE-2023-28119: The crewjam/saml go library contains a partial implementation of the SAML standard in golang. Prior to version 0.4.13, the package's use of `flate.NewReader` does not limit the size of the input. The user can pass more than 1 MB of data in the HTTP request to the processing functions, which will be decompressed server-side using the Deflate algorithm. Therefore, after repeating the same request multiple times, it is possible to achieve a reliable crash since the operating system kills the process. This issue is patched in version 0.4.13.\n\n * CVE-2023-3128: Grafana is validating Azure AD accounts based on the email claim. \n\nOn Azure AD, the profile email field is not unique and can be easily modified. \n\nThis leads to account takeover and authentication bypass when Azure AD OAuth is configured with a multi-tenant app. \n\n",
        "Advisory": {
          "From": "errata.altlinux.org",
          "Severity": "Critical",
          "Rights": "Copyright 2023 BaseALT Ltd.",
          "Issued": {
            "Date": "2023-07-04"
          },
          "Updated": {
            "Date": "2023-07-04"
          },
          "bdu": [
            {
              "Cvss": "AV:N/AC:L/Au:N/C:C/I:C/A:C",
              "Cvss3": "AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H",
              "Cwe": "CWE-20",
              "Href": "https://bdu.fstec.ru/vul/2022-05544",
              "Impact": "Critical",
              "Public": "20220906",
              "CveID": "BDU:2022-05544"
            },
            {
              "Cvss": "AV:N/AC:L/Au:N/C:C/I:C/A:N",
              "Cvss3": "AV:N/AC:L/PR:L/UI:R/S:C/C:H/I:H/A:N",
              "Cwe": "CWE-79",
              "Href": "https://bdu.fstec.ru/vul/2022-07077",
              "Impact": "High",
              "Public": "20220715",
              "CveID": "BDU:2022-07077"
            },
            {
              "Cvss": "AV:N/AC:H/Au:S/C:C/I:C/A:P",
              "Cvss3": "AV:N/AC:H/PR:L/UI:N/S:U/C:H/I:H/A:L",
              "Cwe": "CWE-200",
              "Href": "https://bdu.fstec.ru/vul/2023-01071",
              "Impact": "High",
              "Public": "20230203",
              "CveID": "BDU:2023-01071"
            },
            {
              "Cvss": "AV:N/AC:L/Au:S/C:C/I:C/A:N",
              "Cvss3": "AV:N/AC:L/PR:L/UI:R/S:U/C:H/I:H/A:N",
              "Cwe": "CWE-78",
              "Href": "https://bdu.fstec.ru/vul/2023-01605",
              "Impact": "High",
              "Public": "20230228",
              "CveID": "BDU:2023-01605"
            },
            {
              "Cvss": "AV:N/AC:H/Au:S/C:C/I:C/A:N",
              "Cvss3": "AV:N/AC:H/PR:L/UI:R/S:U/C:H/I:H/A:N",
              "Cwe": "CWE-79",
              "Href": "https://bdu.fstec.ru/vul/2023-01731",
              "Impact": "Low",
              "Public": "20230328",
              "CveID": "BDU:2023-01731"
            },
            {
              "Cvss": "AV:N/AC:L/Au:S/C:C/I:C/A:N",
              "Cvss3": "AV:N/AC:L/PR:L/UI:R/S:U/C:H/I:H/A:N",
              "Cwe": "CWE-79, CWE-80",
              "Href": "https://bdu.fstec.ru/vul/2023-01776",
              "Impact": "High",
              "Public": "20230208",
              "CveID": "BDU:2023-01776"
            },
            {
              "Cvss": "AV:N/AC:L/Au:N/C:N/I:N/A:C",
              "Cvss3": "AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H",
              "Cwe": "CWE-284, CWE-662, CWE-820",
              "Href": "https://bdu.fstec.ru/vul/2023-03204",
              "Impact": "High",
              "Public": "20230518",
              "CveID": "BDU:2023-03204"
            },
            {
              "Cvss": "AV:N/AC:L/Au:S/C:P/I:N/A:N",
              "Cvss3": "AV:N/AC:L/PR:L/UI:R/S:C/C:L/I:N/A:N",
              "Cwe": "CWE-284",
              "Href": "https://bdu.fstec.ru/vul/2023-03205",
              "Impact": "Low",
              "Public": "20230419",
              "CveID": "BDU:2023-03205"
            },
            {
              "Cvss": "AV:N/AC:L/Au:N/C:C/I:C/A:P",
              "Cvss3": "AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:L",
              "Cwe": "CWE-290",
              "Href": "https://bdu.fstec.ru/vul/2023-03343",
              "Impact": "Critical",
              "Public": "20230622",
              "CveID": "BDU:2023-03343"
            }
          ],
          "Cves": [
            {
              "Cvss3": "CVSS:3.1/AV:N/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H",
              "Cwe": "NVD-CWE-Other",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2022-23498",
              "Impact": "High",
              "Public": "20230203",
              "CveID": "CVE-2022-23498"
            },
            {
              "Cvss3": "CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H",
              "Cwe": "NVD-CWE-noinfo",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2022-27664",
              "Impact": "High",
              "Public": "20220906",
              "CveID": "CVE-2022-27664"
            },
            {
              "Cvss": "AV:N/AC:M/Au:S/C:P/I:P/A:N",
              "Cvss3": "CVSS:3.1/AV:N/AC:L/PR:L/UI:N/S:C/C:H/I:L/A:N",
              "Cwe": "CWE-601",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2022-29170",
              "Impact": "High",
              "Public": "20220520",
              "CveID": "CVE-2022-29170"
            },
            {
              "Cvss3": "CVSS:3.1/AV:N/AC:L/PR:L/UI:R/S:C/C:H/I:H/A:N",
              "Cwe": "CWE-79",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2022-31097",
              "Impact": "High",
              "Public": "20220715",
              "CveID": "CVE-2022-31097"
            },
            {
              "Cvss3": "CVSS:3.1/AV:N/AC:H/PR:L/UI:N/S:U/C:H/I:H/A:H",
              "Cwe": "CWE-863",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2022-31107",
              "Impact": "High",
              "Public": "20220715",
              "CveID": "CVE-2022-31107"
            },
            {
              "Cvss3": "CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H",
              "Cwe": "CWE-772",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2022-32149",
              "Impact": "High",
              "Public": "20221014",
              "CveID": "CVE-2022-32149"
            },
            {
              "Cvss3": "CVSS:3.1/AV:N/AC:H/PR:H/UI:N/S:U/C:H/I:H/A:H",
              "Cwe": "CWE-290",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2022-35957",
              "Impact": "Low",
              "Public": "20220920",
              "CveID": "CVE-2022-35957"
            },
            {
              "Cvss3": "CVSS:3.1/AV:N/AC:L/PR:H/UI:N/S:U/C:L/I:L/A:N",
              "Cwe": "CWE-281",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2022-36062",
              "Impact": "Low",
              "Public": "20220922",
              "CveID": "CVE-2022-36062"
            },
            {
              "Cvss3": "CVSS:3.1/AV:N/AC:L/PR:L/UI:R/S:C/C:L/I:L/A:N",
              "Cwe": "CWE-79",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2023-0507",
              "Impact": "Low",
              "Public": "20230301",
              "CveID": "CVE-2023-0507"
            },
            {
              "Cvss3": "CVSS:3.1/AV:N/AC:L/PR:L/UI:R/S:C/C:L/I:L/A:N",
              "Cwe": "CWE-79",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2023-0594",
              "Impact": "Low",
              "Public": "20230301",
              "CveID": "CVE-2023-0594"
            },
            {
              "Cvss3": "CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:N/A:N",
              "Cwe": "NVD-CWE-noinfo",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2023-1387",
              "Impact": "High",
              "Public": "20230426",
              "CveID": "CVE-2023-1387"
            },
            {
              "Cvss3": "CVSS:3.1/AV:N/AC:L/PR:H/UI:R/S:C/C:L/I:L/A:N",
              "Cwe": "CWE-79",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2023-1410",
              "Impact": "Low",
              "Public": "20230323",
              "CveID": "CVE-2023-1410"
            },
            {
              "Cvss3": "CVSS:3.1/AV:N/AC:L/PR:L/UI:N/S:C/C:L/I:L/A:N",
              "Cwe": "CWE-862",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2023-2183",
              "Impact": "Low",
              "Public": "20230606",
              "CveID": "CVE-2023-2183"
            },
            {
              "Cvss3": "CVSS:3.1/AV:N/AC:L/PR:L/UI:R/S:C/C:L/I:L/A:N",
              "Cwe": "CWE-79",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2023-22462",
              "Impact": "Low",
              "Public": "20230302",
              "CveID": "CVE-2023-22462"
            },
            {
              "Cvss3": "CVSS:3.1/AV:N/AC:H/PR:L/UI:N/S:U/C:N/I:N/A:H",
              "Cwe": "CWE-662",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2023-2801",
              "Impact": "Low",
              "Public": "20230606",
              "CveID": "CVE-2023-2801"
            },
            {
              "Cvss3": "CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H",
              "Cwe": "CWE-770",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2023-28119",
              "Impact": "High",
              "Public": "20230322",
              "CveID": "CVE-2023-28119"
            },
            {
              "Cvss3": "CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H",
              "Cwe": "CWE-290",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2023-3128",
              "Impact": "Critical",
              "Public": "20230622",
              "CveID": "CVE-2023-3128"
            }
          ],
          "AffectedCpeList": {
            "Cpe": [
              "cpe:/o:alt:kworkstation:10",
              "cpe:/o:alt:workstation:10",
              "cpe:/o:alt:server:10",
              "cpe:/o:alt:server-v:10",
              "cpe:/o:alt:education:10",
              "cpe:/o:alt:slinux:10",
              "cpe:/o:alt:starterkit:p10",
              "cpe:/o:alt:kworkstation:10.1",
              "cpe:/o:alt:workstation:10.1",
              "cpe:/o:alt:server:10.1",
              "cpe:/o:alt:server-v:10.1",
              "cpe:/o:alt:education:10.1",
              "cpe:/o:alt:slinux:10.1",
              "cpe:/o:alt:starterkit:10.1",
              "cpe:/o:alt:kworkstation:10.2",
              "cpe:/o:alt:workstation:10.2",
              "cpe:/o:alt:server:10.2",
              "cpe:/o:alt:server-v:10.2",
              "cpe:/o:alt:education:10.2",
              "cpe:/o:alt:slinux:10.2",
              "cpe:/o:alt:starterkit:10.2"
            ]
          }
        }
      },
      "Criteria": {
        "Operator": "AND",
        "Criterions": [
          {
            "TestRef": "oval:org.altlinux.errata:tst:2001",
            "Comment": "ALT Linux must be installed"
          }
        ],
        "Criterias": [
          {
            "Operator": "OR",
            "Criterions": [
              {
                "TestRef": "oval:org.altlinux.errata:tst:20234133001",
                "Comment": "grafana is earlier than 0:9.5.5-alt1"
              }
            ]
          }
        ]
      }
    }
  ]
}