{
  "Definition": [
    {
      "ID": "oval:org.altlinux.errata:def:20223046",
      "Version": "oval:org.altlinux.errata:def:20223046",
      "Class": "patch",
      "Metadata": {
        "Title": "ALT-PU-2022-3046: package `thunderbird` update to version 102.4.0-alt1",
        "AffectedList": [
          {
            "Family": "unix",
            "Platforms": [
              "ALT Linux branch p10"
            ],
            "Products": [
              "ALT Server",
              "ALT Virtualization Server",
              "ALT Workstation",
              "ALT Workstation K",
              "ALT Education",
              "Simply Linux",
              "Starterkit"
            ]
          }
        ],
        "References": [
          {
            "RefID": "ALT-PU-2022-3046",
            "RefURL": "https://errata.altlinux.org/ALT-PU-2022-3046",
            "Source": "ALTPU"
          },
          {
            "RefID": "BDU:2022-06028",
            "RefURL": "https://bdu.fstec.ru/vul/2022-06028",
            "Source": "BDU"
          },
          {
            "RefID": "BDU:2022-06049",
            "RefURL": "https://bdu.fstec.ru/vul/2022-06049",
            "Source": "BDU"
          },
          {
            "RefID": "BDU:2022-06198",
            "RefURL": "https://bdu.fstec.ru/vul/2022-06198",
            "Source": "BDU"
          },
          {
            "RefID": "BDU:2022-06205",
            "RefURL": "https://bdu.fstec.ru/vul/2022-06205",
            "Source": "BDU"
          },
          {
            "RefID": "BDU:2022-06240",
            "RefURL": "https://bdu.fstec.ru/vul/2022-06240",
            "Source": "BDU"
          },
          {
            "RefID": "BDU:2022-06252",
            "RefURL": "https://bdu.fstec.ru/vul/2022-06252",
            "Source": "BDU"
          },
          {
            "RefID": "BDU:2022-06253",
            "RefURL": "https://bdu.fstec.ru/vul/2022-06253",
            "Source": "BDU"
          },
          {
            "RefID": "BDU:2022-06516",
            "RefURL": "https://bdu.fstec.ru/vul/2022-06516",
            "Source": "BDU"
          },
          {
            "RefID": "BDU:2022-06517",
            "RefURL": "https://bdu.fstec.ru/vul/2022-06517",
            "Source": "BDU"
          },
          {
            "RefID": "BDU:2022-06518",
            "RefURL": "https://bdu.fstec.ru/vul/2022-06518",
            "Source": "BDU"
          },
          {
            "RefID": "BDU:2022-07019",
            "RefURL": "https://bdu.fstec.ru/vul/2022-07019",
            "Source": "BDU"
          },
          {
            "RefID": "BDU:2023-02783",
            "RefURL": "https://bdu.fstec.ru/vul/2023-02783",
            "Source": "BDU"
          },
          {
            "RefID": "CVE-2022-3155",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2022-3155",
            "Source": "CVE"
          },
          {
            "RefID": "CVE-2022-3266",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2022-3266",
            "Source": "CVE"
          },
          {
            "RefID": "CVE-2022-39236",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2022-39236",
            "Source": "CVE"
          },
          {
            "RefID": "CVE-2022-39249",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2022-39249",
            "Source": "CVE"
          },
          {
            "RefID": "CVE-2022-39250",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2022-39250",
            "Source": "CVE"
          },
          {
            "RefID": "CVE-2022-39251",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2022-39251",
            "Source": "CVE"
          },
          {
            "RefID": "CVE-2022-40956",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2022-40956",
            "Source": "CVE"
          },
          {
            "RefID": "CVE-2022-40957",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2022-40957",
            "Source": "CVE"
          },
          {
            "RefID": "CVE-2022-40958",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2022-40958",
            "Source": "CVE"
          },
          {
            "RefID": "CVE-2022-40959",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2022-40959",
            "Source": "CVE"
          },
          {
            "RefID": "CVE-2022-40960",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2022-40960",
            "Source": "CVE"
          },
          {
            "RefID": "CVE-2022-40962",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2022-40962",
            "Source": "CVE"
          },
          {
            "RefID": "CVE-2022-42927",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2022-42927",
            "Source": "CVE"
          },
          {
            "RefID": "CVE-2022-42928",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2022-42928",
            "Source": "CVE"
          },
          {
            "RefID": "CVE-2022-42929",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2022-42929",
            "Source": "CVE"
          },
          {
            "RefID": "CVE-2022-42932",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2022-42932",
            "Source": "CVE"
          }
        ],
        "Description": "This update upgrades thunderbird to version 102.4.0-alt1. \nSecurity Fix(es):\n\n * BDU:2022-06028: Уязвимость почтового клиента Thunderbird, связанная с некорректными действиями, выполняемыми пользовательским интерфейсом, позволяющая нарушителю выполнить произвольный код\n\n * BDU:2022-06049: Уязвимость браузеров Mozilla Firefox, Mozilla Firefox ESR и почтового клиента Thunderbird, связанная с копированием буфера без проверки размера входных данных, позволяющая нарушителю выполнить произвольный код\n\n * BDU:2022-06198: Уязвимость реализации конфигурации CSP: base-uri браузеров Firefox, Firefox ESR и почтового клиента Thunderbird, позволяющая нарушителю обойти ограничения безопасности\n\n * BDU:2022-06205: Уязвимость реализации технологии WASM браузеров Firefox, Firefox ESR и почтового клиента Thunderbird, позволяющая нарушителю вызвать отказ в обслуживании\n\n * BDU:2022-06240: Уязвимость браузеров Firefox, Firefox ESR и почтового клиента Thunderbird, позволяющая нарушителю обойти ограничение безопасного контекста для файлов cookie с префиксом __Host и __Secure и перезаписать эти файлы\n\n * BDU:2022-06252: Уязвимость браузеров Firefox, Firefox ESR и почтового клиента Thunderbird, связанная с использованием памяти после ее освобождения, позволяющая нарушителю выполнить произвольный код или вызвать отказ в обслуживании\n\n * BDU:2022-06253: Уязвимость реализации механизма FeaturePolicy браузеров Firefox, Firefox ESR и почтового клиента Thunderbird, позволяющая нарушителю обойти ограничения безопасности\n\n * BDU:2022-06516: Уязвимость функции Window.print() браузеров Mozilla Firefox, Firefox ESR и почтового клиента Thunderbird, позволяющая нарушителю вызвать отказ в обслуживании\n\n * BDU:2022-06517: Уязвимость компонента Garbage Collector («Сборщик мусора») обработчика JavaScript-сценариев JS Engine браузеров Mozilla Firefox, Firefox ESR и почтового клиента Thunderbird, позволяющая нарушителю выполнить произвольный код или вызвать отказ в обслуживании\n\n * BDU:2022-06518: Уязвимость метода performance.getEntries() браузеров Mozilla Firefox, Firefox ESR и почтового клиента Thunderbird, позволяющая нарушителю обойти ограничения безопасности и получить несанкционированный доступ к защищаемой информации\n\n * BDU:2022-07019: Уязвимость браузеров Firefox, Firefox ESR и почтового клиента Thunderbird, связанная с выходом операции за границы буфера в памяти, позволяющая нарушителю выполнить произвольный код\n\n * BDU:2023-02783: Уязвимость браузеров Mozilla Firefox, Mozilla Firefox ESR и почтового клиента Thunderbird, связанная с выходом операции за границы буфера в памяти в процессе некорректного программного рендеринга видео с кодировкой H.264, позволяющая нарушителю выполнить атаку типа «отказ в обслуживании» (DoS)\n\n * CVE-2022-3155: When saving or opening an email attachment on macOS, Thunderbird did not set attribute com.apple.quarantine on the received file. If the received file was an application and the user attempted to open it, then the application was started immediately without asking the user to confirm. This vulnerability affects Thunderbird \u003c 102.3.\n\n * CVE-2022-3266: An out-of-bounds read can occur when decoding H264 video. This results in a potentially exploitable crash. This vulnerability affects Firefox ESR \u003c 102.3, Thunderbird \u003c 102.3, and Firefox \u003c 105.\n\n * CVE-2022-39236: Matrix Javascript SDK is the Matrix Client-Server SDK for JavaScript. Starting with version 17.1.0-rc.1, improperly formed beacon events can disrupt or impede the matrix-js-sdk from functioning properly, potentially impacting the consumer's ability to process data safely. Note that the matrix-js-sdk can appear to be operating normally but be excluding or corrupting runtime data presented to the consumer. This is patched in matrix-js-sdk v19.7.0. Redacting applicable events, waiting for the sync processor to store data, and restarting the client are possible workarounds. Alternatively, redacting the applicable events and clearing all storage will fix the further perceived issues. Downgrading to an unaffected version, noting that such a version may be subject to other vulnerabilities, will additionally resolve the issue.\n\n * CVE-2022-39249: Matrix Javascript SDK is the Matrix Client-Server SDK for JavaScript. Prior to version 19.7.0, an attacker cooperating with a malicious homeserver can construct messages appearing to have come from another person. Such messages will be marked with a grey shield on some platforms, but this may be missing in others. This attack is possible due to the matrix-js-sdk implementing a too permissive key forwarding strategy on the receiving end. Starting with version 19.7.0, the default policy for accepting key forwards has been made more strict in the matrix-js-sdk. matrix-js-sdk will now only accept forwarded keys in response to previously issued requests and only from own, verified devices. The SDK now sets a `trusted` flag on the decrypted message upon decryption, based on whether the key used to decrypt the message was received from a trusted source. Clients need to ensure that messages decrypted with a key with `trusted = false` are decorated appropriately, for example, by showing a warning for such messages. This attack requires coordination between a malicious homeserver and an attacker, and those who trust your homeservers do not need a workaround.\n\n * CVE-2022-39250: Matrix JavaScript SDK is the Matrix Client-Server software development kit (SDK) for JavaScript. Prior to version 19.7.0, an attacker cooperating with a malicious homeserver could interfere with the verification flow between two users, injecting its own cross-signing user identity in place of one of the users’ identities. This would lead to the other device trusting/verifying the user identity under the control of the homeserver instead of the intended one. The vulnerability is a bug in the matrix-js-sdk, caused by checking and signing user identities and devices in two separate steps, and inadequately fixing the keys to be signed between those steps. Even though the attack is partly made possible due to the design decision of treating cross-signing user identities as Matrix devices on the server side (with their device ID set to the public part of the user identity key), no other examined implementations were vulnerable. Starting with version 19.7.0, the matrix-js-sdk has been modified to double check that the key signed is the one that was verified instead of just referencing the key by ID. An additional check has been made to report an error when one of the device ID matches a cross-signing key. As this attack requires coordination between a malicious homeserver and an attacker, those who trust their homeservers do not need a particular workaround.\n\n * CVE-2022-39251: Matrix Javascript SDK is the Matrix Client-Server SDK for JavaScript. Prior to version 19.7.0, an attacker cooperating with a malicious homeserver can construct messages that legitimately appear to have come from another person, without any indication such as a grey shield. Additionally, a sophisticated attacker cooperating with a malicious homeserver could employ this vulnerability to perform a targeted attack in order to send fake to-device messages appearing to originate from another user. This can allow, for example, to inject the key backup secret during a self-verification, to make a targeted device start using a malicious key backup spoofed by the homeserver. These attacks are possible due to a protocol confusion vulnerability that accepts to-device messages encrypted with Megolm instead of Olm. Starting with version 19.7.0, matrix-js-sdk has been modified to only accept Olm-encrypted to-device messages. Out of caution, several other checks have been audited or added. This attack requires coordination between a malicious home server and an attacker, so those who trust their home servers do not need a workaround.\n\n * CVE-2022-40956: When injecting an HTML base element, some requests would ignore the CSP's base-uri settings and accept the injected element's base instead. This vulnerability affects Firefox ESR \u003c 102.3, Thunderbird \u003c 102.3, and Firefox \u003c 105.\n\n * CVE-2022-40957: Inconsistent data in instruction and data cache when creating wasm code could lead to a potentially exploitable crash.\u003cbr\u003e*This bug only affects Firefox on ARM64 platforms.*. This vulnerability affects Firefox ESR \u003c 102.3, Thunderbird \u003c 102.3, and Firefox \u003c 105.\n\n * CVE-2022-40958: By injecting a cookie with certain special characters, an attacker on a shared subdomain which is not a secure context could set and thus overwrite cookies from a secure context, leading to session fixation and other attacks. This vulnerability affects Firefox ESR \u003c 102.3, Thunderbird \u003c 102.3, and Firefox \u003c 105.\n\n * CVE-2022-40959: During iframe navigation, certain pages did not have their FeaturePolicy fully initialized leading to a bypass that leaked device permissions into untrusted subdocuments. This vulnerability affects Firefox ESR \u003c 102.3, Thunderbird \u003c 102.3, and Firefox \u003c 105.\n\n * CVE-2022-40960: Concurrent use of the URL parser with non-UTF-8 data was not thread-safe. This could lead to a use-after-free causing a potentially exploitable crash. This vulnerability affects Firefox ESR \u003c 102.3, Thunderbird \u003c 102.3, and Firefox \u003c 105.\n\n * CVE-2022-40962: Mozilla developers Nika Layzell, Timothy Nikkel, Sebastian Hengst, Andreas Pehrson, and the Mozilla Fuzzing Team reported memory safety bugs present in Firefox 104 and Firefox ESR 102.2. Some of these bugs showed evidence of memory corruption and we presume that with enough effort some of these could have been exploited to run arbitrary code. This vulnerability affects Firefox ESR \u003c 102.3, Thunderbird \u003c 102.3, and Firefox \u003c 105.\n\n * CVE-2022-42927: A same-origin policy violation could have allowed the theft of cross-origin URL entries, leaking the result of a redirect, via \u003ccode\u003eperformance.getEntries()\u003c/code\u003e. This vulnerability affects Thunderbird \u003c 102.4, Firefox ESR \u003c 102.4, and Firefox \u003c 106.\n\n * CVE-2022-42928: Certain types of allocations were missing annotations that, if the Garbage Collector was in a specific state, could have lead to memory corruption and a potentially exploitable crash. This vulnerability affects Thunderbird \u003c 102.4, Firefox ESR \u003c 102.4, and Firefox \u003c 106.\n\n * CVE-2022-42929: If a website called \u003ccode\u003ewindow.print()\u003c/code\u003e in a particular way, it could cause a denial of service of the browser, which may persist beyond browser restart depending on the user's session restore settings. This vulnerability affects Thunderbird \u003c 102.4, Firefox ESR \u003c 102.4, and Firefox \u003c 106.\n\n * CVE-2022-42932: Mozilla developers Ashley Hale and the Mozilla Fuzzing Team reported memory safety bugs present in Thunderbird 102.3. Some of these bugs showed evidence of memory corruption and we presume that with enough effort some of these could have been exploited to run arbitrary code. This vulnerability affects Thunderbird \u003c 102.4, Firefox ESR \u003c 102.4, and Firefox \u003c 106.",
        "Advisory": {
          "From": "errata.altlinux.org",
          "Severity": "Critical",
          "Rights": "Copyright 2023 BaseALT Ltd.",
          "Issued": {
            "Date": "2022-11-10"
          },
          "Updated": {
            "Date": "2022-11-10"
          },
          "bdu": [
            {
              "Cvss": "AV:N/AC:L/Au:N/C:C/I:C/A:C",
              "Cvss3": "AV:N/AC:L/PR:N/UI:R/S:C/C:H/I:H/A:H",
              "Cwe": "CWE-254, CWE-449",
              "Href": "https://bdu.fstec.ru/vul/2022-06028",
              "Impact": "Critical",
              "Public": "20220920",
              "CveID": "BDU:2022-06028"
            },
            {
              "Cvss": "AV:N/AC:H/Au:N/C:C/I:C/A:C",
              "Cvss3": "AV:N/AC:H/PR:N/UI:R/S:U/C:H/I:H/A:H",
              "Cwe": "CWE-119, CWE-120",
              "Href": "https://bdu.fstec.ru/vul/2022-06049",
              "Impact": "High",
              "Public": "20220920",
              "CveID": "BDU:2022-06049"
            },
            {
              "Cvss": "AV:N/AC:L/Au:N/C:P/I:P/A:N",
              "Cvss3": "AV:N/AC:L/PR:N/UI:R/S:C/C:L/I:L/A:N",
              "Cwe": "CWE-254, CWE-1021",
              "Href": "https://bdu.fstec.ru/vul/2022-06198",
              "Impact": "Low",
              "Public": "20220920",
              "CveID": "BDU:2022-06198"
            },
            {
              "Cvss": "AV:N/AC:L/Au:N/C:N/I:N/A:P",
              "Cvss3": "AV:N/AC:L/PR:N/UI:N/S:C/C:N/I:N/A:L",
              "Cwe": "CWE-20, CWE-240",
              "Href": "https://bdu.fstec.ru/vul/2022-06205",
              "Impact": "Low",
              "Public": "20220920",
              "CveID": "BDU:2022-06205"
            },
            {
              "Cvss": "AV:N/AC:L/Au:N/C:P/I:P/A:N",
              "Cvss3": "AV:N/AC:L/PR:N/UI:R/S:C/C:L/I:L/A:N",
              "Cwe": "CWE-254, CWE-784",
              "Href": "https://bdu.fstec.ru/vul/2022-06240",
              "Impact": "Low",
              "Public": "20220920",
              "CveID": "BDU:2022-06240"
            },
            {
              "Cvss": "AV:N/AC:H/Au:N/C:C/I:C/A:C",
              "Cvss3": "AV:N/AC:H/PR:N/UI:R/S:U/C:H/I:H/A:H",
              "Cwe": "CWE-416",
              "Href": "https://bdu.fstec.ru/vul/2022-06252",
              "Impact": "High",
              "Public": "20220920",
              "CveID": "BDU:2022-06252"
            },
            {
              "Cvss": "AV:N/AC:H/Au:N/C:C/I:C/A:C",
              "Cvss3": "AV:N/AC:H/PR:N/UI:R/S:U/C:H/I:H/A:H",
              "Cwe": "CWE-254, CWE-1021",
              "Href": "https://bdu.fstec.ru/vul/2022-06253",
              "Impact": "High",
              "Public": "20220920",
              "CveID": "BDU:2022-06253"
            },
            {
              "Cvss": "AV:N/AC:L/Au:N/C:P/I:P/A:C",
              "Cvss3": "AV:N/AC:L/PR:N/UI:R/S:C/C:L/I:L/A:H",
              "Cwe": "CWE-399, CWE-400",
              "Href": "https://bdu.fstec.ru/vul/2022-06516",
              "Impact": "High",
              "Public": "20221018",
              "CveID": "BDU:2022-06516"
            },
            {
              "Cvss": "AV:N/AC:H/Au:N/C:C/I:C/A:C",
              "Cvss3": "AV:N/AC:H/PR:N/UI:R/S:U/C:H/I:H/A:H",
              "Cwe": "CWE-119, CWE-120",
              "Href": "https://bdu.fstec.ru/vul/2022-06517",
              "Impact": "High",
              "Public": "20221018",
              "CveID": "BDU:2022-06517"
            },
            {
              "Cvss": "AV:N/AC:H/Au:N/C:C/I:C/A:C",
              "Cvss3": "AV:N/AC:H/PR:N/UI:R/S:U/C:H/I:H/A:H",
              "Cwe": "CWE-254, CWE-829",
              "Href": "https://bdu.fstec.ru/vul/2022-06518",
              "Impact": "High",
              "Public": "20221018",
              "CveID": "BDU:2022-06518"
            },
            {
              "Cvss": "AV:N/AC:L/Au:N/C:P/I:P/A:N",
              "Cvss3": "AV:N/AC:L/PR:N/UI:R/S:C/C:L/I:L/A:N",
              "Cwe": "CWE-119, CWE-120",
              "Href": "https://bdu.fstec.ru/vul/2022-07019",
              "Impact": "Low",
              "Public": "20221018",
              "CveID": "BDU:2022-07019"
            },
            {
              "Cvss": "AV:L/AC:L/Au:N/C:N/I:N/A:C",
              "Cvss3": "AV:L/AC:L/PR:N/UI:R/S:U/C:N/I:N/A:H",
              "Cwe": "CWE-125",
              "Href": "https://bdu.fstec.ru/vul/2023-02783",
              "Impact": "Low",
              "Public": "20221222",
              "CveID": "BDU:2023-02783"
            }
          ],
          "Cves": [
            {
              "Cvss3": "CVSS:3.1/AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H",
              "Cwe": "NVD-CWE-noinfo",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2022-3155",
              "Impact": "High",
              "Public": "20221222",
              "CveID": "CVE-2022-3155"
            },
            {
              "Cvss3": "CVSS:3.1/AV:L/AC:L/PR:N/UI:R/S:U/C:N/I:N/A:H",
              "Cwe": "CWE-125",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2022-3266",
              "Impact": "Low",
              "Public": "20221222",
              "CveID": "CVE-2022-3266"
            },
            {
              "Cvss3": "CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:L",
              "Cwe": "NVD-CWE-noinfo",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2022-39236",
              "Impact": "Low",
              "Public": "20220928",
              "CveID": "CVE-2022-39236"
            },
            {
              "Cvss3": "CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:H/A:N",
              "Cwe": "CWE-287",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2022-39249",
              "Impact": "High",
              "Public": "20220928",
              "CveID": "CVE-2022-39249"
            },
            {
              "Cvss3": "CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:H/A:N",
              "Cwe": "CWE-287",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2022-39250",
              "Impact": "High",
              "Public": "20220929",
              "CveID": "CVE-2022-39250"
            },
            {
              "Cvss3": "CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:H/A:N",
              "Cwe": "CWE-287",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2022-39251",
              "Impact": "High",
              "Public": "20220928",
              "CveID": "CVE-2022-39251"
            },
            {
              "Cvss3": "CVSS:3.1/AV:N/AC:L/PR:N/UI:R/S:C/C:L/I:L/A:N",
              "Cwe": "CWE-79",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2022-40956",
              "Impact": "Low",
              "Public": "20221222",
              "CveID": "CVE-2022-40956"
            },
            {
              "Cvss3": "CVSS:3.1/AV:N/AC:L/PR:N/UI:R/S:U/C:N/I:N/A:H",
              "Cwe": "NVD-CWE-noinfo",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2022-40957",
              "Impact": "Low",
              "Public": "20221222",
              "CveID": "CVE-2022-40957"
            },
            {
              "Cvss3": "CVSS:3.1/AV:N/AC:L/PR:N/UI:R/S:U/C:N/I:H/A:N",
              "Cwe": "CWE-74",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2022-40958",
              "Impact": "Low",
              "Public": "20221222",
              "CveID": "CVE-2022-40958"
            },
            {
              "Cvss3": "CVSS:3.1/AV:N/AC:L/PR:N/UI:R/S:U/C:H/I:N/A:N",
              "Cwe": "CWE-922",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2022-40959",
              "Impact": "Low",
              "Public": "20221222",
              "CveID": "CVE-2022-40959"
            },
            {
              "Cvss3": "CVSS:3.1/AV:N/AC:L/PR:N/UI:R/S:U/C:N/I:N/A:H",
              "Cwe": "CWE-416",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2022-40960",
              "Impact": "Low",
              "Public": "20221222",
              "CveID": "CVE-2022-40960"
            },
            {
              "Cvss3": "CVSS:3.1/AV:N/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H",
              "Cwe": "CWE-787",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2022-40962",
              "Impact": "High",
              "Public": "20221222",
              "CveID": "CVE-2022-40962"
            },
            {
              "Cvss3": "CVSS:3.1/AV:N/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:N",
              "Cwe": "CWE-346",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2022-42927",
              "Impact": "High",
              "Public": "20221222",
              "CveID": "CVE-2022-42927"
            },
            {
              "Cvss3": "CVSS:3.1/AV:N/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H",
              "Cwe": "CWE-476",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2022-42928",
              "Impact": "High",
              "Public": "20221222",
              "CveID": "CVE-2022-42928"
            },
            {
              "Cvss3": "CVSS:3.1/AV:N/AC:L/PR:N/UI:R/S:U/C:N/I:N/A:H",
              "Cwe": "NVD-CWE-noinfo",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2022-42929",
              "Impact": "Low",
              "Public": "20221222",
              "CveID": "CVE-2022-42929"
            },
            {
              "Cvss3": "CVSS:3.1/AV:N/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H",
              "Cwe": "CWE-787",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2022-42932",
              "Impact": "High",
              "Public": "20221222",
              "CveID": "CVE-2022-42932"
            }
          ],
          "AffectedCpeList": {
            "Cpe": [
              "cpe:/o:alt:kworkstation:10",
              "cpe:/o:alt:workstation:10",
              "cpe:/o:alt:server:10",
              "cpe:/o:alt:server-v:10",
              "cpe:/o:alt:education:10",
              "cpe:/o:alt:slinux:10",
              "cpe:/o:alt:starterkit:p10",
              "cpe:/o:alt:kworkstation:10.1",
              "cpe:/o:alt:workstation:10.1",
              "cpe:/o:alt:server:10.1",
              "cpe:/o:alt:server-v:10.1",
              "cpe:/o:alt:education:10.1",
              "cpe:/o:alt:slinux:10.1",
              "cpe:/o:alt:starterkit:10.1",
              "cpe:/o:alt:kworkstation:10.2",
              "cpe:/o:alt:workstation:10.2",
              "cpe:/o:alt:server:10.2",
              "cpe:/o:alt:server-v:10.2",
              "cpe:/o:alt:education:10.2",
              "cpe:/o:alt:slinux:10.2",
              "cpe:/o:alt:starterkit:10.2"
            ]
          }
        }
      },
      "Criteria": {
        "Operator": "AND",
        "Criterions": [
          {
            "TestRef": "oval:org.altlinux.errata:tst:2001",
            "Comment": "ALT Linux must be installed"
          }
        ],
        "Criterias": [
          {
            "Operator": "OR",
            "Criterions": [
              {
                "TestRef": "oval:org.altlinux.errata:tst:20223046001",
                "Comment": "rpm-build-thunderbird is earlier than 0:102.4.0-alt1"
              },
              {
                "TestRef": "oval:org.altlinux.errata:tst:20223046002",
                "Comment": "thunderbird is earlier than 0:102.4.0-alt1"
              },
              {
                "TestRef": "oval:org.altlinux.errata:tst:20223046003",
                "Comment": "thunderbird-wayland is earlier than 0:102.4.0-alt1"
              }
            ]
          }
        ]
      }
    }
  ]
}