{
  "Definition": [
    {
      "ID": "oval:org.altlinux.errata:def:20231623",
      "Version": "oval:org.altlinux.errata:def:20231623",
      "Class": "patch",
      "Metadata": {
        "Title": "ALT-PU-2023-1623: package `runc` update to version 1.1.5-alt1",
        "AffectedList": [
          {
            "Family": "unix",
            "Platforms": [
              "ALT Linux branch c9f2"
            ],
            "Products": [
              "ALT SPWorkstation",
              "ALT SPServer"
            ]
          }
        ],
        "References": [
          {
            "RefID": "ALT-PU-2023-1623",
            "RefURL": "https://errata.altlinux.org/ALT-PU-2023-1623",
            "Source": "ALTPU"
          },
          {
            "RefID": "BDU:2022-05793",
            "RefURL": "https://bdu.fstec.ru/vul/2022-05793",
            "Source": "BDU"
          },
          {
            "RefID": "BDU:2023-00215",
            "RefURL": "https://bdu.fstec.ru/vul/2023-00215",
            "Source": "BDU"
          },
          {
            "RefID": "BDU:2023-02652",
            "RefURL": "https://bdu.fstec.ru/vul/2023-02652",
            "Source": "BDU"
          },
          {
            "RefID": "CVE-2021-43784",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2021-43784",
            "Source": "CVE"
          },
          {
            "RefID": "CVE-2022-24769",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2022-24769",
            "Source": "CVE"
          },
          {
            "RefID": "CVE-2022-29162",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2022-29162",
            "Source": "CVE"
          },
          {
            "RefID": "CVE-2023-25809",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2023-25809",
            "Source": "CVE"
          },
          {
            "RefID": "CVE-2023-27561",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2023-27561",
            "Source": "CVE"
          },
          {
            "RefID": "CVE-2023-28642",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2023-28642",
            "Source": "CVE"
          }
        ],
        "Description": "This update upgrades runc to version 1.1.5-alt1. \nSecurity Fix(es):\n\n * BDU:2022-05793: Уязвимость команды \u0026#039;runc exec --cap\u0026#039; инструмента для запуска изолированных контейнеров Runc, позволяющая нарушителю получить доступ к конфиденциальным данным, нарушить их целостность, а также вызвать отказ в обслуживании\n\n * BDU:2023-00215: Уязвимость среды выполнения контейнеров Containerd, связанная с неправильным присвоением разрешений для критичного ресурса, позволяющая нарушителю получить доступ к конфиденциальным данным, нарушить их целостность, а также вызвать отказ в обслуживании\n\n * BDU:2023-02652: Уязвимость инструмента для запуска изолированных контейнеров Runc, связанная с целочисленным переполнением, позволяющая нарушителю получить доступ к конфиденциальным данным, нарушить их целостность, а также вызвать отказ в обслуживании\n\n * CVE-2021-43784: runc is a CLI tool for spawning and running containers on Linux according to the OCI specification. In runc, netlink is used internally as a serialization system for specifying the relevant container configuration to the `C` portion of the code (responsible for the based namespace setup of containers). In all versions of runc prior to 1.0.3, the encoder did not handle the possibility of an integer overflow in the 16-bit length field for the byte array attribute type, meaning that a large enough malicious byte array attribute could result in the length overflowing and the attribute contents being parsed as netlink messages for container configuration. This vulnerability requires the attacker to have some control over the configuration of the container and would allow the attacker to bypass the namespace restrictions of the container by simply adding their own netlink payload which disables all namespaces. The main users impacted are those who allow untrusted images with untrusted configurations to run on their machines (such as with shared cloud infrastructure). runc version 1.0.3 contains a fix for this bug. As a workaround, one may try disallowing untrusted namespace paths from your container. It should be noted that untrusted namespace paths would allow the attacker to disable namespace protections entirely even in the absence of this bug.\n\n * CVE-2022-24769: Moby is an open-source project created by Docker to enable and accelerate software containerization. A bug was found in Moby (Docker Engine) prior to version 20.10.14 where containers were incorrectly started with non-empty inheritable Linux process capabilities, creating an atypical Linux environment and enabling programs with inheritable file capabilities to elevate those capabilities to the permitted set during `execve(2)`. Normally, when executable programs have specified permitted file capabilities, otherwise unprivileged users and processes can execute those programs and gain the specified file capabilities up to the bounding set. Due to this bug, containers which included executable programs with inheritable file capabilities allowed otherwise unprivileged users and processes to additionally gain these inheritable file capabilities up to the container's bounding set. Containers which use Linux users and groups to perform privilege separation inside the container are most directly impacted. This bug did not affect the container security sandbox as the inheritable set never contained more capabilities than were included in the container's bounding set. This bug has been fixed in Moby (Docker Engine) 20.10.14. Running containers should be stopped, deleted, and recreated for the inheritable capabilities to be reset. This fix changes Moby (Docker Engine) behavior such that containers are started with a more typical Linux environment. As a workaround, the entry point of a container can be modified to use a utility like `capsh(1)` to drop inheritable capabilities prior to the primary process starting.\n\n * CVE-2022-29162: runc is a CLI tool for spawning and running containers on Linux according to the OCI specification. A bug was found in runc prior to version 1.1.2 where `runc exec --cap` created processes with non-empty inheritable Linux process capabilities, creating an atypical Linux environment and enabling programs with inheritable file capabilities to elevate those capabilities to the permitted set during execve(2). This bug did not affect the container security sandbox as the inheritable set never contained more capabilities than were included in the container's bounding set. This bug has been fixed in runc 1.1.2. This fix changes `runc exec --cap` behavior such that the additional capabilities granted to the process being executed (as specified via `--cap` arguments) do not include inheritable capabilities. In addition, `runc spec` is changed to not set any inheritable capabilities in the created example OCI spec (`config.json`) file.\n\n * CVE-2023-25809: runc is a CLI tool for spawning and running containers according to the OCI specification. In affected versions it was found that rootless runc makes `/sys/fs/cgroup` writable in following conditons: 1. when runc is executed inside the user namespace, and the `config.json` does not specify the cgroup namespace to be unshared (e.g.., `(docker|podman|nerdctl) run --cgroupns=host`, with Rootless Docker/Podman/nerdctl) or 2. when runc is executed outside the user namespace, and `/sys` is mounted with `rbind, ro` (e.g., `runc spec --rootless`; this condition is very rare). A container may gain the write access to user-owned cgroup hierarchy `/sys/fs/cgroup/user.slice/...` on the host . Other users's cgroup hierarchies are not affected. Users are advised to upgrade to version 1.1.5. Users unable to upgrade may unshare the cgroup namespace (`(docker|podman|nerdctl) run --cgroupns=private)`. This is the default behavior of Docker/Podman/nerdctl on cgroup v2 hosts. or add `/sys/fs/cgroup` to `maskedPaths`.\n\n * CVE-2023-27561: runc through 1.1.4 has Incorrect Access Control leading to Escalation of Privileges, related to libcontainer/rootfs_linux.go. To exploit this, an attacker must be able to spawn two containers with custom volume-mount configurations, and be able to run custom images. NOTE: this issue exists because of a CVE-2019-19921 regression.\n\n * CVE-2023-28642: runc is a CLI tool for spawning and running containers according to the OCI specification. It was found that AppArmor can be bypassed when `/proc` inside the container is symlinked with a specific mount configuration. This issue has been fixed in runc version 1.1.5, by prohibiting symlinked `/proc`. See PR #3785 for details. users are advised to upgrade. Users unable to upgrade should avoid using an untrusted container image.",
        "Advisory": {
          "From": "errata.altlinux.org",
          "Severity": "High",
          "Rights": "Copyright 2023 BaseALT Ltd.",
          "Issued": {
            "Date": "2023-04-17"
          },
          "Updated": {
            "Date": "2023-04-17"
          },
          "bdu": [
            {
              "Cvss": "AV:L/AC:L/Au:S/C:C/I:C/A:C",
              "Cvss3": "AV:L/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H",
              "Cwe": "CWE-276",
              "Href": "https://bdu.fstec.ru/vul/2022-05793",
              "Impact": "High",
              "Public": "20220505",
              "CveID": "BDU:2022-05793"
            },
            {
              "Cvss": "AV:L/AC:L/Au:N/C:P/I:P/A:P",
              "Cvss3": "AV:L/AC:L/PR:N/UI:N/S:U/C:L/I:L/A:L",
              "Cwe": "CWE-732",
              "Href": "https://bdu.fstec.ru/vul/2023-00215",
              "Impact": "Low",
              "Public": "20220324",
              "CveID": "BDU:2023-00215"
            },
            {
              "Cvss": "AV:N/AC:M/Au:S/C:P/I:P/A:P",
              "Cvss3": "AV:N/AC:H/PR:L/UI:N/S:U/C:L/I:L/A:L",
              "Cwe": "CWE-190",
              "Href": "https://bdu.fstec.ru/vul/2023-02652",
              "Impact": "Low",
              "Public": "20211109",
              "CveID": "BDU:2023-02652"
            }
          ],
          "Cves": [
            {
              "Cvss": "AV:N/AC:M/Au:S/C:P/I:P/A:P",
              "Cvss3": "CVSS:3.1/AV:N/AC:H/PR:L/UI:N/S:U/C:L/I:L/A:L",
              "Cwe": "CWE-190",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2021-43784",
              "Impact": "Low",
              "Public": "20211206",
              "CveID": "CVE-2021-43784"
            },
            {
              "Cvss": "AV:L/AC:L/Au:N/C:P/I:P/A:P",
              "Cvss3": "CVSS:3.1/AV:L/AC:L/PR:N/UI:N/S:U/C:L/I:L/A:L",
              "Cwe": "CWE-732",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2022-24769",
              "Impact": "Low",
              "Public": "20220324",
              "CveID": "CVE-2022-24769"
            },
            {
              "Cvss": "AV:L/AC:L/Au:N/C:P/I:P/A:P",
              "Cvss3": "CVSS:3.1/AV:L/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H",
              "Cwe": "CWE-276",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2022-29162",
              "Impact": "High",
              "Public": "20220517",
              "CveID": "CVE-2022-29162"
            },
            {
              "Cvss3": "CVSS:3.1/AV:L/AC:L/PR:L/UI:N/S:C/C:L/I:L/A:L",
              "Cwe": "CWE-281",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2023-25809",
              "Impact": "Low",
              "Public": "20230329",
              "CveID": "CVE-2023-25809"
            },
            {
              "Cvss3": "CVSS:3.1/AV:L/AC:H/PR:L/UI:N/S:U/C:H/I:H/A:H",
              "Cwe": "CWE-706",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2023-27561",
              "Impact": "High",
              "Public": "20230303",
              "CveID": "CVE-2023-27561"
            },
            {
              "Cvss3": "CVSS:3.1/AV:L/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H",
              "Cwe": "CWE-59",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2023-28642",
              "Impact": "High",
              "Public": "20230329",
              "CveID": "CVE-2023-28642"
            }
          ],
          "AffectedCpeList": {
            "Cpe": [
              "cpe:/o:alt:spworkstation:8.4",
              "cpe:/o:alt:spserver:8.4"
            ]
          }
        }
      },
      "Criteria": {
        "Operator": "AND",
        "Criterions": [
          {
            "TestRef": "oval:org.altlinux.errata:tst:3001",
            "Comment": "ALT Linux must be installed"
          }
        ],
        "Criterias": [
          {
            "Operator": "OR",
            "Criterions": [
              {
                "TestRef": "oval:org.altlinux.errata:tst:20231623001",
                "Comment": "runc is earlier than 0:1.1.5-alt1"
              }
            ]
          }
        ]
      }
    }
  ]
}