{
  "Definition": [
    {
      "ID": "oval:org.altlinux.errata:def:20213370",
      "Version": "oval:org.altlinux.errata:def:20213370",
      "Class": "patch",
      "Metadata": {
        "Title": "ALT-PU-2021-3370: package `thunderbird` update to version 91.3.0-alt0.c9.1",
        "AffectedList": [
          {
            "Family": "unix",
            "Platforms": [
              "ALT Linux branch c9f2"
            ],
            "Products": [
              "ALT SPWorkstation",
              "ALT SPServer"
            ]
          }
        ],
        "References": [
          {
            "RefID": "ALT-PU-2021-3370",
            "RefURL": "https://errata.altlinux.org/ALT-PU-2021-3370",
            "Source": "ALTPU"
          },
          {
            "RefID": "BDU:2021-05029",
            "RefURL": "https://bdu.fstec.ru/vul/2021-05029",
            "Source": "BDU"
          },
          {
            "RefID": "BDU:2021-05030",
            "RefURL": "https://bdu.fstec.ru/vul/2021-05030",
            "Source": "BDU"
          },
          {
            "RefID": "BDU:2021-05095",
            "RefURL": "https://bdu.fstec.ru/vul/2021-05095",
            "Source": "BDU"
          },
          {
            "RefID": "BDU:2021-05096",
            "RefURL": "https://bdu.fstec.ru/vul/2021-05096",
            "Source": "BDU"
          },
          {
            "RefID": "BDU:2021-05097",
            "RefURL": "https://bdu.fstec.ru/vul/2021-05097",
            "Source": "BDU"
          },
          {
            "RefID": "BDU:2021-05696",
            "RefURL": "https://bdu.fstec.ru/vul/2021-05696",
            "Source": "BDU"
          },
          {
            "RefID": "BDU:2021-05703",
            "RefURL": "https://bdu.fstec.ru/vul/2021-05703",
            "Source": "BDU"
          },
          {
            "RefID": "BDU:2021-05704",
            "RefURL": "https://bdu.fstec.ru/vul/2021-05704",
            "Source": "BDU"
          },
          {
            "RefID": "BDU:2021-05705",
            "RefURL": "https://bdu.fstec.ru/vul/2021-05705",
            "Source": "BDU"
          },
          {
            "RefID": "BDU:2021-05706",
            "RefURL": "https://bdu.fstec.ru/vul/2021-05706",
            "Source": "BDU"
          },
          {
            "RefID": "BDU:2021-05708",
            "RefURL": "https://bdu.fstec.ru/vul/2021-05708",
            "Source": "BDU"
          },
          {
            "RefID": "BDU:2021-06060",
            "RefURL": "https://bdu.fstec.ru/vul/2021-06060",
            "Source": "BDU"
          },
          {
            "RefID": "BDU:2021-06241",
            "RefURL": "https://bdu.fstec.ru/vul/2021-06241",
            "Source": "BDU"
          },
          {
            "RefID": "BDU:2021-06242",
            "RefURL": "https://bdu.fstec.ru/vul/2021-06242",
            "Source": "BDU"
          },
          {
            "RefID": "BDU:2022-01890",
            "RefURL": "https://bdu.fstec.ru/vul/2022-01890",
            "Source": "BDU"
          },
          {
            "RefID": "BDU:2022-01891",
            "RefURL": "https://bdu.fstec.ru/vul/2022-01891",
            "Source": "BDU"
          },
          {
            "RefID": "BDU:2022-05740",
            "RefURL": "https://bdu.fstec.ru/vul/2022-05740",
            "Source": "BDU"
          },
          {
            "RefID": "CVE-2021-29981",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2021-29981",
            "Source": "CVE"
          },
          {
            "RefID": "CVE-2021-29982",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2021-29982",
            "Source": "CVE"
          },
          {
            "RefID": "CVE-2021-29991",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2021-29991",
            "Source": "CVE"
          },
          {
            "RefID": "CVE-2021-32810",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2021-32810",
            "Source": "CVE"
          },
          {
            "RefID": "CVE-2021-38495",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2021-38495",
            "Source": "CVE"
          },
          {
            "RefID": "CVE-2021-38496",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2021-38496",
            "Source": "CVE"
          },
          {
            "RefID": "CVE-2021-38497",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2021-38497",
            "Source": "CVE"
          },
          {
            "RefID": "CVE-2021-38498",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2021-38498",
            "Source": "CVE"
          },
          {
            "RefID": "CVE-2021-38500",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2021-38500",
            "Source": "CVE"
          },
          {
            "RefID": "CVE-2021-38501",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2021-38501",
            "Source": "CVE"
          },
          {
            "RefID": "CVE-2021-38502",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2021-38502",
            "Source": "CVE"
          },
          {
            "RefID": "CVE-2021-38503",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2021-38503",
            "Source": "CVE"
          },
          {
            "RefID": "CVE-2021-38504",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2021-38504",
            "Source": "CVE"
          },
          {
            "RefID": "CVE-2021-38505",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2021-38505",
            "Source": "CVE"
          },
          {
            "RefID": "CVE-2021-38506",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2021-38506",
            "Source": "CVE"
          },
          {
            "RefID": "CVE-2021-38507",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2021-38507",
            "Source": "CVE"
          },
          {
            "RefID": "CVE-2021-38508",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2021-38508",
            "Source": "CVE"
          },
          {
            "RefID": "CVE-2021-38509",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2021-38509",
            "Source": "CVE"
          },
          {
            "RefID": "CVE-2021-38510",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2021-38510",
            "Source": "CVE"
          },
          {
            "RefID": "CVE-2021-43529",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2021-43529",
            "Source": "CVE"
          },
          {
            "RefID": "CVE-2021-43534",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2021-43534",
            "Source": "CVE"
          },
          {
            "RefID": "CVE-2021-43535",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2021-43535",
            "Source": "CVE"
          }
        ],
        "Description": "This update upgrades thunderbird to version 91.3.0-alt0.c9.1. \nSecurity Fix(es):\n\n * BDU:2021-05029: Уязвимость операции MessageTasks браузера Mozilla Firefox, позволяющая нарушителю выполнить произвольный код в системе.\n\n * BDU:2021-05030: Уязвимость браузера Mozilla Firefox, связанная с ошибками при обработке HTML-содержимого, позволяющая нарушителю,  выполнить произвольный код в системе\n\n * BDU:2021-05095: Уязвимость объекта nsLanguageAtomService браузеров Mozilla Firefox, Firefox ESR и почтового клиента Thunderbird, позволяющая нарушителю выполнить произвольный код\n\n * BDU:2021-05096: Уязвимость браузеров Mozilla Firefox, Firefox ESR и почтового клиента Thunderbird, вызванная переполнением буфера, позволяющая нарушителю выполнить произвольный код\n\n * BDU:2021-05097: Уязвимость функций \u0026quot;Stealer::steal\u0026quot;, \u0026quot;Stealer::steal_batch\u0026quot; и \u0026quot;Stealer::steal_batch_and_pop\u0026quot; браузеров Mozilla Firefox, Firefox ESR и почтового клиента Thunderbird, позволяющая нарушителю выполнить произвольный код\n\n * BDU:2021-05696: Уязвимость веб-браузера Firefox и почтового клиента Thunderbird, связанная с использованием памяти после её освобождения, позволяющая нарушителю вызвать отказ в обслуживании\n\n * BDU:2021-05703: Уязвимость браузера Mozilla Firefox, связанная с некорректным ограничением визуализированных слоев пользовательского интерфейса, позволяющая нарушителю проводить атаки с использованием спуфинга\n\n * BDU:2021-05704: Уязвимость браузера Mozilla Firefox, связанная с ошибками в настройках безопасности, позволяющая нарушителю обойти введенные ограничения безопасности\n\n * BDU:2021-05705: Уязвимость браузера Mozilla Firefox, связанная с недостаточным предупреждением об опасных действиях, позволяющая нарушителю провести атаку с использованием спуфинга\n\n * BDU:2021-05706: Уязвимость браузера Mozilla Firefox, связанная с ошибками в настройках безопасности, позволяющая нарушителю обойти существующие ограничения безопасности\n\n * BDU:2021-05708: Уязвимость браузера Mozilla Firefox, связанная с некорректным ограничением визуализированных слоев пользовательского интерфейса, позволяющая нарушителю проводить атаки с использованием спуфинга\n\n * BDU:2021-06060: Уязвимость почтового клиента Thunderbird, браузера Firefox, связанная с недостатками обработки HTTP-запросов, позволяющая нарушителю осуществлять межсайтовые сценарные атаки (XSS)\n\n * BDU:2021-06241: Уязвимость почтового клиента Thunderbird, браузеров Firefox и Firefox ESR, связанная с использованием памяти после её освобождения, позволяющая нарушителю выполнить произвольный код\n\n * BDU:2021-06242: Уязвимость почтового клиента Thunderbird, браузеров Firefox и Firefox ESR, связанная с записью за границы буфера в памяти, позволяющая нарушителю выполнить произвольный код\n\n * BDU:2022-01890: Уязвимость компонента JIT веб-браузера Firefox, почтового клиента Thunderbird, позволяющая нарушителю получить доступ к конфиденциальным данным\n\n * BDU:2022-01891: Уязвимость компонента JIT веб-браузера Firefox, почтового клиента Thunderbird, позволяющая нарушителю получить доступ к конфиденциальным данным, нарушить их целостность, а также вызвать отказ в обслуживании\n\n * BDU:2022-05740: Уязвимость браузеров Mozilla Firefox, Mozilla Firefox ESR и почтового клиента Thunderbird, связанная с выходом операции за границы буфера в памяти, позволяющая нарушителю выполнить произвольный код\n\n * CVE-2021-29981: An issue present in lowering/register allocation could have led to obscure but deterministic register confusion failures in JITted code that would lead to a potentially exploitable crash. This vulnerability affects Firefox \u003c 91 and Thunderbird \u003c 91.\n\n * CVE-2021-29982: Due to incorrect JIT optimization, we incorrectly interpreted data from the wrong type of object, resulting in the potential leak of a single bit of memory. This vulnerability affects Firefox \u003c 91 and Thunderbird \u003c 91.\n\n * CVE-2021-29991: Firefox incorrectly accepted a newline in a HTTP/3 header, interpretting it as two separate headers. This allowed for a header splitting attack against servers using HTTP/3. This vulnerability affects Firefox \u003c 91.0.1 and Thunderbird \u003c 91.0.1.\n\n * CVE-2021-32810: crossbeam-deque is a package of work-stealing deques for building task schedulers when programming in Rust. In versions prior to 0.7.4 and 0.8.0, the result of the race condition is that one or more tasks in the worker queue can be popped twice instead of other tasks that are forgotten and never popped. If tasks are allocated on the heap, this can cause double free and a memory leak. If not, this still can cause a logical bug. Crates using `Stealer::steal`, `Stealer::steal_batch`, or `Stealer::steal_batch_and_pop` are affected by this issue. This has been fixed in crossbeam-deque 0.8.1 and 0.7.4.\n\n * CVE-2021-38495: Mozilla developers reported memory safety bugs present in Thunderbird 78.13.0. Some of these bugs showed evidence of memory corruption and we presume that with enough effort some of these could have been exploited to run arbitrary code. This vulnerability affects Thunderbird \u003c 91.1 and Firefox ESR \u003c 91.1.\n\n * CVE-2021-38496: During operations on MessageTasks, a task may have been removed while it was still scheduled, resulting in memory corruption and a potentially exploitable crash. This vulnerability affects Thunderbird \u003c 78.15, Thunderbird \u003c 91.2, Firefox ESR \u003c 91.2, Firefox ESR \u003c 78.15, and Firefox \u003c 93.\n\n * CVE-2021-38497: Through use of reportValidity() and window.open(), a plain-text validation message could have been overlaid on another origin, leading to possible user confusion and spoofing attacks. This vulnerability affects Firefox \u003c 93, Thunderbird \u003c 91.2, and Firefox ESR \u003c 91.2.\n\n * CVE-2021-38498: During process shutdown, a document could have caused a use-after-free of a languages service object, leading to memory corruption and a potentially exploitable crash. This vulnerability affects Firefox \u003c 93, Thunderbird \u003c 91.2, and Firefox ESR \u003c 91.2.\n\n * CVE-2021-38500: Mozilla developers reported memory safety bugs present in Firefox 92 and Firefox ESR 91.1. Some of these bugs showed evidence of memory corruption and we presume that with enough effort some of these could have been exploited to run arbitrary code. This vulnerability affects Thunderbird \u003c 78.15, Thunderbird \u003c 91.2, Firefox ESR \u003c 91.2, Firefox ESR \u003c 78.15, and Firefox \u003c 93.\n\n * CVE-2021-38501: Mozilla developers reported memory safety bugs present in Firefox 92 and Firefox ESR 91.1. Some of these bugs showed evidence of memory corruption and we presume that with enough effort some of these could have been exploited to run arbitrary code. This vulnerability affects Firefox \u003c 93, Thunderbird \u003c 91.2, and Firefox ESR \u003c 91.2.\n\n * CVE-2021-38502: Thunderbird ignored the configuration to require STARTTLS security for an SMTP connection. A MITM could perform a downgrade attack to intercept transmitted messages, or could take control of the authenticated session to execute SMTP commands chosen by the MITM. If an unprotected authentication method was configured, the MITM could obtain the authentication credentials, too. This vulnerability affects Thunderbird \u003c 91.2.\n\n * CVE-2021-38503: The iframe sandbox rules were not correctly applied to XSLT stylesheets, allowing an iframe to bypass restrictions such as executing scripts or navigating the top-level frame. This vulnerability affects Firefox \u003c 94, Thunderbird \u003c 91.3, and Firefox ESR \u003c 91.3.\n\n * CVE-2021-38504: When interacting with an HTML input element's file picker dialog with webkitdirectory set, a use-after-free could have resulted, leading to memory corruption and a potentially exploitable crash. This vulnerability affects Firefox \u003c 94, Thunderbird \u003c 91.3, and Firefox ESR \u003c 91.3.\n\n * CVE-2021-38505: Microsoft introduced a new feature in Windows 10 known as Cloud Clipboard which, if enabled, will record data copied to the clipboard to the cloud, and make it available on other computers in certain scenarios. Applications that wish to prevent copied data from being recorded in Cloud History must use specific clipboard formats; and Firefox before versions 94 and ESR 91.3 did not implement them. This could have caused sensitive data to be recorded to a user's Microsoft account. *This bug only affects Firefox for Windows 10+ with Cloud Clipboard enabled. Other operating systems are unaffected.*. This vulnerability affects Firefox \u003c 94, Thunderbird \u003c 91.3, and Firefox ESR \u003c 91.3.\n\n * CVE-2021-38506: Through a series of navigations, Firefox could have entered fullscreen mode without notification or warning to the user. This could lead to spoofing attacks on the browser UI including phishing. This vulnerability affects Firefox \u003c 94, Thunderbird \u003c 91.3, and Firefox ESR \u003c 91.3.\n\n * CVE-2021-38507: The Opportunistic Encryption feature of HTTP2 (RFC 8164) allows a connection to be transparently upgraded to TLS while retaining the visual properties of an HTTP connection, including being same-origin with unencrypted connections on port 80. However, if a second encrypted port on the same IP address (e.g. port 8443) did not opt-in to opportunistic encryption; a network attacker could forward a connection from the browser to port 443 to port 8443, causing the browser to treat the content of port 8443 as same-origin with HTTP. This was resolved by disabling the Opportunistic Encryption feature, which had low usage. This vulnerability affects Firefox \u003c 94, Thunderbird \u003c 91.3, and Firefox ESR \u003c 91.3.\n\n * CVE-2021-38508: By displaying a form validity message in the correct location at the same time as a permission prompt (such as for geolocation), the validity message could have obscured the prompt, resulting in the user potentially being tricked into granting the permission. This vulnerability affects Firefox \u003c 94, Thunderbird \u003c 91.3, and Firefox ESR \u003c 91.3.\n\n * CVE-2021-38509: Due to an unusual sequence of attacker-controlled events, a Javascript alert() dialog with arbitrary (although unstyled) contents could be displayed over top an uncontrolled webpage of the attacker's choosing. This vulnerability affects Firefox \u003c 94, Thunderbird \u003c 91.3, and Firefox ESR \u003c 91.3.\n\n * CVE-2021-38510: The executable file warning was not presented when downloading .inetloc files, which, due to a flaw in Mac OS, can run commands on a user's computer.*Note: This issue only affected Mac OS operating systems. Other operating systems are unaffected.*. This vulnerability affects Firefox \u003c 94, Thunderbird \u003c 91.3, and Firefox ESR \u003c 91.3.\n\n * CVE-2021-43529: Thunderbird versions prior to 91.3.0 are vulnerable to the heap overflow described in CVE-2021-43527 when processing S/MIME messages. Thunderbird versions 91.3.0 and later will not call the vulnerable code when processing S/MIME messages that contain certificates with DER-encoded DSA or RSA-PSS signatures.\n\n * CVE-2021-43534: Mozilla developers and community members reported memory safety bugs present in Firefox 93 and Firefox ESR 91.2. Some of these bugs showed evidence of memory corruption and we presume that with enough effort some of these could have been exploited to run arbitrary code. This vulnerability affects Firefox \u003c 94, Thunderbird \u003c 91.3, and Firefox ESR \u003c 91.3.\n\n * CVE-2021-43535: A use-after-free could have occured when an HTTP2 session object was released on a different thread, leading to memory corruption and a potentially exploitable crash. This vulnerability affects Firefox \u003c 93, Thunderbird \u003c 91.3, and Firefox ESR \u003c 91.3.\n\n * #40907: В системе отсутствует пакет libotr5, из-за чего переписка в чате thunderbird выглядит нечитаемо. Нет возможности выставить статус шифрования",
        "Advisory": {
          "From": "errata.altlinux.org",
          "Severity": "Critical",
          "Rights": "Copyright 2023 BaseALT Ltd.",
          "Issued": {
            "Date": "2021-11-26"
          },
          "Updated": {
            "Date": "2021-11-26"
          },
          "bdu": [
            {
              "Cvss": "AV:N/AC:L/Au:N/C:C/I:C/A:C",
              "Cvss3": "AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H",
              "Cwe": "CWE-416",
              "Href": "https://bdu.fstec.ru/vul/2021-05029",
              "Impact": "Critical",
              "Public": "20211005",
              "CveID": "BDU:2021-05029"
            },
            {
              "Cvss": "AV:N/AC:L/Au:N/C:C/I:C/A:C",
              "Cvss3": "AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H",
              "Cwe": "CWE-119",
              "Href": "https://bdu.fstec.ru/vul/2021-05030",
              "Impact": "Critical",
              "Public": "20211005",
              "CveID": "BDU:2021-05030"
            },
            {
              "Cvss": "AV:N/AC:L/Au:N/C:C/I:C/A:C",
              "Cvss3": "AV:N/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H",
              "Cwe": "CWE-416",
              "Href": "https://bdu.fstec.ru/vul/2021-05095",
              "Impact": "High",
              "Public": "20211005",
              "CveID": "BDU:2021-05095"
            },
            {
              "Cvss": "AV:N/AC:L/Au:N/C:C/I:C/A:C",
              "Cvss3": "AV:N/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H",
              "Cwe": "CWE-119",
              "Href": "https://bdu.fstec.ru/vul/2021-05096",
              "Impact": "High",
              "Public": "20211005",
              "CveID": "BDU:2021-05096"
            },
            {
              "Cvss": "AV:N/AC:L/Au:N/C:C/I:C/A:C",
              "Cvss3": "AV:N/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H",
              "Cwe": "CWE-362",
              "Href": "https://bdu.fstec.ru/vul/2021-05097",
              "Impact": "High",
              "Public": "20211005",
              "CveID": "BDU:2021-05097"
            },
            {
              "Cvss": "AV:N/AC:H/Au:N/C:C/I:C/A:C",
              "Cvss3": "AV:N/AC:H/PR:N/UI:R/S:U/C:H/I:H/A:H",
              "Cwe": "CWE-416",
              "Href": "https://bdu.fstec.ru/vul/2021-05696",
              "Impact": "High",
              "Public": "20211102",
              "CveID": "BDU:2021-05696"
            },
            {
              "Cvss": "AV:N/AC:H/Au:N/C:P/I:P/A:N",
              "Cvss3": "AV:N/AC:H/PR:N/UI:R/S:U/C:L/I:L/A:N",
              "Cwe": "CWE-1021",
              "Href": "https://bdu.fstec.ru/vul/2021-05703",
              "Impact": "Low",
              "Public": "20211102",
              "CveID": "BDU:2021-05703"
            },
            {
              "Cvss": "AV:N/AC:H/Au:N/C:P/I:P/A:N",
              "Cvss3": "AV:N/AC:H/PR:N/UI:R/S:U/C:L/I:L/A:N",
              "Cwe": "CWE-254",
              "Href": "https://bdu.fstec.ru/vul/2021-05704",
              "Impact": "Low",
              "Public": "20211102",
              "CveID": "BDU:2021-05704"
            },
            {
              "Cvss": "AV:N/AC:L/Au:N/C:P/I:P/A:N",
              "Cvss3": "AV:N/AC:L/PR:N/UI:R/S:U/C:L/I:L/A:N",
              "Cwe": "CWE-357",
              "Href": "https://bdu.fstec.ru/vul/2021-05705",
              "Impact": "Low",
              "Public": "20211102",
              "CveID": "BDU:2021-05705"
            },
            {
              "Cvss": "AV:N/AC:L/Au:N/C:C/I:C/A:N",
              "Cvss3": "AV:N/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:N",
              "Cwe": "CWE-254",
              "Href": "https://bdu.fstec.ru/vul/2021-05706",
              "Impact": "High",
              "Public": "20211102",
              "CveID": "BDU:2021-05706"
            },
            {
              "Cvss": "AV:N/AC:L/Au:N/C:N/I:P/A:N",
              "Cvss3": "AV:N/AC:L/PR:N/UI:R/S:U/C:N/I:L/A:N",
              "Cwe": "CWE-1021",
              "Href": "https://bdu.fstec.ru/vul/2021-05708",
              "Impact": "Low",
              "Public": "20211102",
              "CveID": "BDU:2021-05708"
            },
            {
              "Cvss": "AV:N/AC:M/Au:N/C:P/I:P/A:N",
              "Cvss3": "AV:N/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:N",
              "Cwe": "CWE-444",
              "Href": "https://bdu.fstec.ru/vul/2021-06060",
              "Impact": "High",
              "Public": "20211103",
              "CveID": "BDU:2021-06060"
            },
            {
              "Cvss": "AV:N/AC:M/Au:N/C:C/I:C/A:C",
              "Cvss3": "AV:N/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H",
              "Cwe": "CWE-416",
              "Href": "https://bdu.fstec.ru/vul/2021-06241",
              "Impact": "High",
              "Public": "20211102",
              "CveID": "BDU:2021-06241"
            },
            {
              "Cvss": "AV:N/AC:M/Au:N/C:C/I:C/A:C",
              "Cvss3": "AV:N/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H",
              "Cwe": "CWE-787",
              "Href": "https://bdu.fstec.ru/vul/2021-06242",
              "Impact": "High",
              "Public": "20211102",
              "CveID": "BDU:2021-06242"
            },
            {
              "Cvss": "AV:N/AC:M/Au:N/C:C/I:N/A:N",
              "Cvss3": "AV:N/AC:L/PR:N/UI:R/S:U/C:H/I:N/A:N",
              "Cwe": "CWE-772",
              "Href": "https://bdu.fstec.ru/vul/2022-01890",
              "Impact": "Low",
              "Public": "20210817",
              "CveID": "BDU:2022-01890"
            },
            {
              "Cvss": "AV:N/AC:M/Au:N/C:C/I:C/A:C",
              "Cvss3": "AV:N/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H",
              "Cwe": "CWE-404",
              "Href": "https://bdu.fstec.ru/vul/2022-01891",
              "Impact": "High",
              "Public": "20210818",
              "CveID": "BDU:2022-01891"
            },
            {
              "Cvss": "AV:N/AC:L/Au:N/C:C/I:C/A:C",
              "Cvss3": "AV:N/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H",
              "Cwe": "CWE-120, CWE-787",
              "Href": "https://bdu.fstec.ru/vul/2022-05740",
              "Impact": "High",
              "Public": "20210907",
              "CveID": "BDU:2022-05740"
            }
          ],
          "Cves": [
            {
              "Cvss": "AV:N/AC:M/Au:N/C:P/I:P/A:P",
              "Cvss3": "CVSS:3.1/AV:N/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H",
              "Cwe": "NVD-CWE-noinfo",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2021-29981",
              "Impact": "High",
              "Public": "20210817",
              "CveID": "CVE-2021-29981"
            },
            {
              "Cvss": "AV:N/AC:M/Au:N/C:P/I:N/A:N",
              "Cvss3": "CVSS:3.1/AV:N/AC:L/PR:N/UI:R/S:U/C:H/I:N/A:N",
              "Cwe": "CWE-772",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2021-29982",
              "Impact": "Low",
              "Public": "20210817",
              "CveID": "CVE-2021-29982"
            },
            {
              "Cvss": "AV:N/AC:M/Au:N/C:P/I:P/A:N",
              "Cvss3": "CVSS:3.1/AV:N/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:N",
              "Cwe": "CWE-444",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2021-29991",
              "Impact": "High",
              "Public": "20211103",
              "CveID": "CVE-2021-29991"
            },
            {
              "Cvss": "AV:N/AC:M/Au:N/C:P/I:P/A:P",
              "Cvss3": "CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H",
              "Cwe": "CWE-362",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2021-32810",
              "Impact": "Critical",
              "Public": "20210802",
              "CveID": "CVE-2021-32810"
            },
            {
              "Cvss": "AV:N/AC:M/Au:N/C:P/I:P/A:P",
              "Cvss3": "CVSS:3.1/AV:N/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H",
              "Cwe": "CWE-787",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2021-38495",
              "Impact": "High",
              "Public": "20211103",
              "CveID": "CVE-2021-38495"
            },
            {
              "Cvss": "AV:N/AC:M/Au:N/C:P/I:P/A:P",
              "Cvss3": "CVSS:3.1/AV:N/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H",
              "Cwe": "CWE-416",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2021-38496",
              "Impact": "High",
              "Public": "20211103",
              "CveID": "CVE-2021-38496"
            },
            {
              "Cvss": "AV:N/AC:M/Au:N/C:N/I:P/A:N",
              "Cvss3": "CVSS:3.1/AV:N/AC:L/PR:N/UI:R/S:U/C:N/I:H/A:N",
              "Cwe": "CWE-346",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2021-38497",
              "Impact": "Low",
              "Public": "20211103",
              "CveID": "CVE-2021-38497"
            },
            {
              "Cvss": "AV:N/AC:L/Au:N/C:N/I:N/A:P",
              "Cvss3": "CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H",
              "Cwe": "CWE-416",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2021-38498",
              "Impact": "High",
              "Public": "20211103",
              "CveID": "CVE-2021-38498"
            },
            {
              "Cvss": "AV:N/AC:M/Au:N/C:P/I:P/A:P",
              "Cvss3": "CVSS:3.1/AV:N/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H",
              "Cwe": "NVD-CWE-noinfo",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2021-38500",
              "Impact": "High",
              "Public": "20211103",
              "CveID": "CVE-2021-38500"
            },
            {
              "Cvss": "AV:N/AC:M/Au:N/C:P/I:P/A:P",
              "Cvss3": "CVSS:3.1/AV:N/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H",
              "Cwe": "NVD-CWE-noinfo",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2021-38501",
              "Impact": "High",
              "Public": "20211103",
              "CveID": "CVE-2021-38501"
            },
            {
              "Cvss": "AV:N/AC:M/Au:N/C:P/I:N/A:N",
              "Cvss3": "CVSS:3.1/AV:N/AC:H/PR:N/UI:N/S:U/C:H/I:N/A:N",
              "Cwe": "NVD-CWE-Other",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2021-38502",
              "Impact": "Low",
              "Public": "20211103",
              "CveID": "CVE-2021-38502"
            },
            {
              "Cvss": "AV:N/AC:L/Au:N/C:P/I:P/A:P",
              "Cvss3": "CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:C/C:H/I:H/A:H",
              "Cwe": "CWE-863",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2021-38503",
              "Impact": "Critical",
              "Public": "20211208",
              "CveID": "CVE-2021-38503"
            },
            {
              "Cvss": "AV:N/AC:M/Au:N/C:P/I:P/A:P",
              "Cvss3": "CVSS:3.1/AV:N/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H",
              "Cwe": "CWE-416",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2021-38504",
              "Impact": "High",
              "Public": "20211208",
              "CveID": "CVE-2021-38504"
            },
            {
              "Cvss": "AV:N/AC:M/Au:N/C:P/I:N/A:N",
              "Cvss3": "CVSS:3.1/AV:N/AC:L/PR:N/UI:R/S:U/C:H/I:N/A:N",
              "Cwe": "CWE-668",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2021-38505",
              "Impact": "Low",
              "Public": "20211208",
              "CveID": "CVE-2021-38505"
            },
            {
              "Cvss": "AV:N/AC:M/Au:N/C:N/I:P/A:N",
              "Cvss3": "CVSS:3.1/AV:N/AC:L/PR:N/UI:R/S:U/C:N/I:L/A:N",
              "Cwe": "CWE-1021",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2021-38506",
              "Impact": "Low",
              "Public": "20211208",
              "CveID": "CVE-2021-38506"
            },
            {
              "Cvss": "AV:N/AC:M/Au:N/C:N/I:P/A:N",
              "Cvss3": "CVSS:3.1/AV:N/AC:L/PR:N/UI:R/S:U/C:N/I:H/A:N",
              "Cwe": "CWE-346",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2021-38507",
              "Impact": "Low",
              "Public": "20211208",
              "CveID": "CVE-2021-38507"
            },
            {
              "Cvss": "AV:N/AC:M/Au:N/C:N/I:P/A:N",
              "Cvss3": "CVSS:3.1/AV:N/AC:L/PR:N/UI:R/S:U/C:N/I:L/A:N",
              "Cwe": "CWE-1021",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2021-38508",
              "Impact": "Low",
              "Public": "20211208",
              "CveID": "CVE-2021-38508"
            },
            {
              "Cvss": "AV:N/AC:M/Au:N/C:N/I:P/A:N",
              "Cvss3": "CVSS:3.1/AV:N/AC:L/PR:N/UI:R/S:U/C:N/I:L/A:N",
              "Cwe": "CWE-1021",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2021-38509",
              "Impact": "Low",
              "Public": "20211208",
              "CveID": "CVE-2021-38509"
            },
            {
              "Cvss": "AV:N/AC:M/Au:N/C:P/I:P/A:P",
              "Cvss3": "CVSS:3.1/AV:N/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H",
              "Cwe": "NVD-CWE-noinfo",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2021-38510",
              "Impact": "High",
              "Public": "20211208",
              "CveID": "CVE-2021-38510"
            },
            {
              "Cvss3": "CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H",
              "Cwe": "CWE-787",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2021-43529",
              "Impact": "Critical",
              "Public": "20230216",
              "CveID": "CVE-2021-43529"
            },
            {
              "Cvss": "AV:N/AC:M/Au:N/C:P/I:P/A:P",
              "Cvss3": "CVSS:3.1/AV:N/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H",
              "Cwe": "CWE-787",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2021-43534",
              "Impact": "High",
              "Public": "20211208",
              "CveID": "CVE-2021-43534"
            },
            {
              "Cvss": "AV:N/AC:M/Au:N/C:P/I:P/A:P",
              "Cvss3": "CVSS:3.1/AV:N/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H",
              "Cwe": "CWE-416",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2021-43535",
              "Impact": "High",
              "Public": "20211208",
              "CveID": "CVE-2021-43535"
            }
          ],
          "Bugzilla": [
            {
              "Id": "40907",
              "Href": "https://bugzilla.altlinux.org/40907",
              "Data": "В системе отсутствует пакет libotr5, из-за чего переписка в чате thunderbird выглядит нечитаемо. Нет возможности выставить статус шифрования"
            }
          ],
          "AffectedCpeList": {
            "Cpe": [
              "cpe:/o:alt:spworkstation:8.4",
              "cpe:/o:alt:spserver:8.4"
            ]
          }
        }
      },
      "Criteria": {
        "Operator": "AND",
        "Criterions": [
          {
            "TestRef": "oval:org.altlinux.errata:tst:3001",
            "Comment": "ALT Linux must be installed"
          }
        ],
        "Criterias": [
          {
            "Operator": "OR",
            "Criterions": [
              {
                "TestRef": "oval:org.altlinux.errata:tst:20213370001",
                "Comment": "rpm-build-thunderbird is earlier than 0:91.3.0-alt0.c9.1"
              },
              {
                "TestRef": "oval:org.altlinux.errata:tst:20213370002",
                "Comment": "thunderbird is earlier than 0:91.3.0-alt0.c9.1"
              },
              {
                "TestRef": "oval:org.altlinux.errata:tst:20213370003",
                "Comment": "thunderbird-wayland is earlier than 0:91.3.0-alt0.c9.1"
              }
            ]
          }
        ]
      }
    }
  ]
}