{
  "Definition": [
    {
      "ID": "oval:org.altlinux.errata:def:20192644",
      "Version": "oval:org.altlinux.errata:def:20192644",
      "Class": "patch",
      "Metadata": {
        "Title": "ALT-PU-2019-2644: package `firefox-esr` update to version 68.1.0-alt1",
        "AffectedList": [
          {
            "Family": "unix",
            "Platforms": [
              "ALT Linux branch p9"
            ],
            "Products": [
              "ALT Server",
              "ALT Virtualization Server",
              "ALT Workstation",
              "ALT Workstation K",
              "ALT Education",
              "Simply Linux",
              "Starterkit"
            ]
          }
        ],
        "References": [
          {
            "RefID": "ALT-PU-2019-2644",
            "RefURL": "https://errata.altlinux.org/ALT-PU-2019-2644",
            "Source": "ALTPU"
          },
          {
            "RefID": "BDU:2020-01394",
            "RefURL": "https://bdu.fstec.ru/vul/2020-01394",
            "Source": "BDU"
          },
          {
            "RefID": "BDU:2020-01395",
            "RefURL": "https://bdu.fstec.ru/vul/2020-01395",
            "Source": "BDU"
          },
          {
            "RefID": "BDU:2020-01396",
            "RefURL": "https://bdu.fstec.ru/vul/2020-01396",
            "Source": "BDU"
          },
          {
            "RefID": "BDU:2020-01397",
            "RefURL": "https://bdu.fstec.ru/vul/2020-01397",
            "Source": "BDU"
          },
          {
            "RefID": "BDU:2020-01398",
            "RefURL": "https://bdu.fstec.ru/vul/2020-01398",
            "Source": "BDU"
          },
          {
            "RefID": "BDU:2020-01399",
            "RefURL": "https://bdu.fstec.ru/vul/2020-01399",
            "Source": "BDU"
          },
          {
            "RefID": "BDU:2020-01411",
            "RefURL": "https://bdu.fstec.ru/vul/2020-01411",
            "Source": "BDU"
          },
          {
            "RefID": "BDU:2020-01668",
            "RefURL": "https://bdu.fstec.ru/vul/2020-01668",
            "Source": "BDU"
          },
          {
            "RefID": "BDU:2020-01820",
            "RefURL": "https://bdu.fstec.ru/vul/2020-01820",
            "Source": "BDU"
          },
          {
            "RefID": "BDU:2020-01822",
            "RefURL": "https://bdu.fstec.ru/vul/2020-01822",
            "Source": "BDU"
          },
          {
            "RefID": "BDU:2020-01825",
            "RefURL": "https://bdu.fstec.ru/vul/2020-01825",
            "Source": "BDU"
          },
          {
            "RefID": "BDU:2020-01826",
            "RefURL": "https://bdu.fstec.ru/vul/2020-01826",
            "Source": "BDU"
          },
          {
            "RefID": "BDU:2020-01827",
            "RefURL": "https://bdu.fstec.ru/vul/2020-01827",
            "Source": "BDU"
          },
          {
            "RefID": "BDU:2021-04379",
            "RefURL": "https://bdu.fstec.ru/vul/2021-04379",
            "Source": "BDU"
          },
          {
            "RefID": "BDU:2022-05798",
            "RefURL": "https://bdu.fstec.ru/vul/2022-05798",
            "Source": "BDU"
          },
          {
            "RefID": "BDU:2022-05799",
            "RefURL": "https://bdu.fstec.ru/vul/2022-05799",
            "Source": "BDU"
          },
          {
            "RefID": "CVE-2019-11735",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2019-11735",
            "Source": "CVE"
          },
          {
            "RefID": "CVE-2019-11736",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2019-11736",
            "Source": "CVE"
          },
          {
            "RefID": "CVE-2019-11738",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2019-11738",
            "Source": "CVE"
          },
          {
            "RefID": "CVE-2019-11740",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2019-11740",
            "Source": "CVE"
          },
          {
            "RefID": "CVE-2019-11742",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2019-11742",
            "Source": "CVE"
          },
          {
            "RefID": "CVE-2019-11743",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2019-11743",
            "Source": "CVE"
          },
          {
            "RefID": "CVE-2019-11744",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2019-11744",
            "Source": "CVE"
          },
          {
            "RefID": "CVE-2019-11746",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2019-11746",
            "Source": "CVE"
          },
          {
            "RefID": "CVE-2019-11747",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2019-11747",
            "Source": "CVE"
          },
          {
            "RefID": "CVE-2019-11748",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2019-11748",
            "Source": "CVE"
          },
          {
            "RefID": "CVE-2019-11749",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2019-11749",
            "Source": "CVE"
          },
          {
            "RefID": "CVE-2019-11750",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2019-11750",
            "Source": "CVE"
          },
          {
            "RefID": "CVE-2019-11751",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2019-11751",
            "Source": "CVE"
          },
          {
            "RefID": "CVE-2019-11752",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2019-11752",
            "Source": "CVE"
          },
          {
            "RefID": "CVE-2019-11753",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2019-11753",
            "Source": "CVE"
          },
          {
            "RefID": "CVE-2019-9812",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2019-9812",
            "Source": "CVE"
          }
        ],
        "Description": "This update upgrades firefox-esr to version 68.1.0-alt1. \nSecurity Fix(es):\n\n * BDU:2020-01394: Уязвимость компонента IndexedDB веб-браузеров Firefox, Firefox ESR и почтового клиента Thunderbird, позволяющая нарушителю получить доступ к конфиденциальным данным, нарушить их целостность, а также вызвать отказ в обслуживании\n\n * BDU:2020-01395: Уязвимость веб-браузеров Firefox, Firefox ESR и почтового клиента Thunderbird, связанная с отсутствием мер по защите структуры веб-страницы, позволяющая нарушителю осуществлять межсайтовые сценарные атаки\n\n * BDU:2020-01396: Уязвимость веб-браузеров Firefox, Firefox ESR и почтового клиента Thunderbird, связанная с включением функциональности из ненадежной управляющей сферы, позволяющая нарушителю оказать воздействие на целостность данных\n\n * BDU:2020-01397: Уязвимость веб-браузеров Firefox, Firefox ESR и почтового клиента Thunderbird, связанная с выходом операции за границы буфера памяти, позволяющая нарушителю получить доступ к конфиденциальным данным, нарушить их целостность, а также вызвать отказ в обслуживании\n\n * BDU:2020-01398: Уязвимость веб-браузеров Firefox, Firefox ESR и почтового клиента Thunderbird, связанная с ошибкой навигации событий, которые не соответствовали спецификации W3C, позволяющая нарушителю получить доступ к конфиденциальным данным\n\n * BDU:2020-01399: Уязвимость веб-браузеров Firefox, Firefox ESR и почтового клиента Thunderbird, связанная с использованием памяти после освобождения, позволяющая нарушителю получить доступ к конфиденциальным данным, нарушить их целостность, а также вызвать отказ в обслуживании\n\n * BDU:2020-01411: Уязвимость компонента account.firefox.com веб-браузеров Firefox, Firefox ESR и почтового клиента Thunderbird, позволяющая нарушителю нарушить целостность данных или вызвать отказ в обслуживании\n\n * BDU:2020-01668: Уязвимость компонента Spidermonkey веб-браузеров Firefox, Firefox ESR, позволяющая нарушителю вызвать отказ в обслуживании\n\n * BDU:2020-01820: Уязвимость браузера Firefox, связанная с копированием буфера без проверки размера входных данных, позволяющая нарушителю получить несанкционированный доступ к информации и нарушить ее целостность и доступность\n\n * BDU:2020-01822: Уязвимость браузера Firefox, связанная с неправильными стандартными правами доступа, позволяющая нарушителю выполнить произвольный код\n\n * BDU:2020-01825: Уязвимость браузера Firefox, связанная с неправильной инициализацией данных, позволяющая нарушителю нарушить целостность данных\n\n * BDU:2020-01826: Уязвимость браузера Firefox, связанная с неправильным назначением прав доступа для критического ресурса, позволяющая нарушителю получить несанкционированный доступ к информации\n\n * BDU:2020-01827: Уязвимость браузера Firefox, связанная с отсутствием защиты служебных данных, позволяющая нарушителю получить несанкционированный доступ к информации\n\n * BDU:2021-04379: Уязвимость службы Mozilla Maintenance Service браузеров Firefox ESR и Firefox, позволяющая нарушителю повысить свои привилегии\n\n * BDU:2022-05798: Уязвимость браузеров Mozilla Firefox и Mozilla Firefox ESR для Windows, связанная с непринятием мер по чистке данных на управляющем уровне, позволяющая нарушителю выполнить произвольные команды\n\n * BDU:2022-05799: Уязвимость службы Maintenance Service браузеров Mozilla Firefox и Mozilla Firefox ESR для Windows, позволяющая нарушителю повысить свои  привилегии\n\n * CVE-2019-11735: Mozilla developers and community members reported memory safety bugs present in Firefox 68 and Firefox ESR 68. Some of these bugs showed evidence of memory corruption and we presume that with enough effort that some of these could be exploited to run arbitrary code. This vulnerability affects Firefox \u003c 69 and Firefox ESR \u003c 68.1.\n\n * CVE-2019-11736: The Mozilla Maintenance Service does not guard against files being hardlinked to another file in the updates directory, allowing for the replacement of local files, including the Maintenance Service executable, which is run with privileged access. Additionally, there was a race condition during checks for junctions and symbolic links by the Maintenance Service, allowing for potential local file and directory manipulation to be undetected in some circumstances. This allows for potential privilege escalation by a user with unprivileged local access. \u003cbr\u003e*Note: These attacks requires local system access and only affects Windows. Other operating systems are not affected.*. This vulnerability affects Firefox \u003c 69 and Firefox ESR \u003c 68.1.\n\n * CVE-2019-11738: If a Content Security Policy (CSP) directive is defined that uses a hash-based source that takes the empty string as input, execution of any javascript: URIs will be allowed. This could allow for malicious JavaScript content to be run, bypassing CSP permissions. This vulnerability affects Firefox \u003c 69 and Firefox ESR \u003c 68.1.\n\n * CVE-2019-11740: Mozilla developers and community members reported memory safety bugs present in Firefox 68, Firefox ESR 68, and Firefox 60.8. Some of these bugs showed evidence of memory corruption and we presume that with enough effort that some of these could be exploited to run arbitrary code. This vulnerability affects Firefox \u003c 69, Thunderbird \u003c 68.1, Thunderbird \u003c 60.9, Firefox ESR \u003c 60.9, and Firefox ESR \u003c 68.1.\n\n * CVE-2019-11742: A same-origin policy violation occurs allowing the theft of cross-origin images through a combination of SVG filters and a \u0026lt;canvas\u0026gt; element due to an error in how same-origin policy is applied to cached image content. The resulting same-origin policy violation could allow for data theft. This vulnerability affects Firefox \u003c 69, Thunderbird \u003c 68.1, Thunderbird \u003c 60.9, Firefox ESR \u003c 60.9, and Firefox ESR \u003c 68.1.\n\n * CVE-2019-11743: Navigation events were not fully adhering to the W3C's \"Navigation-Timing Level 2\" draft specification in some instances for the unload event, which restricts access to detailed timing attributes to only be same-origin. This resulted in potential cross-origin information exposure of history through timing side-channel attacks. This vulnerability affects Firefox \u003c 69, Thunderbird \u003c 68.1, Thunderbird \u003c 60.9, Firefox ESR \u003c 60.9, and Firefox ESR \u003c 68.1.\n\n * CVE-2019-11744: Some HTML elements, such as \u0026lt;title\u0026gt; and \u0026lt;textarea\u0026gt;, can contain literal angle brackets without treating them as markup. It is possible to pass a literal closing tag to .innerHTML on these elements, and subsequent content after that will be parsed as if it were outside the tag. This can lead to XSS if a site does not filter user input as strictly for these elements as it does for other elements. This vulnerability affects Firefox \u003c 69, Thunderbird \u003c 68.1, Thunderbird \u003c 60.9, Firefox ESR \u003c 60.9, and Firefox ESR \u003c 68.1.\n\n * CVE-2019-11746: A use-after-free vulnerability can occur while manipulating video elements if the body is freed while still in use. This results in a potentially exploitable crash. This vulnerability affects Firefox \u003c 69, Thunderbird \u003c 68.1, Thunderbird \u003c 60.9, Firefox ESR \u003c 60.9, and Firefox ESR \u003c 68.1.\n\n * CVE-2019-11747: The \"Forget about this site\" feature in the History pane is intended to remove all saved user data that indicates a user has visited a site. This includes removing any HTTP Strict Transport Security (HSTS) settings received from sites that use it. Due to a bug, sites on the pre-load list also have their HSTS setting removed. On the next visit to that site if the user specifies an http: URL rather than secure https: they will not be protected by the pre-loaded HSTS setting. After that visit the site's HSTS setting will be restored. This vulnerability affects Firefox \u003c 69 and Firefox ESR \u003c 68.1.\n\n * CVE-2019-11748: WebRTC in Firefox will honor persisted permissions given to sites for access to microphone and camera resources even when in a third-party context. In light of recent high profile vulnerabilities in other software, a decision was made to no longer persist these permissions. This avoids the possibility of trusted WebRTC resources being invisibly embedded in web content and abusing permissions previously given by users. Users will now be prompted for permissions on each use. This vulnerability affects Firefox \u003c 69 and Firefox ESR \u003c 68.1.\n\n * CVE-2019-11749: A vulnerability exists in WebRTC where malicious web content can use probing techniques on the getUserMedia API using constraints to reveal device properties of cameras on the system without triggering a user prompt or notification. This allows for the potential fingerprinting of users. This vulnerability affects Firefox \u003c 69 and Firefox ESR \u003c 68.1.\n\n * CVE-2019-11750: A type confusion vulnerability exists in Spidermonkey, which results in a non-exploitable crash. This vulnerability affects Firefox \u003c 69 and Firefox ESR \u003c 68.1.\n\n * CVE-2019-11751: Logging-related command line parameters are not properly sanitized when Firefox is launched by another program, such as when a user clicks on malicious links in a chat application. This can be used to write a log file to an arbitrary location such as the Windows 'Startup' folder. \u003cbr\u003e*Note: this issue only affects Firefox on Windows operating systems.*. This vulnerability affects Firefox \u003c 69 and Firefox ESR \u003c 68.1.\n\n * CVE-2019-11752: It is possible to delete an IndexedDB key value and subsequently try to extract it during conversion. This results in a use-after-free and a potentially exploitable crash. This vulnerability affects Firefox \u003c 69, Thunderbird \u003c 68.1, Thunderbird \u003c 60.9, Firefox ESR \u003c 60.9, and Firefox ESR \u003c 68.1.\n\n * CVE-2019-11753: The Firefox installer allows Firefox to be installed to a custom user writable location, leaving it unprotected from manipulation by unprivileged users or malware. If the Mozilla Maintenance Service is manipulated to update this unprotected location and the updated maintenance service in the unprotected location has been altered, the altered maintenance service can run with elevated privileges during the update process due to a lack of integrity checks. This allows for privilege escalation if the executable has been replaced locally. \u003cbr\u003e*Note: This attack requires local system access and only affects Windows. Other operating systems are not affected.*. This vulnerability affects Firefox \u003c 69, Firefox ESR \u003c 60.9, and Firefox ESR \u003c 68.1.\n\n * CVE-2019-9812: Given a compromised sandboxed content process due to a separate vulnerability, it is possible to escape that sandbox by loading accounts.firefox.com in that process and forcing a log-in to a malicious Firefox Sync account. Preference settings that disable the sandbox are then synchronized to the local machine and the compromised browser would restart without the sandbox if a crash is triggered. This vulnerability affects Firefox ESR \u003c 60.9, Firefox ESR \u003c 68.1, and Firefox \u003c 69.",
        "Advisory": {
          "From": "errata.altlinux.org",
          "Severity": "Critical",
          "Rights": "Copyright 2023 BaseALT Ltd.",
          "Issued": {
            "Date": "2019-09-05"
          },
          "Updated": {
            "Date": "2019-09-05"
          },
          "bdu": [
            {
              "Cvss": "AV:N/AC:M/Au:N/C:C/I:C/A:C",
              "Cvss3": "AV:N/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H",
              "Cwe": "CWE-416",
              "Href": "https://bdu.fstec.ru/vul/2020-01394",
              "Impact": "High",
              "Public": "20190927",
              "CveID": "BDU:2020-01394"
            },
            {
              "Cvss": "AV:N/AC:M/Au:N/C:P/I:P/A:N",
              "Cvss3": "AV:N/AC:L/PR:N/UI:R/S:C/C:L/I:L/A:N",
              "Cwe": "CWE-79",
              "Href": "https://bdu.fstec.ru/vul/2020-01395",
              "Impact": "Low",
              "Public": "20190927",
              "CveID": "BDU:2020-01395"
            },
            {
              "Cvss": "AV:N/AC:M/Au:N/C:N/I:C/A:N",
              "Cvss3": "AV:N/AC:L/PR:N/UI:R/S:U/C:N/I:H/A:N",
              "Cwe": "CWE-829",
              "Href": "https://bdu.fstec.ru/vul/2020-01396",
              "Impact": "Low",
              "Public": "20190927",
              "CveID": "BDU:2020-01396"
            },
            {
              "Cvss": "AV:N/AC:L/Au:N/C:C/I:C/A:C",
              "Cvss3": "AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H",
              "Cwe": "CWE-119",
              "Href": "https://bdu.fstec.ru/vul/2020-01397",
              "Impact": "Critical",
              "Public": "20190927",
              "CveID": "BDU:2020-01397"
            },
            {
              "Cvss": "AV:N/AC:M/Au:N/C:P/I:N/A:N",
              "Cvss3": "AV:N/AC:H/PR:N/UI:N/S:U/C:L/I:N/A:N",
              "Cwe": "CWE-200",
              "Href": "https://bdu.fstec.ru/vul/2020-01398",
              "Impact": "Low",
              "Public": "20190927",
              "CveID": "BDU:2020-01398"
            },
            {
              "Cvss": "AV:N/AC:M/Au:N/C:C/I:C/A:C",
              "Cvss3": "AV:N/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H",
              "Cwe": "CWE-416",
              "Href": "https://bdu.fstec.ru/vul/2020-01399",
              "Impact": "High",
              "Public": "20190927",
              "CveID": "BDU:2020-01399"
            },
            {
              "Cvss": "AV:N/AC:M/Au:N/C:N/I:C/A:C",
              "Cvss3": "AV:N/AC:L/PR:N/UI:R/S:C/C:N/I:H/A:H",
              "Cwe": "CWE-20",
              "Href": "https://bdu.fstec.ru/vul/2020-01411",
              "Impact": "Critical",
              "Public": "20200108",
              "CveID": "BDU:2020-01411"
            },
            {
              "Cvss": "AV:N/AC:M/Au:N/C:N/I:N/A:C",
              "Cvss3": "AV:N/AC:L/PR:N/UI:R/S:U/C:N/I:N/A:H",
              "Cwe": "CWE-704",
              "Href": "https://bdu.fstec.ru/vul/2020-01668",
              "Impact": "Low",
              "Public": "20190903",
              "CveID": "BDU:2020-01668"
            },
            {
              "Cvss": "AV:N/AC:L/Au:N/C:C/I:C/A:C",
              "Cvss3": "AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H",
              "Cwe": "CWE-120",
              "Href": "https://bdu.fstec.ru/vul/2020-01820",
              "Impact": "Critical",
              "Public": "20190927",
              "CveID": "BDU:2020-01820"
            },
            {
              "Cvss": "AV:N/AC:M/Au:N/C:C/I:C/A:C",
              "Cvss3": "AV:N/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H",
              "Cwe": "CWE-276",
              "Href": "https://bdu.fstec.ru/vul/2020-01822",
              "Impact": "High",
              "Public": "20190927",
              "CveID": "BDU:2020-01822"
            },
            {
              "Cvss": "AV:N/AC:M/Au:N/C:N/I:C/A:N",
              "Cvss3": "AV:N/AC:L/PR:N/UI:R/S:U/C:N/I:H/A:N",
              "Cwe": "CWE-665",
              "Href": "https://bdu.fstec.ru/vul/2020-01825",
              "Impact": "Low",
              "Public": "20190927",
              "CveID": "BDU:2020-01825"
            },
            {
              "Cvss": "AV:N/AC:M/Au:N/C:C/I:N/A:N",
              "Cvss3": "AV:N/AC:L/PR:N/UI:R/S:U/C:H/I:N/A:N",
              "Cwe": "CWE-732",
              "Href": "https://bdu.fstec.ru/vul/2020-01826",
              "Impact": "Low",
              "Public": "20190927",
              "CveID": "BDU:2020-01826"
            },
            {
              "Cvss": "AV:N/AC:M/Au:N/C:C/I:N/A:N",
              "Cvss3": "AV:N/AC:L/PR:N/UI:R/S:U/C:H/I:N/A:N",
              "Cwe": "CWE-200",
              "Href": "https://bdu.fstec.ru/vul/2020-01827",
              "Impact": "Low",
              "Public": "20190927",
              "CveID": "BDU:2020-01827"
            },
            {
              "Cvss": "AV:L/AC:H/Au:S/C:C/I:C/A:C",
              "Cvss3": "AV:L/AC:H/PR:L/UI:N/S:U/C:H/I:H/A:H",
              "Cwe": "CWE-362",
              "Href": "https://bdu.fstec.ru/vul/2021-04379",
              "Impact": "High",
              "Public": "20190927",
              "CveID": "BDU:2021-04379"
            },
            {
              "Cvss": "AV:N/AC:L/Au:N/C:C/I:C/A:C",
              "Cvss3": "AV:N/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H",
              "Cwe": "CWE-77, CWE-88",
              "Href": "https://bdu.fstec.ru/vul/2022-05798",
              "Impact": "High",
              "Public": "20190903",
              "CveID": "BDU:2022-05798"
            },
            {
              "Cvss": "AV:L/AC:L/Au:S/C:C/I:C/A:C",
              "Cvss3": "AV:L/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H",
              "Cwe": "CWE-354",
              "Href": "https://bdu.fstec.ru/vul/2022-05799",
              "Impact": "High",
              "Public": "20190903",
              "CveID": "BDU:2022-05799"
            }
          ],
          "Cves": [
            {
              "Cvss": "AV:N/AC:M/Au:N/C:P/I:P/A:P",
              "Cvss3": "CVSS:3.1/AV:N/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H",
              "Cwe": "CWE-787",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2019-11735",
              "Impact": "High",
              "Public": "20190927",
              "CveID": "CVE-2019-11735"
            },
            {
              "Cvss": "AV:L/AC:M/Au:N/C:P/I:P/A:P",
              "Cvss3": "CVSS:3.1/AV:L/AC:H/PR:L/UI:N/S:U/C:H/I:H/A:H",
              "Cwe": "CWE-362",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2019-11736",
              "Impact": "High",
              "Public": "20190927",
              "CveID": "CVE-2019-11736"
            },
            {
              "Cvss": "AV:N/AC:M/Au:N/C:P/I:P/A:P",
              "Cvss3": "CVSS:3.1/AV:N/AC:L/PR:N/UI:R/S:U/C:L/I:L/A:L",
              "Cwe": "NVD-CWE-noinfo",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2019-11738",
              "Impact": "Low",
              "Public": "20190927",
              "CveID": "CVE-2019-11738"
            },
            {
              "Cvss": "AV:N/AC:M/Au:N/C:P/I:P/A:P",
              "Cvss3": "CVSS:3.1/AV:N/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H",
              "Cwe": "CWE-787",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2019-11740",
              "Impact": "High",
              "Public": "20190927",
              "CveID": "CVE-2019-11740"
            },
            {
              "Cvss": "AV:N/AC:M/Au:N/C:N/I:P/A:N",
              "Cvss3": "CVSS:3.1/AV:N/AC:L/PR:N/UI:R/S:U/C:N/I:H/A:N",
              "Cwe": "CWE-829",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2019-11742",
              "Impact": "Low",
              "Public": "20190927",
              "CveID": "CVE-2019-11742"
            },
            {
              "Cvss": "AV:N/AC:M/Au:N/C:P/I:N/A:N",
              "Cvss3": "CVSS:3.1/AV:N/AC:H/PR:N/UI:N/S:U/C:L/I:N/A:N",
              "Cwe": "CWE-203",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2019-11743",
              "Impact": "Low",
              "Public": "20190927",
              "CveID": "CVE-2019-11743"
            },
            {
              "Cvss": "AV:N/AC:M/Au:N/C:N/I:P/A:N",
              "Cvss3": "CVSS:3.1/AV:N/AC:L/PR:N/UI:R/S:C/C:L/I:L/A:N",
              "Cwe": "CWE-79",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2019-11744",
              "Impact": "Low",
              "Public": "20190927",
              "CveID": "CVE-2019-11744"
            },
            {
              "Cvss": "AV:N/AC:M/Au:N/C:P/I:P/A:P",
              "Cvss3": "CVSS:3.1/AV:N/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H",
              "Cwe": "CWE-416",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2019-11746",
              "Impact": "High",
              "Public": "20190927",
              "CveID": "CVE-2019-11746"
            },
            {
              "Cvss": "AV:N/AC:M/Au:N/C:N/I:P/A:N",
              "Cvss3": "CVSS:3.1/AV:N/AC:L/PR:N/UI:R/S:U/C:N/I:H/A:N",
              "Cwe": "CWE-665",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2019-11747",
              "Impact": "Low",
              "Public": "20190927",
              "CveID": "CVE-2019-11747"
            },
            {
              "Cvss": "AV:N/AC:M/Au:N/C:P/I:N/A:N",
              "Cvss3": "CVSS:3.1/AV:N/AC:L/PR:N/UI:R/S:U/C:H/I:N/A:N",
              "Cwe": "CWE-281",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2019-11748",
              "Impact": "Low",
              "Public": "20190927",
              "CveID": "CVE-2019-11748"
            },
            {
              "Cvss": "AV:N/AC:M/Au:N/C:P/I:N/A:N",
              "Cvss3": "CVSS:3.1/AV:N/AC:L/PR:N/UI:R/S:U/C:L/I:N/A:N",
              "Cwe": "NVD-CWE-noinfo",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2019-11749",
              "Impact": "Low",
              "Public": "20190927",
              "CveID": "CVE-2019-11749"
            },
            {
              "Cvss": "AV:N/AC:M/Au:N/C:N/I:N/A:P",
              "Cvss3": "CVSS:3.1/AV:N/AC:L/PR:N/UI:R/S:U/C:N/I:N/A:H",
              "Cwe": "CWE-843",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2019-11750",
              "Impact": "Low",
              "Public": "20190927",
              "CveID": "CVE-2019-11750"
            },
            {
              "Cvss": "AV:N/AC:M/Au:N/C:P/I:P/A:P",
              "Cvss3": "CVSS:3.1/AV:N/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H",
              "Cwe": "CWE-88",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2019-11751",
              "Impact": "High",
              "Public": "20190927",
              "CveID": "CVE-2019-11751"
            },
            {
              "Cvss": "AV:N/AC:M/Au:N/C:C/I:C/A:C",
              "Cvss3": "CVSS:3.1/AV:N/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H",
              "Cwe": "CWE-416",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2019-11752",
              "Impact": "High",
              "Public": "20190927",
              "CveID": "CVE-2019-11752"
            },
            {
              "Cvss": "AV:L/AC:L/Au:N/C:P/I:P/A:P",
              "Cvss3": "CVSS:3.1/AV:L/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H",
              "Cwe": "CWE-354",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2019-11753",
              "Impact": "High",
              "Public": "20190927",
              "CveID": "CVE-2019-11753"
            },
            {
              "Cvss": "AV:N/AC:M/Au:N/C:N/I:P/A:P",
              "Cvss3": "CVSS:3.1/AV:N/AC:L/PR:N/UI:R/S:C/C:N/I:H/A:H",
              "Cwe": "NVD-CWE-noinfo",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2019-9812",
              "Impact": "Critical",
              "Public": "20200108",
              "CveID": "CVE-2019-9812"
            }
          ],
          "AffectedCpeList": {
            "Cpe": [
              "cpe:/o:alt:kworkstation:9",
              "cpe:/o:alt:workstation:9",
              "cpe:/o:alt:server:9",
              "cpe:/o:alt:server-v:9",
              "cpe:/o:alt:education:9",
              "cpe:/o:alt:slinux:9",
              "cpe:/o:alt:starterkit:p9",
              "cpe:/o:alt:kworkstation:9.1",
              "cpe:/o:alt:workstation:9.1",
              "cpe:/o:alt:server:9.1",
              "cpe:/o:alt:server-v:9.1",
              "cpe:/o:alt:education:9.1",
              "cpe:/o:alt:slinux:9.1",
              "cpe:/o:alt:starterkit:9.1",
              "cpe:/o:alt:kworkstation:9.2",
              "cpe:/o:alt:workstation:9.2",
              "cpe:/o:alt:server:9.2",
              "cpe:/o:alt:server-v:9.2",
              "cpe:/o:alt:education:9.2",
              "cpe:/o:alt:slinux:9.2",
              "cpe:/o:alt:starterkit:9.2"
            ]
          }
        }
      },
      "Criteria": {
        "Operator": "AND",
        "Criterions": [
          {
            "TestRef": "oval:org.altlinux.errata:tst:1001",
            "Comment": "ALT Linux must be installed"
          }
        ],
        "Criterias": [
          {
            "Operator": "OR",
            "Criterions": [
              {
                "TestRef": "oval:org.altlinux.errata:tst:20192644001",
                "Comment": "firefox-esr is earlier than 0:68.1.0-alt1"
              },
              {
                "TestRef": "oval:org.altlinux.errata:tst:20192644002",
                "Comment": "firefox-esr-wayland is earlier than 0:68.1.0-alt1"
              }
            ]
          }
        ]
      }
    }
  ]
}