{
  "Definition": [
    {
      "ID": "oval:org.altlinux.errata:def:20221983",
      "Version": "oval:org.altlinux.errata:def:20221983",
      "Class": "patch",
      "Metadata": {
        "Title": "ALT-PU-2022-1983: package `thunderbird` update to version 91.9.1-alt0.c9.1",
        "AffectedList": [
          {
            "Family": "unix",
            "Platforms": [
              "ALT Linux branch c9f2"
            ],
            "Products": [
              "ALT SPWorkstation",
              "ALT SPServer"
            ]
          }
        ],
        "References": [
          {
            "RefID": "ALT-PU-2022-1983",
            "RefURL": "https://errata.altlinux.org/ALT-PU-2022-1983",
            "Source": "ALTPU"
          },
          {
            "RefID": "BDU:2022-02138",
            "RefURL": "https://bdu.fstec.ru/vul/2022-02138",
            "Source": "BDU"
          },
          {
            "RefID": "BDU:2022-02370",
            "RefURL": "https://bdu.fstec.ru/vul/2022-02370",
            "Source": "BDU"
          },
          {
            "RefID": "BDU:2022-02373",
            "RefURL": "https://bdu.fstec.ru/vul/2022-02373",
            "Source": "BDU"
          },
          {
            "RefID": "BDU:2022-02941",
            "RefURL": "https://bdu.fstec.ru/vul/2022-02941",
            "Source": "BDU"
          },
          {
            "RefID": "BDU:2022-02977",
            "RefURL": "https://bdu.fstec.ru/vul/2022-02977",
            "Source": "BDU"
          },
          {
            "RefID": "BDU:2022-02988",
            "RefURL": "https://bdu.fstec.ru/vul/2022-02988",
            "Source": "BDU"
          },
          {
            "RefID": "BDU:2022-03073",
            "RefURL": "https://bdu.fstec.ru/vul/2022-03073",
            "Source": "BDU"
          },
          {
            "RefID": "BDU:2022-03074",
            "RefURL": "https://bdu.fstec.ru/vul/2022-03074",
            "Source": "BDU"
          },
          {
            "RefID": "BDU:2022-03075",
            "RefURL": "https://bdu.fstec.ru/vul/2022-03075",
            "Source": "BDU"
          },
          {
            "RefID": "BDU:2022-03076",
            "RefURL": "https://bdu.fstec.ru/vul/2022-03076",
            "Source": "BDU"
          },
          {
            "RefID": "BDU:2022-03077",
            "RefURL": "https://bdu.fstec.ru/vul/2022-03077",
            "Source": "BDU"
          },
          {
            "RefID": "BDU:2022-04617",
            "RefURL": "https://bdu.fstec.ru/vul/2022-04617",
            "Source": "BDU"
          },
          {
            "RefID": "CVE-2022-1097",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2022-1097",
            "Source": "CVE"
          },
          {
            "RefID": "CVE-2022-1196",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2022-1196",
            "Source": "CVE"
          },
          {
            "RefID": "CVE-2022-1197",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2022-1197",
            "Source": "CVE"
          },
          {
            "RefID": "CVE-2022-1520",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2022-1520",
            "Source": "CVE"
          },
          {
            "RefID": "CVE-2022-1529",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2022-1529",
            "Source": "CVE"
          },
          {
            "RefID": "CVE-2022-1802",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2022-1802",
            "Source": "CVE"
          },
          {
            "RefID": "CVE-2022-24713",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2022-24713",
            "Source": "CVE"
          },
          {
            "RefID": "CVE-2022-28281",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2022-28281",
            "Source": "CVE"
          },
          {
            "RefID": "CVE-2022-28282",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2022-28282",
            "Source": "CVE"
          },
          {
            "RefID": "CVE-2022-28285",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2022-28285",
            "Source": "CVE"
          },
          {
            "RefID": "CVE-2022-28286",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2022-28286",
            "Source": "CVE"
          },
          {
            "RefID": "CVE-2022-28289",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2022-28289",
            "Source": "CVE"
          },
          {
            "RefID": "CVE-2022-29909",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2022-29909",
            "Source": "CVE"
          },
          {
            "RefID": "CVE-2022-29911",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2022-29911",
            "Source": "CVE"
          },
          {
            "RefID": "CVE-2022-29912",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2022-29912",
            "Source": "CVE"
          },
          {
            "RefID": "CVE-2022-29913",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2022-29913",
            "Source": "CVE"
          },
          {
            "RefID": "CVE-2022-29914",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2022-29914",
            "Source": "CVE"
          },
          {
            "RefID": "CVE-2022-29916",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2022-29916",
            "Source": "CVE"
          },
          {
            "RefID": "CVE-2022-29917",
            "RefURL": "https://nvd.nist.gov/vuln/detail/CVE-2022-29917",
            "Source": "CVE"
          }
        ],
        "Description": "This update upgrades thunderbird to version 91.9.1-alt0.c9.1. \nSecurity Fix(es):\n\n * BDU:2022-02138: Уязвимость почтового клиента Thunderbird, браузеров Mozilla Firefox и Firefox ESR, связанная с выходом операции за границы буфера в памяти, позволяющая нарушителю выполнить произвольный код\n\n * BDU:2022-02370: Уязвимость веб-браузеров Firefox, Firefox ESR и почтового клиента Thunderbird, связанная  с ошибкой освобождения памяти при обработке ссылок rel=\u0026quot;localization\u0026quot;, позволяющая нарушителю выполнить произвольный код\n\n * BDU:2022-02373: Уязвимость реализации проверки регулярных выражений (regex для Rust) веб-браузеров Firefox, Firefox ESR и почтового клиента Thunderbird, позволяющая нарушителю вызвать отказ в обслуживании\n\n * BDU:2022-02941: Уязвимость функции SpeechSynthesis почтового клиента Thunderbird, позволяющая нарушителю раскрыть защищаемую информацию\n\n * BDU:2022-02977: Уязвимость почтового клиента Mozilla Thunderbird, связанная с некорректной обработкой вводимых пользователем данных при обработке подписанных и зашифрованных вложенных сообщений, позволяющая нарушителю проводить спуфинг-атаки\n\n * BDU:2022-02988: Уязвимость веб-браузеров Firefox, Firefox ESR и почтового клиента Thunderbird, связанная с выходом операции за границы буфера в памяти, позволяющая нарушителю выполнить произвольный код или вызвать отказ в обслуживании\n\n * BDU:2022-03073: Уязвимость уведомлений пользовательского интерфейса поноэкранного режима (Fullscreen UI) веб-браузеров Firefox, Firefox ESR и почтового клиента Thunderbird, позволяющая нарушителю проводить спуфинг-атаки\n\n * BDU:2022-03074: Уязвимость режима чтения веб-браузеров Firefox, Firefox ESR и почтового клиента Thunderbird, позволяющая нарушителю обойти введенные ограничения безопасности\n\n * BDU:2022-03075: Уязвимость изолированной среды iframe веб-браузеров Firefox, Firefox ESR и почтового клиента Thunderbird,  позволяющая нарушителю обойти существующие ограничения безопасности\n\n * BDU:2022-03076: Уязвимость веб-браузеров Firefox, Firefox ESR и почтового клиента Thunderbird, связанная с недостаточной защитой служебных данных, позволяющая нарушителю получить доступ к защищаемой информации или оказать другое воздействие\n\n * BDU:2022-03077: Уязвимость веб-браузеров Firefox, Firefox ESR и почтового клиента Thunderbird, связанная с недостатками разграничения доступа, позволяющая нарушителю обойти существующие ограничения безопасности\n\n * BDU:2022-04617: Уязвимость почтового клиента Thunderbird, связанная с ошибками при обновлении цифровой подписи OpenPGP, позволяющая нарушителю выполнить спуфинговую атаку\n\n * CVE-2022-1097: \u003ccode\u003eNSSToken\u003c/code\u003e objects were referenced via direct points, and could have been accessed in an unsafe way on different threads, leading to a use-after-free and potentially exploitable crash. This vulnerability affects Thunderbird \u003c 91.8, Firefox \u003c 99, and Firefox ESR \u003c 91.8.\n\n * CVE-2022-1196: After a VR Process is destroyed, a reference to it may have been retained and used, leading to a use-after-free and potentially exploitable crash. This vulnerability affects Thunderbird \u003c 91.8 and Firefox ESR \u003c 91.8.\n\n * CVE-2022-1197: When importing a revoked key that specified key compromise as the revocation reason, Thunderbird did not update the existing copy of the key that was not yet revoked, and the existing key was kept as non-revoked. Revocation statements that used another revocation reason, or that didn't specify a revocation reason, were unaffected. This vulnerability affects Thunderbird \u003c 91.8.\n\n * CVE-2022-1520: When viewing an email message A, which contains an attached message B, where B is encrypted or digitally signed or both, Thunderbird may show an incorrect encryption or signature status. After opening and viewing the attached message B, when returning to the display of message A, the message A might be shown with the security status of message B. This vulnerability affects Thunderbird \u003c 91.9.\n\n * CVE-2022-1529: An attacker could have sent a message to the parent process where the contents were used to double-index into a JavaScript object, leading to prototype pollution and ultimately attacker-controlled JavaScript executing in the privileged parent process. This vulnerability affects Firefox ESR \u003c 91.9.1, Firefox \u003c 100.0.2, Firefox for Android \u003c 100.3.0, and Thunderbird \u003c 91.9.1.\n\n * CVE-2022-1802: If an attacker was able to corrupt the methods of an Array object in JavaScript via prototype pollution, they could have achieved execution of attacker-controlled JavaScript code in a privileged context. This vulnerability affects Firefox ESR \u003c 91.9.1, Firefox \u003c 100.0.2, Firefox for Android \u003c 100.3.0, and Thunderbird \u003c 91.9.1.\n\n * CVE-2022-24713: regex is an implementation of regular expressions for the Rust language. The regex crate features built-in mitigations to prevent denial of service attacks caused by untrusted regexes, or untrusted input matched by trusted regexes. Those (tunable) mitigations already provide sane defaults to prevent attacks. This guarantee is documented and it's considered part of the crate's API. Unfortunately a bug was discovered in the mitigations designed to prevent untrusted regexes to take an arbitrary amount of time during parsing, and it's possible to craft regexes that bypass such mitigations. This makes it possible to perform denial of service attacks by sending specially crafted regexes to services accepting user-controlled, untrusted regexes. All versions of the regex crate before or equal to 1.5.4 are affected by this issue. The fix is include starting from regex 1.5.5. All users accepting user-controlled regexes are recommended to upgrade immediately to the latest version of the regex crate. Unfortunately there is no fixed set of problematic regexes, as there are practically infinite regexes that could be crafted to exploit this vulnerability. Because of this, it us not recommend to deny known problematic regexes.\n\n * CVE-2022-28281: If a compromised content process sent an unexpected number of WebAuthN Extensions in a Register command to the parent process, an out of bounds write would have occurred leading to memory corruption and a potentially exploitable crash. This vulnerability affects Thunderbird \u003c 91.8, Firefox \u003c 99, and Firefox ESR \u003c 91.8.\n\n * CVE-2022-28282: By using a link with \u003ccode\u003erel=\"localization\"\u003c/code\u003e a use-after-free could have been triggered by destroying an object during JavaScript execution and then referencing the object through a freed pointer, leading to a potential exploitable crash. This vulnerability affects Thunderbird \u003c 91.8, Firefox \u003c 99, and Firefox ESR \u003c 91.8.\n\n * CVE-2022-28285: When generating the assembly code for \u003ccode\u003eMLoadTypedArrayElementHole\u003c/code\u003e, an incorrect AliasSet was used. In conjunction with another vulnerability this could have been used for an out of bounds memory read. This vulnerability affects Thunderbird \u003c 91.8, Firefox \u003c 99, and Firefox ESR \u003c 91.8.\n\n * CVE-2022-28286: Due to a layout change, iframe contents could have been rendered outside of its border. This could have led to user confusion or spoofing attacks. This vulnerability affects Thunderbird \u003c 91.8, Firefox \u003c 99, and Firefox ESR \u003c 91.8.\n\n * CVE-2022-28289: Mozilla developers and community members Nika Layzell, Andrew McCreight, Gabriele Svelto, and the Mozilla Fuzzing Team reported memory safety bugs present in Thunderbird 91.7. Some of these bugs showed evidence of memory corruption and we presume that with enough effort some of these could have been exploited to run arbitrary code. This vulnerability affects Thunderbird \u003c 91.8, Firefox \u003c 99, and Firefox ESR \u003c 91.8.\n\n * CVE-2022-29909: Documents in deeply-nested cross-origin browsing contexts could have obtained permissions granted to the top-level origin, bypassing the existing prompt and wrongfully inheriting the top-level permissions. This vulnerability affects Thunderbird \u003c 91.9, Firefox ESR \u003c 91.9, and Firefox \u003c 100.\n\n * CVE-2022-29911: An improper implementation of the new iframe sandbox keyword \u003ccode\u003eallow-top-navigation-by-user-activation\u003c/code\u003e could lead to script execution without \u003ccode\u003eallow-scripts\u003c/code\u003e being present. This vulnerability affects Thunderbird \u003c 91.9, Firefox ESR \u003c 91.9, and Firefox \u003c 100.\n\n * CVE-2022-29912: Requests initiated through reader mode did not properly omit cookies with a SameSite attribute. This vulnerability affects Thunderbird \u003c 91.9, Firefox ESR \u003c 91.9, and Firefox \u003c 100.\n\n * CVE-2022-29913: The parent process would not properly check whether the Speech Synthesis feature is enabled, when receiving instructions from a child process. This vulnerability affects Thunderbird \u003c 91.9.\n\n * CVE-2022-29914: When reusing existing popups Firefox would have allowed them to cover the fullscreen notification UI, which could have enabled browser spoofing attacks. This vulnerability affects Thunderbird \u003c 91.9, Firefox ESR \u003c 91.9, and Firefox \u003c 100.\n\n * CVE-2022-29916: Firefox behaved slightly differently for already known resources when loading CSS resources involving CSS variables. This could have been used to probe the browser history. This vulnerability affects Thunderbird \u003c 91.9, Firefox ESR \u003c 91.9, and Firefox \u003c 100.\n\n * CVE-2022-29917: Mozilla developers Andrew McCreight, Gabriele Svelto, Tom Ritter and the Mozilla Fuzzing Team reported memory safety bugs present in Firefox 99 and Firefox ESR 91.8. Some of these bugs showed evidence of memory corruption and we presume that with enough effort some of these could have been exploited to run arbitrary code. This vulnerability affects Thunderbird \u003c 91.9, Firefox ESR \u003c 91.9, and Firefox \u003c 100.",
        "Advisory": {
          "From": "errata.altlinux.org",
          "Severity": "Critical",
          "Rights": "Copyright 2023 BaseALT Ltd.",
          "Issued": {
            "Date": "2022-06-01"
          },
          "Updated": {
            "Date": "2022-06-01"
          },
          "bdu": [
            {
              "Cvss": "AV:N/AC:H/Au:N/C:C/I:C/A:C",
              "Cvss3": "AV:N/AC:H/PR:N/UI:R/S:U/C:H/I:H/A:H",
              "Cwe": "CWE-119, CWE-120",
              "Href": "https://bdu.fstec.ru/vul/2022-02138",
              "Impact": "High",
              "Public": "20220405",
              "CveID": "BDU:2022-02138"
            },
            {
              "Cvss": "AV:N/AC:L/Au:N/C:P/I:P/A:N",
              "Cvss3": "AV:N/AC:L/PR:N/UI:R/S:C/C:L/I:L/A:N",
              "Cwe": "CWE-416",
              "Href": "https://bdu.fstec.ru/vul/2022-02370",
              "Impact": "Low",
              "Public": "20220405",
              "CveID": "BDU:2022-02370"
            },
            {
              "Cvss": "AV:N/AC:L/Au:N/C:N/I:N/A:P",
              "Cvss3": "AV:N/AC:L/PR:N/UI:R/S:U/C:N/I:N/A:L",
              "Cwe": "CWE-400",
              "Href": "https://bdu.fstec.ru/vul/2022-02373",
              "Impact": "Low",
              "Public": "20220405",
              "CveID": "BDU:2022-02373"
            },
            {
              "Cvss": "AV:N/AC:L/Au:N/C:P/I:P/A:N",
              "Cvss3": "AV:N/AC:L/PR:N/UI:R/S:C/C:L/I:L/A:N",
              "Cwe": "CWE-20",
              "Href": "https://bdu.fstec.ru/vul/2022-02941",
              "Impact": "Low",
              "Public": "20220503",
              "CveID": "BDU:2022-02941"
            },
            {
              "Cvss": "AV:N/AC:L/Au:N/C:P/I:N/A:N",
              "Cvss3": "AV:N/AC:L/PR:N/UI:R/S:U/C:L/I:N/A:N",
              "Cwe": "CWE-203, CWE-399",
              "Href": "https://bdu.fstec.ru/vul/2022-02977",
              "Impact": "Low",
              "Public": "20220503",
              "CveID": "BDU:2022-02977"
            },
            {
              "Cvss": "AV:N/AC:H/Au:N/C:C/I:C/A:C",
              "Cvss3": "AV:N/AC:H/PR:N/UI:R/S:U/C:H/I:H/A:H",
              "Cwe": "CWE-119, CWE-120",
              "Href": "https://bdu.fstec.ru/vul/2022-02988",
              "Impact": "High",
              "Public": "20220503",
              "CveID": "BDU:2022-02988"
            },
            {
              "Cvss": "AV:N/AC:H/Au:N/C:C/I:C/A:C",
              "Cvss3": "AV:N/AC:H/PR:N/UI:R/S:U/C:H/I:H/A:H",
              "Cwe": "CWE-357, CWE-1021",
              "Href": "https://bdu.fstec.ru/vul/2022-03073",
              "Impact": "High",
              "Public": "20220503",
              "CveID": "BDU:2022-03073"
            },
            {
              "Cvss": "AV:N/AC:L/Au:N/C:P/I:P/A:N",
              "Cvss3": "AV:N/AC:L/PR:N/UI:R/S:C/C:L/I:L/A:N",
              "Cwe": "CWE-254, CWE-565",
              "Href": "https://bdu.fstec.ru/vul/2022-03074",
              "Impact": "Low",
              "Public": "20220503",
              "CveID": "BDU:2022-03074"
            },
            {
              "Cvss": "AV:N/AC:H/Au:N/C:C/I:C/A:C",
              "Cvss3": "AV:N/AC:H/PR:N/UI:R/S:U/C:H/I:H/A:H",
              "Cwe": "CWE-200, CWE-1021",
              "Href": "https://bdu.fstec.ru/vul/2022-03075",
              "Impact": "High",
              "Public": "20220503",
              "CveID": "BDU:2022-03075"
            },
            {
              "Cvss": "AV:N/AC:H/Au:N/C:C/I:C/A:C",
              "Cvss3": "AV:N/AC:H/PR:N/UI:R/S:U/C:H/I:H/A:H",
              "Cwe": "CWE-200",
              "Href": "https://bdu.fstec.ru/vul/2022-03076",
              "Impact": "High",
              "Public": "20220503",
              "CveID": "BDU:2022-03076"
            },
            {
              "Cvss": "AV:N/AC:H/Au:N/C:C/I:C/A:C",
              "Cvss3": "AV:N/AC:H/PR:N/UI:R/S:U/C:H/I:H/A:H",
              "Cwe": "CWE-264, CWE-281",
              "Href": "https://bdu.fstec.ru/vul/2022-03077",
              "Impact": "High",
              "Public": "20220503",
              "CveID": "BDU:2022-03077"
            },
            {
              "Cvss": "AV:N/AC:H/Au:N/C:P/I:P/A:N",
              "Cvss3": "AV:N/AC:H/PR:N/UI:N/S:U/C:L/I:L/A:N",
              "Cwe": "CWE-254",
              "Href": "https://bdu.fstec.ru/vul/2022-04617",
              "Impact": "Low",
              "Public": "20220405",
              "CveID": "BDU:2022-04617"
            }
          ],
          "Cves": [
            {
              "Cvss3": "CVSS:3.1/AV:N/AC:L/PR:N/UI:R/S:U/C:N/I:N/A:H",
              "Cwe": "CWE-416",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2022-1097",
              "Impact": "Low",
              "Public": "20221222",
              "CveID": "CVE-2022-1097"
            },
            {
              "Cvss3": "CVSS:3.1/AV:N/AC:L/PR:N/UI:R/S:U/C:N/I:N/A:H",
              "Cwe": "CWE-416",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2022-1196",
              "Impact": "Low",
              "Public": "20221222",
              "CveID": "CVE-2022-1196"
            },
            {
              "Cvss3": "CVSS:3.1/AV:N/AC:L/PR:N/UI:R/S:U/C:L/I:L/A:N",
              "Cwe": "CWE-295",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2022-1197",
              "Impact": "Low",
              "Public": "20221222",
              "CveID": "CVE-2022-1197"
            },
            {
              "Cvss3": "CVSS:3.1/AV:N/AC:L/PR:N/UI:R/S:U/C:N/I:L/A:N",
              "Cwe": "NVD-CWE-Other",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2022-1520",
              "Impact": "Low",
              "Public": "20221222",
              "CveID": "CVE-2022-1520"
            },
            {
              "Cvss3": "CVSS:3.1/AV:N/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H",
              "Cwe": "CWE-1321",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2022-1529",
              "Impact": "High",
              "Public": "20221222",
              "CveID": "CVE-2022-1529"
            },
            {
              "Cvss3": "CVSS:3.1/AV:N/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H",
              "Cwe": "CWE-1321",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2022-1802",
              "Impact": "High",
              "Public": "20221222",
              "CveID": "CVE-2022-1802"
            },
            {
              "Cvss": "AV:N/AC:L/Au:N/C:N/I:N/A:P",
              "Cvss3": "CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H",
              "Cwe": "CWE-1333",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2022-24713",
              "Impact": "High",
              "Public": "20220308",
              "CveID": "CVE-2022-24713"
            },
            {
              "Cvss3": "CVSS:3.1/AV:N/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H",
              "Cwe": "CWE-787",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2022-28281",
              "Impact": "High",
              "Public": "20221222",
              "CveID": "CVE-2022-28281"
            },
            {
              "Cvss3": "CVSS:3.1/AV:N/AC:L/PR:N/UI:R/S:U/C:N/I:N/A:H",
              "Cwe": "CWE-416",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2022-28282",
              "Impact": "Low",
              "Public": "20221222",
              "CveID": "CVE-2022-28282"
            },
            {
              "Cvss3": "CVSS:3.1/AV:N/AC:L/PR:N/UI:R/S:U/C:H/I:N/A:N",
              "Cwe": "CWE-125",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2022-28285",
              "Impact": "Low",
              "Public": "20221222",
              "CveID": "CVE-2022-28285"
            },
            {
              "Cvss3": "CVSS:3.1/AV:N/AC:L/PR:N/UI:R/S:U/C:L/I:L/A:N",
              "Cwe": "CWE-1021",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2022-28286",
              "Impact": "Low",
              "Public": "20221222",
              "CveID": "CVE-2022-28286"
            },
            {
              "Cvss3": "CVSS:3.1/AV:N/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H",
              "Cwe": "CWE-787",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2022-28289",
              "Impact": "High",
              "Public": "20221222",
              "CveID": "CVE-2022-28289"
            },
            {
              "Cvss3": "CVSS:3.1/AV:N/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H",
              "Cwe": "CWE-276",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2022-29909",
              "Impact": "High",
              "Public": "20221222",
              "CveID": "CVE-2022-29909"
            },
            {
              "Cvss3": "CVSS:3.1/AV:N/AC:L/PR:N/UI:R/S:C/C:L/I:L/A:N",
              "Cwe": "CWE-1021",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2022-29911",
              "Impact": "Low",
              "Public": "20221222",
              "CveID": "CVE-2022-29911"
            },
            {
              "Cvss3": "CVSS:3.1/AV:N/AC:L/PR:N/UI:R/S:C/C:L/I:L/A:N",
              "Cwe": "CWE-601",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2022-29912",
              "Impact": "Low",
              "Public": "20221222",
              "CveID": "CVE-2022-29912"
            },
            {
              "Cvss3": "CVSS:3.1/AV:N/AC:L/PR:N/UI:R/S:U/C:N/I:H/A:N",
              "Cwe": "NVD-CWE-noinfo",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2022-29913",
              "Impact": "Low",
              "Public": "20221222",
              "CveID": "CVE-2022-29913"
            },
            {
              "Cvss3": "CVSS:3.1/AV:N/AC:L/PR:N/UI:R/S:U/C:N/I:H/A:N",
              "Cwe": "NVD-CWE-noinfo",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2022-29914",
              "Impact": "Low",
              "Public": "20221222",
              "CveID": "CVE-2022-29914"
            },
            {
              "Cvss3": "CVSS:3.1/AV:N/AC:L/PR:N/UI:R/S:U/C:H/I:N/A:N",
              "Cwe": "NVD-CWE-noinfo",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2022-29916",
              "Impact": "Low",
              "Public": "20221222",
              "CveID": "CVE-2022-29916"
            },
            {
              "Cvss3": "CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H",
              "Cwe": "CWE-787",
              "Href": "https://nvd.nist.gov/vuln/detail/CVE-2022-29917",
              "Impact": "Critical",
              "Public": "20221222",
              "CveID": "CVE-2022-29917"
            }
          ],
          "AffectedCpeList": {
            "Cpe": [
              "cpe:/o:alt:spworkstation:8.4",
              "cpe:/o:alt:spserver:8.4"
            ]
          }
        }
      },
      "Criteria": {
        "Operator": "AND",
        "Criterions": [
          {
            "TestRef": "oval:org.altlinux.errata:tst:3001",
            "Comment": "ALT Linux must be installed"
          }
        ],
        "Criterias": [
          {
            "Operator": "OR",
            "Criterions": [
              {
                "TestRef": "oval:org.altlinux.errata:tst:20221983001",
                "Comment": "rpm-build-thunderbird is earlier than 0:91.9.1-alt0.c9.1"
              },
              {
                "TestRef": "oval:org.altlinux.errata:tst:20221983002",
                "Comment": "thunderbird is earlier than 0:91.9.1-alt0.c9.1"
              },
              {
                "TestRef": "oval:org.altlinux.errata:tst:20221983003",
                "Comment": "thunderbird-wayland is earlier than 0:91.9.1-alt0.c9.1"
              }
            ]
          }
        ]
      }
    }
  ]
}